[{"kids":[14231944,14232505,14232035,14232353,14233446,14233074,14233044,14233363,14232111,14232161,14233003,14232660,14231981,14233125,14232875,14232941,14232032,14232402,14232498,14233004,14232631,14232520,14232191,14232192,14233230,14231860,14231718,14232230,14232048,14232196],"score":70,"by":"zabana","descendants":49,"id":14231642,"text":"Hi HN,<p>I&#x27;ve been thinking about starting a blog &#x2F; news site covering topics like privacy, cryptography, robotics, software etc, with a critical view on their evolution and potential effects on society at large.<p>Ideally it would be made of long form, researched,  in depth articles and interviews with experts in those fields.<p>I&#x27;d also like to feature regular &quot;hackers&quot; doing cool stuff (like the guy who traveled to shenzhen to build his own iPhone)<p>What do you think of this idea ? Would you be interested in reading such a site if it existed ?","time":1493562347,"title":"Ask HN: Would you be interested in a “cyberpunk” inspired news site?","type":"story"},{"kids":[14232699,14232077,14232153],"score":3,"by":"vrypan","descendants":6,"id":14231957,"text":"Suppose you encrypt very sensitive and valuable data with the strongest available crypto. Would it be safe to store the encrypted data in public, for example in a blog post or a public github repo?","time":1493565794,"title":"Ask HN: Is it safe to publish sensitive data in public if encrypted?","type":"story"},{"by":"sherm8n","descendants":60,"id":14227063,"kids":[14227710,14227746,14227864,14229085,14227736,14229194,14227673,14228160,14227923,14227873,14227980,14227660,14227875,14228125,14227925,14227566,14228507,14227807,14229759],"score":187,"time":1493480670,"title":"Ask HN: How did you grow from 100 to 1,000 users?","type":"story"},{"kids":[14220489,14225521,14226312,14225203,14225238,14225014,14225114,14227650,14225085,14218505,14225063,14219623,14225130,14225099,14225084,14226987,14225237,14225062,14225255,14225051,14225100,14226509,14225315,14225440,14225780,14225869,14225538,14225598,14225072,14228688,14225098,14225010,14225042,14225157,14225192,14225016,14226530,14226024,14225934,14225580,14225286,14225364,14225382,14225464,14225361,14225017],"score":276,"by":"Superleroy","descendants":86,"id":14218408,"text":"I am currently in my ~8 year as a developer, doing my Masters degree while working as a part time developer.\nThat said i find it quite hard to keep improving, i know a lot of people that are better than me but i seem to be unable to really learn from them.\nWhat i found out is that i rarely take the time to lern something in depth because i mostly learn stuff to use it and tutorials seem to move at a way to slow pace, so i mostly skip them.<p>As an axample, i started out with C&#x2F;C++ development but am unable to keep up with the new standards. I see people write really nice code but whenever i sit down i just keep reusing what i know. The same goes for architecture, i have been building stuff for a long time but other people (with not that much experience) tend to be way better at abstracting stuff or architectual design than i am.<p>How do you guys keep lerning new stuff? Any techniques or tips?","time":1493377416,"title":"Ask HN: How do you keep improving?","type":"story"},{"by":"procrastinators","descendants":0,"id":14232198,"score":5,"text":"Colonising Mars for humanity to survive a possible mass extinction event on Earth, igniting an electric car revolution to accelerate the transition towards clean energy, creating a high throughput brain machine interface are the kind of solutions that would have a positive impact on humanity.<p>It seems very likely that there are more problems of these kind out there. If we don’t limit our thought process and start using the ‘First Principle’ approach, what are the other ‘Musk’ian problems that we can collectively come up with?","time":1493568645,"title":"Ask HN: What are the other ‘Musk’ian problems?","type":"story"},{"kids":[14231485,14231259,14230476,14230643,14230207,14231647,14230500],"score":10,"by":"pradeep_m","descendants":8,"id":14230175,"text":"There are quite a few startups that purport to match candidates with jobs based on their resumes?(Linkedin, Hired, etc). None of them seem to work very well.<p>The current state of the hiring process is to have recruiters curate the set of resumes that have applied for a job and then have the candidates go through an interview process (typically 1-2 phone screens + 4-5 onsite interviews). Most companies in the bay area have about a 5% conversion rate (Phone screen to offer).<p>Do you believe there is some latent information at the top of the funnel that can be added to make hiring more efficient? Can we increase the conversion rate beyond 5%?<p>Can the resume screening process by a recruiter be automated? If not, why not? It can be argued that we can build algorithms that remove bias and have a better conversion rate than 5%.","time":1493526923,"title":"Ask HN: Can you use AI/ML to match software engineering resumes with jobs?","type":"story"},{"kids":[14231145],"score":12,"by":"giis","descendants":1,"id":14230765,"text":"Recently came across this relatively little known channel[1]. Though it has only 6 videos and &lt;50k users, its good. Do you know such channels?<p>[1] https:&#x2F;&#x2F;www.youtube.com&#x2F;user&#x2F;PieterExplainsTech&#x2F;feed","time":1493544021,"title":"Ask HN: Whats your favorite YouTube tech channels but not famous?","type":"story"},{"kids":[14232823,14227522,14225089,14229421,14227161,14225820,14226177,14225447,14225866,14224908],"score":38,"by":"examcoffee","descendants":16,"id":14224446,"text":"How is your experience? Interests? Success to the point of professional maths community recognition?","time":1493428780,"title":"Ask HN: Anybody do maths as a hobby?","type":"story"},{"kids":[14210492,14209915,14210464,14209256,14210357,14210061,14209983,14211275,14209240,14210859,14209919,14210110,14210190,14213677,14210585,14214459,14210779,14210020,14209943,14209967,14210204,14211512,14210323,14210264,14212454,14212456,14210027,14210326,14210030,14209382],"score":136,"by":"user101010101","descendants":61,"id":14209168,"text":"We&#x27;re currently going through a bikeshedding discussion about the log format that our microservices will generate.<p>Developers without Ops responsibilities want the logs to be as readable as possible to aid their development process (traditional timestamp, severity, component, action and a quick description in a single line and, depending on the type of event, maybe a JSON object in many lines with details about the request, possibly with blank lines and indentation to make everything very easy to read).<p>Ops people want the files to be easily parseable for injection into ElasticSearch. They want to avoid complex configuration and want more flexibility to generate reports. If logs were generated in a single line in JSON format, they would be happy.<p>It seems there is no way to please everybody. Are there any standard formats that microservices-oriented architectures are using these days? Is there a standard at all? How to approach this?","time":1493267338,"title":"Ask HN: Best practices for log format?","type":"story"},{"kids":[14232912,14230769,14230386,14230156,14231033],"score":10,"by":"jihadjihad","descendants":5,"id":14228788,"text":"Upon hearing on HN today that Nautilus, a beloved science magazine, is struggling financially, I thought I&#x27;d ask the community about places online or in print to find excellent journalism. Any field or topic is fine--it doesn&#x27;t have to be constrained to science or politics. I&#x27;m just hoping others can find journalistic gems, as rare as they may be today.","time":1493500523,"title":"Ask HN: Where do you turn for high quality journalism?","type":"story"},{"kids":[14230805,14230775],"score":4,"by":"arco","descendants":2,"id":14230403,"text":"I am currently in graduate school working on my Masters in Computer Science. There are times when i get really stressed&#x2F;overwhelmed with academic work.<p>I wanted to gauge, what techniques&#x2F;methods do people in this community use to manage stress?","time":1493533756,"title":"How do you handle/deal with stress?","type":"story"},{"kids":[14224120,14224344,14224044,14223680],"score":30,"by":"throwawayasdasd","descendants":8,"id":14223259,"text":"Does anyone know any good resources for advanced web scraping (scraping at scale, getting around various tricks to prevent crawling, etc.)?<p>I&#x27;ve looked around a lot but nearly all resources I find are the same. A short description, a small code snippet and that&#x27;s it.<p>I&#x27;m really looking for more.","time":1493415347,"title":"Ask HN: Advanced web crawling resources?","type":"story"},{"kids":[14232908,14231480,14230134],"score":4,"by":"kmbd","descendants":5,"id":14229440,"text":"started working on a startup project with a friend recently. Like most of the other startups, we are trying to get up and running with a minimal budget. However, we need IaaS like aws, GCM, Azure.\nHowever, whichever we end up using, we&#x27;ll have  to get most out of the free-tier offeings.<p>How far you went with your products with freely-offered IaaS &#x2F;PaaS services? What&#x27;s your realization on the experience(s)?","time":1493509635,"title":"Ask HN: How far free IaaS products can take you?","type":"story"},{"by":"alinalex","descendants":1,"id":14229074,"kids":[14230023],"score":3,"time":1493504267,"title":"Ask HN: Which SaaS tool do you use to do your user onboarding?","type":"story"},{"by":"orschiro","descendants":6,"id":14225856,"kids":[14226729,14225945,14226606,14225906,14226702,14226844],"score":6,"time":1493461092,"title":"Ask HN: Which websites do you visit on a daily basis?","type":"story"},{"kids":[14218425,14218482,14218470,14218226,14218432,14218246,14218404,14218315,14218362,14223686,14218309,14221483,14218311,14219328,14218423,14230715,14229924,14218480,14218753,14218347,14218364,14218507,14229393,14228538,14218400,14218302,14218605,14218476,14218339,14218649,14226592,14218887,14218481,14225678,14218725,14224128,14221362,14218462,14218405,14218594,14221407,14218937,14218743,14218599,14218227],"score":62,"by":"martijn_himself","descendants":78,"id":14218177,"text":"Slightly tongue-in-cheek but nonetheless serious question. I&#x27;ve recently started looking into JavaScript UI frameworks and have the uneasy feeling they are actually worse than the now defunct Flash and Silverlight.<p>Angular and React seem to be a mish-mash of proprietary syntax and technologies (AtScript, JSX, TypeScript etc.) that paper over some of the cracks in JavaScript and CSS.<p>Are these transitory technologies that will be replaced by something better in the near future? Is there a better alternative available today?","time":1493374141,"title":"Ask HN: Is there a sane alternative to Angular and React?","type":"story"},{"kids":[14202381,14201646,14202390,14202650,14201324,14201620,14202031,14201505,14201511,14202076,14201425,14202538,14202252,14201940,14201304,14202432,14201287,14204992,14201435,14202018,14202536,14203684,14201739,14203127],"score":142,"by":"nanospeck","descendants":52,"id":14201207,"text":"This question was asked on both 2015 &amp; 2016 in HN. I would like to ask it again today to know what are the newest options for this.<p>Q: What would you recommend as a reasonably priced (sub 150$) quad-copter&#x2F;drone, that has a camera, the ability to be programmed (so that I can process video&#x2F;write my own stability algorithms for it), good range, and reasonable flying time?\nIn the event nothing fits that price point, any pointers on what the state of the art is?<p>Thanks!","time":1493192641,"title":"Ask HN (again): What is the best affordable programmable drone?","type":"story"},{"kids":[14231779,14222155,14221554,14219510,14218914,14221385,14226864,14221078,14219939],"score":20,"by":"becomethrow","descendants":25,"id":14218756,"text":"Recently i have had a number of friends and family members ask me how to get into programming as a profession.<p>I gave them a couple links to some online resources like coursera, learnpythonthehardway, and some mit opencourseware courses; but im not sure whether this really puts them on a path to programming as a profession.<p>So, i ask you HN, How would an non-fresh grad adult go about starting a career in programming without a degree in computer science?<p>Is a couple online courses and a twitter clone or so in your github profile all you need to get a real job these days? Do they need to pay thousands for some bootcamp to learn how to &#x27;hack the interview&#x27;? Open source contributions?  What is it that hiring managers are looking for in fresh programmers?<p>Thanks!","time":1493381705,"title":"Ask HN: What advice would you give someone who wants to become a programmer?","type":"story"},{"kids":[14218647,14218325,14219250,14217745,14218187,14218798,14221478,14219742,14218653,14219020,14225156,14222330,14219427,14223741,14218235,14218609,14219774,14218585,14227951],"score":52,"by":"shubhamjain","descendants":40,"id":14217701,"text":"I realised today that Google has a separate committee [1] from which the employee needs permission if she wants to continue working on the personal project and also retain the copyright. Otherwise, Google owns any IP created while you&#x27;re at the company.<p>How liberal is your company regarding personal projects?<p>[1]: https:&#x2F;&#x2F;opensource.google.com&#x2F;docs&#x2F;iarc&#x2F;","time":1493366736,"title":"Ask HN: What is your company's policy regarding side-projects?","type":"story"},{"kids":[14228600,14230678,14229810,14227991,14228039,14228328],"score":21,"by":"vazirthrowaway","descendants":9,"id":14227235,"text":"I currently work as a software engineer and have around ~15 years of experience. My current job is not bad and the technologies I work are current and emerging ones. I do actively spend time keeping tab on changing trends, and to keep pace with them. But I feel that my learning is shallow. Though I get a hang of new things I am not able to devote enough time (job&#x2F;family commitments, commute etc.) to focus and develop depth in some of the areas I am interested in.<p>With an intent of improving my tech chops I am thinking of a taking a break of around ~6 months (leave the current job and look for a new one after ~6 months).<p>During this period I plan to improve my tech skills with focus towards distributed systems. At the end of my break I look forward to work in\ndeveloping solutions that involve distributed systems or work in setup, management, and monitoring of complex distributed systems (dev OPS role).<p>Here is a list of things I intend to focus during my break:<p><pre><code>  -- refresh&#x2F;study datastructures, algorithms\n  -- learn a new programming language (thinking of Go, Rust)\n  -- learn a functional programming language (thinking of Erlang, or Haskell)\n  -- contribute to an open source project (currently I don&#x27;t have any list&#x2F;idea about ones I can look at)\n  -- get familiar with *nix internals\n  -- get a basic understanding of web security\n  -- A few MOOCs here and there\n  -- Read SICP (and similar texts). </code></pre>\n(I am skeptical about SICP goal as I don&#x27;t have a reading group to discuss things I study. I am afraid that reading alone with no discussion&#x2F;feedback I  will fall into the trap thinking that I have understood the topic despite gaps in my understanding.)<p>Given my intent I am requesting suggestions from HNers about the best possible ways to make effective use of the break I am planning for. Any other related suggestions are most welcome.<p>PS: I am currently based out of Bangalore<p>Thanks in advance.","time":1493482740,"title":"Ask HN: How to best utilize a 6 months sabbatical to improve technical skills","type":"story"},{"kids":[14223274,14224825,14221721,14222252],"score":14,"by":"tmaly","descendants":7,"id":14220678,"text":"Can anyone suggest free or paid tools that could handle complex business requirements creation.  I am looking for something that could handle a complex domain where there could be many questions that could arise from the business requirements document.  These questions would have to be reconciled before a proper specification could be created.","time":1493396220,"title":"Ask HN: Best tools to handle complex requirements writing?","type":"story"},{"by":"karthiksk2012","descendants":182,"id":14191161,"kids":[14191680,14192670,14192711,14193387,14194222,14191760,14191474,14194092,14191507,14191555,14192747,14193897,14192687,14191469,14192113,14226752,14191941,14194044,14191693,14191641,14196649,14196577,14192205,14206687,14191933,14193715,14193495,14194052,14193079,14191899,14191475,14192273,14196103,14193480,14192839,14191552,14193566,14194275,14191494,14193213,14192937,14193432,14204220,14195454,14192191,14198549,14194558,14194145,14192238,14192578,14192637,14195777,14191715,14194318,14191907,14197401,14191908],"score":481,"time":1493100454,"title":"Ask HN: How did you acquire your first 100 users?","type":"story"},{"kids":[14213842,14213299,14213113,14213784,14213038,14213873,14213754,14214408,14214140,14217592,14213794,14220060,14213972,14223114,14214438,14215491,14214481,14216262,14213768,14218656,14225770,14214230,14214394,14215456],"score":29,"by":"sergiotapia","descendants":37,"id":14213009,"text":"I want to teach my son how to program and I&#x27;ve been wondering what language to start with. I work with Ruby day-to-day but if I teach him that first I feel like it&#x27;ll sully him for other languages and &quot;taint&quot; him.<p>I was thinking of going with Go since it&#x27;s very basic, clean and explicit. It&#x27;s a C-style language so he will be able to branch out to other languages years down the line if he wants to.<p>On the other hand, distributed systems are on the rise and probably the future of computing. Something like Elixir will go a really long way in teaching how how to think in a functional, distributed manner.<p>What do you guys think? Fathers, what languages have you taught your son first?","time":1493312334,"title":"Ask HN: Is teaching my 8yr old son a functional language first a bad idea?","type":"story"},{"kids":[14232486,14214645,14215487,14214175,14213890,14218463,14215221],"score":30,"by":"ralmeida","descendants":9,"id":14213777,"text":"I take a lot of interest in the setup of development environments and how they affect productivity, and I hear a lot about the development environment at Google specifically (mainly on Quora and &#x27;word on the street&#x27;).<p>In particular, it seems that for most work, the actual machine being worked on is just a &#x27;terminal&#x27; for a more powerful machine accessed via SSH where the actual work (testing, builds, etc, is done).<p>I remember having read somewhere that developers are even not allowed to check out the repository in their local machines.<p>Is all this mostly true? Does it apply for all types of development (backend, frontend, mobile, tooling, etc)? I can see this working for backend development, but for mobile (or even maybe frontend), it sounds like a big hassle.<p>I would be interested in specific accounts of day-to-day work as well. For example, if you do use a remote machine for doing some type of work, does this mean that debugging is done accessing the IP of the remote machine directly from the local machine? Or all testing is done directly in the remote? Is this remote machine a remote desktop, or just a terminal? How is the connection between the machines made (apart from the SSH terminal the developer is operating)? Directly over the Internet? SSH tunnels? VPN?<p>I would also be interested in accounts from the other big players (Facebook, Amazon, Microsoft, Netflix, etc).","time":1493318655,"title":"Ask HN: What is the development environment at Google like?","type":"story"},{"by":"perfmode","descendants":3,"id":14228158,"kids":[14233266,14231953,14228277],"score":4,"time":1493492713,"title":"Ask HN: Simple accounting software for freelancers?","type":"story"},{"kids":[14215766,14230224],"score":14,"by":"mmanfrin","descendants":4,"id":14215551,"text":"In my career I&#x27;ve been spoiled with terrific devops coworkers who have generally handled everything from code to deploy. As a result, I feel I lack in expertise about devops that I should know as an engineer. Sideprojects of mine end up going on PaaS services like Heroku or Zeit and I don&#x27;t really learn what it means to set up a server.<p>For instance, I could tell you that you likely have a load balancer (like nginx) which you can use to point routes to different services, and I know that services are going to be things like node instances running my code; but everything I know is fairly superficial and lacking in depth. What is the best way to share secrets? Is there a standard way of having your load balancer know what services to feed to? How does a load balancer that defines routes work with a rails or express instance that also defines routes? Should all my services be built on vagrant, or has docker made that less useful?<p>I&#x27;ve been having trouble filling in these gaps in deep understanding because it seems like every setup is different, so cribbing from convention is not really possible -- and then I read a litany of stories of setups that are wrong in some way and that feeds in to this paralysis of not wanting to do things wrong.<p>I tried setting up a Kubernetes cluster along with Deis, but there are <i>so many layers</i> of different&#x2F;new services that I don&#x27;t know how to conceptually tie those back to a broader understanding. For instance, K8s has a load balancer &#x27;Ingress&#x27; -- does this negate the need for nginx? But then Deis installed its own load balancer so now I have two low balancers for zero services. It&#x27;s just confusing because the big picture is obscured by the novelty of everyones setup.<p>Thank you in advance for your help.","time":1493333940,"title":"Ask HN: Best resource for learning devops as an engineer (js/ruby)?","type":"story"},{"kids":[14213931,14213249,14212084,14214205,14226590,14229901,14214257,14212144,14212103,14218394,14216452,14213325,14212017],"score":23,"by":"goorley","descendants":31,"id":14211935,"text":"I’ve been having trouble on my path to become a professional software developer, and I would really love some help&#x2F;advice. A little over a year ago I moved to NYC to attend a Full Stack Python Coding Bootcamp. I flew through the course, and upon finishing had bright eyes and a lot of enthusiasm to begin a career in tech. The teachers threw their support behind me, and let me know that I was a strong developer (and more importantly a fast learner) and should have no problem finding a job. Fast forward to now - I have been looking for a career full time since July 2016 with no luck. I’ve been interviewing a lot, but ultimately get passed over for people with more experience. I’m going into debt at this point, and don’t know where to turn or what to do to get my shot.<p>I know companies here are really pressing a CS degree - which I don’t have. I do have a BS in Petroleum Engineer, and have work experience as an engineer. I also managed a Oil &amp; Gas service company in Africa for years before making this transition, so I have quality professional experience. I left my career to embark on this journey into technology, so I have proof of my passion and commitment to this change. I’m not sure where to turn or what to do at this point, but I know I want to be working in tech.<p>I have been a finalist for many jobs, but no offers to date. Some companies are great about going in another direction and giving feedback, and other companies give me none. Last month I interviewed at Foursquare - two phone interviews, a project, two more in person interviews - wait two weeks and receive a generic email (“While we felt your experience was great, it didn&#x27;t quite align with what we&#x27;re looking for at this time.”). I’ve sent emails asking for more feedback and received no replies.<p>If you have any thoughts as to what I can to do get my first job in technology, I would be grateful.","time":1493304841,"title":"Ask HN: I'm lost in my journey to become a developer","type":"story"},{"kids":[14215617,14215888],"score":13,"by":"CM30","descendants":2,"id":14215393,"text":"Yeah, we&#x27;ve seen those odd questions Google asks people interviewing for a developer role. I mean, thousands of articles have been wrote about that so far.<p>But what&#x27;s it like for everyone else who gets hired?<p>Because it&#x27;s obviously not all developers there. They&#x27;ve got people writing documentation, offering support to businesses for stuff like Adwords, various sales teams, etc. What do they go through when they&#x27;re interviewed by Google?<p>Is it as interesting as what the developers have to endure? Or does everyone else just get a plain old interview with standard questions and tasks?","time":1493332606,"title":"Ask HN: What's a non developer interview like at Google?","type":"story"},{"kids":[14220519,14223526,14225247,14220632],"score":7,"by":"Tackop","descendants":4,"id":14219273,"text":"Any recommended resources on how to plan a programming project? I know how to write code, but I want to know how to plan a project instead of winging it.","time":1493387016,"title":"Ask HN: How do I plan a programming project?","type":"story"},{"kids":[14228917,14225655,14225019],"score":4,"by":"yeodrone","descendants":4,"id":14225008,"text":"I work for a fairly large tech company that is known to make people work 60 hrs.<p>I have 10 yrs of software development  (9 years as hands on) experience. Last month I moved from Software Engineer to Technical Program Manager role.<p>I am wondering what are the salaries for non-engineering&#x2F;non-developer role?<p>I am looking for salaries for following roles<p>TPM (technical program manager)<p>Product Manager<p>Analytics Manager<p>Data Engineering lead (not a software engineer)<p>How much goog&#x2F;fb&#x2F;amazon&#x2F;apple&#x2F;Netflix pay for these roles?<p>You can share anonymously it you want.<p>Thanks!","time":1493439101,"title":"Ask HN: Salaries for non-engineering roles?","type":"story"},{"kids":[14219137,14219816,14219277,14219100,14219631,14219056,14219504,14219059,14219521,14219605,14219906,14220044,14219045,14222879,14223927,14219374,14219122,14219712,14219666,14225190,14219543],"score":69,"by":"soneca","descendants":46,"id":14218970,"text":"Hi, I am learning web development for the last 5 months (mostly Javascript). I am fairly good (for a junior dev) at the language and the technologies I focused (React), so I started to look for a job as junior web developer.<p>But I noticed that lack of knowledge and practice in testing is hurting my chances. I was assuming that it would be something I would better learn in practice as part of an experienced team in a professional environment and that it was ok for a junior dev not knowing much about it. I changed my mind, so...<p>What online resources are great as an introduction to testing?","time":1493384129,"title":"Ask HN: What's the best way to learn about testing/TDD?","type":"story"},{"by":"kamranahmed_se","descendants":11,"id":14226574,"kids":[14227429,14229880,14229853,14229933,14230024,14227331,14229634,14226809,14227988,14230219],"score":8,"time":1493473676,"title":"Ask HN: What are the best noise cancelling headphones?","type":"story"},{"kids":[14215985,14222702,14216807,14215447,14215155,14215690,14216911],"score":14,"by":"toexitthedonut","descendants":13,"id":14214623,"text":"I hope I&#x27;m not the only one feeling like this. Well, being without a job adds to that, but overall I don&#x27;t have many connections to other software engineers.<p>I graduated with an art degree with a focus in web design&#x2F;web development. None of my high school friends or college friends are software engineers. They don&#x27;t even know of anyone who is or is hiring in a company (so even 2 degrees of separation is hard to find).<p>Everyone in my family works in blue collar jobs or service jobs. They don&#x27;t have any strong connects in the tech world either. That goes the same for extended family, like my mom&#x27;s cousin and their children.<p>The only way I can stay in touch with other software developers is to go to local meetups. And sometimes chatting&#x2F;emailing with them, which I usually do when I&#x27;m at Starbucks (there&#x27;s no internet at home).<p>Maybe it&#x27;s due to living in Chicago that makes it a bit more difficult. Still, a software engineer that&#x27;s not friends with any software engineers, kinda weird? Anyone else in the same spot?","time":1493326503,"title":"Ask HN: Anyone else not feel very connected with the local tech scene?","type":"story"},{"kids":[14203066,14204804,14203976,14203860,14216960,14203327,14203213,14208262],"score":39,"by":"jmstfv","descendants":21,"id":14202557,"text":"Using named-entity recognition, how to extract book titles from HN comments? Should I train NER chunker on HN data?","time":1493211765,"title":"Ask HN: Extracting book titles from comments","type":"story"},{"kids":[14223478,14228338,14225087,14223286,14225240,14224723,14223378,14227020,14224279],"score":6,"by":"teachrdan","descendants":12,"id":14223180,"text":"I&#x27;m have $5000 to setup my desk at my new engineering gig. I already have a mechanical keyboard and noise canceling headphones. Besides a new MacBook Pro and a big monitor, how would you spend the rest of that budget?","time":1493414720,"title":"How would you spend a $5k setup budget?","type":"story"},{"by":"rustoo","descendants":0,"id":14213819,"score":10,"time":1493319148,"title":"Ask HN: What are some of the best ways to learn design thinking?","type":"story"},{"kids":[14184002,14183625,14183492,14186093,14183941,14184842,14183773,14183747,14184445,14185383,14184443,14184039,14184455,14183480,14184576,14185037,14184721,14184085,14184280,14184195,14185212,14219214,14183565,14183425,14187302,14184093,14187714,14184449,14183570,14186307,14186710,14184789,14184158,14186535,14185225,14205009,14209537,14199640,14185453,14183567,14184419,14186655,14205433,14189266,14189167,14183765,14186576,14188556,14185569,14184476,14184818,14185092,14190457,14184453,14189173,14192342,14188181,14184333,14186966,14187038,14184184,14184205,14183978,14184562,14187856,14188202,14183465,14187194,14183670,14184921,14184321,14183642,14183898,14184345,14184138,14183588,14185430,14184348],"score":191,"by":"kuro-kuris","descendants":133,"id":14183219,"text":"Hi HN,\nI enjoyed volunteering teaching children to code back at university and during the holidays I like gathering food for homeless people.\nWhat kind of volunteering has helped you grow the most? What kind of volunteering do you find the most fulfillment from?<p>Discussion about volunteering software skills online: https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=13678952 I am looking for something more physical or personal in London. Feel free to get in touch to chat more about volunteering, we can grab a coffee if you are in London.","time":1493030516,"title":"Ask HN: How has volunteering helped you grow?","type":"story"},{"kids":[14206520,14209863,14205727,14209894,14208515,14208453,14213952,14208438,14211265],"score":19,"by":"janwillemb","descendants":16,"id":14203547,"text":"I&#x27;m a programmer. Although I want to, I don&#x27;t &quot;get&quot; networking. I don&#x27;t know the difference between a router and a switch. Is there a good primer on these things from which the &quot;getting&quot; could start?","time":1493219019,"title":"Ask HN: Networking primer for programmers","type":"story"},{"kids":[14225245],"score":7,"by":"SolveEverything","descendants":2,"id":14224958,"text":"for significant context based on HN links and comments, I posted a cleaner, formatted version on --<p>* https:&#x2F;&#x2F;medium.com&#x2F;@SolveEverything&#x2F;ask-hn-learning-math-practically-examples-from-real-life-links-inside-2ea752f8c5d7<p>--<p>An old post, due to the 2000 characters limit.... and was uploaded to:<p>* https:&#x2F;&#x2F;pastebin.com&#x2F;rnywXAVh<p>* http:&#x2F;&#x2F;textuploader.com&#x2F;druk9","time":1493438120,"title":"Ask HN: What's the Best Learn-Practical-Math with Real Life Examples Resource?","type":"story"},{"by":"rsp1984","descendants":26,"id":14202164,"kids":[14203080,14204797,14204533,14204505,14204423,14209488,14215746,14206141,14204280,14207579,14202219,14206718,14205912,14222556,14203488,14202886,14208329,14209489],"score":16,"time":1493206721,"title":"Ask HN: What do you do while your code compiles?","type":"story"},{"by":"jacquesm","descendants":0,"id":14215646,"score":7,"text":"This subject comes up a lot lately and there is much speculation but not much in terms of evidence. So, if you&#x27;re working at Google, did you apply for permission in such a case and did you receive a &#x27;yes&#x27; or a &#x27;no&#x27; answer?","time":1493334986,"title":"Ask HN: Google employees, did you get permission for a commercial side project?","type":"story"},{"kids":[14199799,14197248,14196295],"score":21,"by":"dorgo","descendants":2,"id":14196064,"text":"Everybody is obsessed with ML here, but there is still no recommender system for hacker news?","time":1493141939,"title":"Why there is no recommender system for hacker news?","type":"story"},{"kids":[14224240],"score":6,"by":"verdverm","descendants":1,"id":14224206,"text":"Seeking advice, resources, and war stories","time":1493424866,"title":"Ask HN: How to brand and land your first consulting gig?","type":"story"},{"kids":[14216354],"score":13,"by":"rooliins","descendants":1,"id":14207604,"text":"Does anyone know if there are any tools&#x2F;frameworks for building the functionality for step-by-step code tutorial websites (bonus if it has an interactive code editor where the user can see what they&#x27;re doing reflected as they code).\nOr are these things custom made in-house?<p>A good example is O&#x27;Reilly Oriole: https:&#x2F;&#x2F;www.oreilly.com&#x2F;learning&#x2F;regex-golf-with-peter-norvig or CodeAcademy.","time":1493245574,"title":"What Powers Step-By-step Code Tutorial Websites?","type":"story"},{"kids":[14223820,14224348,14223862,14224244,14223760,14224246],"score":3,"by":"jk801","descendants":8,"id":14223694,"text":"Someone is using my Spotify Premium account from an Android device that I don&#x27;t own. I even changed my password, logged out everywhere, deleted offline devices and use two-factor Facebook auth. as login, but that same person still has access and creates random playlists within my account. With 2FA and a strong password, I&#x27;m thinking it&#x27;s a breach on Spotify&#x27;s side rather than my account being hacked. Does anyone have a clue what might be happening?","time":1493418893,"title":"Is Spotify hacked?","type":"story"},{"kids":[14181197,14188283,14181179,14182824,14202643,14182044],"score":39,"by":"gdfer","descendants":14,"id":14180524,"text":"I received a computer science degree ~12 yrs ago and have worked successfully in the field as programmer, team lead and dev manager. Most of my experience comes from developing enterprise apps in Java.<p>While I&#x27;ve had a successful career thus far, consistently get great reviews &amp; make a good wage, I am also getting ... bored I guess.<p>I&#x27;m considering various options -one idea that&#x27;s piqued my interest lately is furthering my education a bit (would have to do online learning) and making a transition to working in a more specialized area of comp sci such as cyber security or machine learning. I don&#x27;t have much experience in cyber security (have done some pen testing&#x2F;fixing of java web apps -OWASP type stuff) and have virtually no experience with AI&#x2F;machine learning concepts. I just find these things fascinating.<p>I guess I&#x27;m curious: Has anyone made a similar career change from a more general developer type of role to something like cyber security or machine learning? How did that go for you? What should my expectations be and what are some suggestions for investigating and going about this?<p>Lastly -I don&#x27;t work in or near a big city and would probably have to work remotely (I&#x27;ve been doing remote Java consulting successfully for a while) or move. Not sure if these specializations are conducive to remote workers so I wonder if anyone can shed any light on that.","time":1492982398,"title":"Ask HN: Career change from general java dev to cyber security/machine learning","type":"story"},{"kids":[14189704,14190785,14189905,14189730,14189712,14189950,14190194],"score":36,"by":"CCing","descendants":33,"id":14189251,"text":"Hi guys,<p>I&#x27;m working on a project and I&#x27;m raising about $ 100k from some friends and angels(some are based in US)<p>I&#x27;m a european citizen and some investors want that I move to silicon valley(and I&#x27;m ok with that), but how can I legally do ? what visa options do I have ?<p>I&#x27;ve heard of E-2 Visa[1] but I don&#x27;t have any money in cash that I can invest into my business.<p>I know that i should hear a lawyer but I want first understand what my options are(and if I can use my startup IP as asset)<p>How do you have done ?<p>Thank you.<p>[1] https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;E-2_visa","time":1493075113,"title":"Ask HN: US Visa for foreign founders after first seed","type":"story"},{"by":"fosco","descendants":7,"id":14208455,"kids":[14208719,14213434,14208774,14208498],"score":14,"time":1493256060,"title":"Ask HN: Does a IRC or equivalent chat exist for HNers?","type":"story"},{"by":"leonagano","descendants":7,"id":14222219,"kids":[14227045,14229460,14227491,14222340,14224593],"score":8,"time":1493406800,"title":"Ask HN: What are the most impressive offices you have ever been to/worked from?","type":"story"},{"kids":[14222182],"score":3,"by":"user101010101","descendants":3,"id":14222071,"text":"Not just building things when there are commits but running backups, enabling ChatOps, etc. Is it currently up to the task? Or is Jenkins more flexible&#x2F;capable in that regard?","time":1493405806,"title":"Ask HN: Can GitLab CI support complete infrastructure automation?","type":"story"},{"kids":[14202330,14193250,14194819,14202298,14191936,14212416,14196313],"score":26,"by":"drogonmead","descendants":10,"id":14191043,"text":"Planning my next career move...<p>I&#x27;m an experienced lead software engineer (streaming, big data, analytics), having worked for large tech companies as well as successful startups. I enjoy engineering as well as business strategy, management, writing, and public speaking. I&#x27;ve always wanted to work for myself, and I&#x27;d love to be able to combine my skills in a consulting capacity.<p>I&#x27;m concerned because many friends and contacts have done independent consulting only to eventually drift back into traditional employment.<p>Has anyone here made a successful transition from experienced employee to independent consultant? How&#x27;s it going so far? Do you feel that it&#x27;s going to be sustainable for the next few years?","time":1493098386,"title":"Ask HN: Is independent consulting a sustainable tech career path in 2017?","type":"story"},{"kids":[14201285,14208222,14202867,14207839,14201912,14201573,14202335,14202109,14201085,14205698,14201345,14201857],"score":21,"by":"usaphp","descendants":11,"id":14200122,"text":"I am wondering if there are any downsides of using white noise during work and&#x2F;or during sleep.","time":1493175704,"title":"Ask HN: Is white noise good for you?","type":"story"},{"kids":[14221208,14222458,14221000,14225252],"score":3,"by":"tomw1808","descendants":4,"id":14220796,"text":"Hi HN.<p>I know many of you probably use static site generators. Question for me to those who use a CMS:<p>* What&#x27;s the name (link)?<p>* Would you recommend it?<p>* Why yes, why no?<p>:)","time":1493396987,"title":"Ask HN: What CMS are you using?","type":"story"},{"kids":[14220260,14219865,14224399],"score":5,"by":"bsvalley","descendants":5,"id":14219857,"text":"We&#x27;ve all heard of the &quot;Big 4&quot;, in reference to the most praised companies in Tech. Apple, Google, Facebook, ?? Which one is the 4th one? Just curious.","time":1493391421,"title":"Ask HN: Which company is the 4th of the Big-4?","type":"story"},{"kids":[14212630,14216271,14223807,14212520,14213640],"score":6,"by":"Mister_Y","descendants":8,"id":14212451,"text":"I am developing my own startup and thinking about the next step I am wondering whether develop an Android app or a website. Is a social platform where users can interact. I have knowledge in Android so I could develop the app, and HTML&amp;CSS but not enough to create the website.<p>The question is, what will be more efficient, to create the app, or learn more about lets say PHP and create the web, or maybe use a CMS as Elgg to create it","time":1493308543,"title":"Ask HN: Is it better building an app or a website for an mvp?","type":"story"},{"kids":[14213264,14211961,14212599],"score":4,"by":"desperado","descendants":7,"id":14211854,"text":"Hey guys and girls ;)<p>I&#x27;m at my wits end, and need advice. The site http:&#x2F;&#x2F;www.gfxtraz.com uses stolen credits cards, signs up to our site through Amazon IP addresses, downloads our files, and makes them available for download.<p>This happens on an almost daily basis, and it is really starting to hurt us. Not only are our files available for free, but we end up having to pay chargeback fees with Stripe for every stolen credit card charge.<p>It seems as though if you file an abuse complaint with their registrar, they simply allow the site to change domain names. It was previously Gfxtra.<p>This is not only an issue for us but also for Envato, Creative Market, and the list goes on....<p>Is there anything we can do?<p>Thank you in advance!","time":1493304360,"title":"Ask HN: What can we do to stop piracy?","type":"story"},{"kids":[14206967,14209636],"score":9,"by":"wonder_bread","descendants":2,"id":14206118,"text":"Uber&#x27;s entire timetable towards a profitable business model depends on being (among the) first to market with a competitive A to B self-driving solution. If Waymo err.. Google err.. Alphabet gets the victory in District court, what becomes of one of the fastest growing businesses in the world?","time":1493234493,"title":"Ask HN: What becomes of Anthony Lewandowski and Uber if Google Wins?","type":"story"},{"kids":[14210036,14193952,14191709,14202413,14208650,14191518,14194259,14195835,14193836,14201225],"score":23,"by":"Theaxiom","descendants":23,"id":14191369,"text":"Today, less than 2 months after launching the beta of my social learning platform, Taughtful (taughtful.com); I received a cease and desist letter from Pluralsight&#x2F;Smarter stating that Taughtful is too similar to Smarter and that I have willfully stolen their intellectual property. Taughtful is 100% my own code, my own design and my plans extend far beyond the original scope of Smarterer. You can read the entire C&amp;D letter here, which I have already forwarded to my attorney: https:&#x2F;&#x2F;drive.google.com&#x2F;open?id=0B741TFQThWSldVpaR2tEMGVubU0<p>For those who are not familiar with Smarterer, it was formerly a free website where people could create and take skills tests online. They had an extensive API which allowed integration into services such as eLance, etc.<p>Fast-forward to today, Smarterer.com got bought out by Pluralsight and absorbed into their monolithic learning solution and is no longer publicly accessible. They essentially took this wonderful crowd-sourced learning tool and closed it off, for profit.<p>I have been designing a similar platform for well over a year now and back on March 15th I launched my beta.<p>I have much more plans beyond just crowd-sourced skills testing with machine-learning in the background, but that is where I have started. I have plans to parter with recruiters and organizations so people can automatically apply for jobs by taking skills tests, I plan on exposing a developer API, building in social-networking aspects into the platform so people can teach&#x2F;learn from each-other, the ability for people to create and charge for courses, etc. I want to disrupt the public education system. If you want to learn more about the future plans, check out https:&#x2F;&#x2F;taughtful.com&#x2F;about<p>I welcome any comments on this matter, I personally would love to hear any and all feedback, be it positive or negative. Thanks!","time":1493103763,"title":"Smarterer/Pluralsight Wants Me to Cease and Desist Taughtful.com","type":"story"},{"by":"jmstfv","descendants":16,"id":14179534,"kids":[14180584,14181634,14180861,14180632,14189854,14180985,14181643,14192876,14180162,14182876,14180791,14181186,14181861,14179799],"score":25,"time":1492971842,"title":"Ask HN: What are some reliable sources on nutrition?","type":"story"},{"kids":[14201737,14196365,14194328,14199278,14194291,14195295,14199724,14199875],"score":15,"by":"reviseddamage","descendants":15,"id":14194166,"text":"He is 7, and has receptive and expressive disorders in language. On all other matters, he is doing just fine, excels in math and generally picks up new skills rather quickly, other than ones where communicating is a key component. I wanted to know if there are tools, software, apps, games that would help him (or kids like him) learn how to code (any software language) while gamifying. His addiction is beating high scores and achievement unlocking for virtually every game he plays on ipad or PC. Many thanks!","time":1493132826,"title":"Ask HN: How do i teach my autistic son to code?","type":"story"},{"kids":[14193068,14194950,14193110,14194637,14202091,14202092],"score":18,"by":"stephenheron","descendants":7,"id":14192974,"text":"I seemed to have avoided taking any sort of notes for most of my professional career mostly relying on my memory. However as I get a touch older I can sense that I am forgetting certain points from meetings etc.<p>I am looking for advice on how others take notes or perhaps some good resources on note taking. It seems like such a simple skill but it is one I am definitely missing out on!<p>Thanks!","time":1493124822,"title":"Ask HN: How to take notes?","type":"story"},{"kids":[14217794,14218209,14217702,14217645],"score":4,"by":"polm23","descendants":4,"id":14217305,"text":"For running chains of multi-hour jobs with dependencies I&#x27;ve always used Jenkins but always been unsatisfied with it. I&#x27;ve also heard of Luigi but haven&#x27;t given it a shot yet. Is there anything else similar I should look at? I&#x27;ve had trouble finding a single name for programs like this to search with.<p>Luigi: https:&#x2F;&#x2F;github.com&#x2F;spotify&#x2F;luigi<p>Example jobs:<p><pre><code>  - download a bunch of raw data from different sources\n  - clean and transform raw data into a single format\n  - push a lot of data into a DB\n  - routine ML model updates\n  - generate reports\n</code></pre>\nThese would have dependency relations, some would be short and some would be long, sometimes they fail (which may be important or not), etc...","time":1493361590,"title":"Ask HN: What do you use to manage chains of long-running jobs?","type":"story"},{"kids":[14217260,14217696,14217607,14218528,14217311,14218366,14218449,14218673],"score":8,"by":"butabah","descendants":8,"id":14217193,"text":"I&#x27;m currently on track for my fourth year at my current company. It&#x27;s been my first job out of college. I&#x27;ve been having good growth, good raises and was promoted recently.<p>I&#x27;ve been thinking about changing companies, not because I&#x27;m currently bored or have problems with my current position. Merely because I think I&#x27;ve been with this company a long time.<p>Thoughts?","time":1493359868,"title":"Ask HN: Would you leave your company just because you've been there for a while?","type":"story"},{"kids":[14192649,14192483,14201740],"score":11,"by":"_justinfunk","descendants":5,"id":14192216,"text":"Weather visualization and forecasting seems right in Google&#x27;s wheelhouse. Nearly infinite data to train on, a perfect platform for visualizing the data (google earth), etc. Is there just no upside for them?","time":1493116069,"title":"Ask HN: Why doesn't Google own the weather?","type":"story"},{"by":"xcoding","descendants":18,"id":14191568,"kids":[14200968,14192165,14192907,14191691,14200438,14199936,14199624,14191603,14197147,14203570,14191973,14199164],"score":17,"time":1493106904,"title":"Ask HN: Which static site generator you use?","type":"story"},{"by":"bizon","descendants":7,"id":14213967,"kids":[14214265,14214532,14216681,14214501,14214211,14214186],"score":7,"time":1493320585,"title":"Ask HN: Who's the DHH for Node.js?","type":"story"},{"kids":[14216479],"score":4,"by":"johnhenry","descendants":1,"id":14216342,"text":"I got a message on facebook stating that facebook has blocked the ability to share posts about UC Berkeley. Sure enough, I am unable to share that post...","time":1493344197,"title":"Ask HN: Has Facebook blocked posts about the protests at UC Berkeley","type":"story"},{"kids":[14210944,14208466,14207965],"score":11,"by":"kevintb","descendants":3,"id":14207613,"text":"&gt; President Trump is likely to sign an executive order formally withdrawing the United States from the North American Free Trade Agreement, according to a senior administration official, a move that would set the stage for renegotiating the deal with Canada and Mexico and fulfill one of Mr. Trump’s major campaign promises.<p>https:&#x2F;&#x2F;www.nytimes.com&#x2F;2017&#x2F;04&#x2F;26&#x2F;us&#x2F;politics&#x2F;nafta-executive-order-trump.html","time":1493245683,"title":"Canadians on TN Visas: What's your plan when the US withdraws from NAFTA?","type":"story"},{"kids":[14181360,14187604,14183167,14182908,14188142,14180809,14200107,14179143,14184337,14181985,14181961,14191220],"score":17,"by":"pacuna","descendants":15,"id":14179110,"text":"I&#x27;m talking newsletter&#x27;s articles or anything you find interesting but don&#x27;t have time to read at that moment.I&#x27;ve tried Instapaper and Pocket but I&#x27;m would like to know if anyone has any more tips on this.","time":1492967841,"title":"Ask HN: How do you manage your to-read articles?","type":"story"},{"kids":[14183689,14184217,14183917,14183370,14184154,14184415,14183811,14184406,14183958,14184330,14184092,14183454,14184140,14183927,14189541,14184198,14183519,14184057,14193864,14183875,14184600,14184304,14183916,14183812,14184167,14185387,14183815,14183436,14184824,14183992,14183787,14184130,14184410,14185073,14183852],"score":69,"by":"zabana","descendants":63,"id":14183121,"text":"I keep reading about AWS killing the DevOps profession and was wondering what were your thoughts on the matter ? Is DevOps dying as a profession ?","time":1493028999,"title":"Ask HN: How do you define DevOps and is it dead?","type":"story"},{"kids":[14214477],"score":2,"by":"prostanac","descendants":1,"id":14214095,"text":"Ask HN: Does a IRC or equivalent chat exist for HNers? - https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=14208455","time":1493321866,"title":"Ask HN: Does a IRC or equivalent chat exist for HNers?","type":"story"}]