{"14228620":{"time":1493498291,"type":"story","descendants":3,"title":"Machine Learning: Regression of 911 Calls","kids":[{"by":"minimaxir","id":14229081,"kids":[{"by":"lukasz_km","id":14230151,"parent":14229081,"text":"Minimaxir thanks for comment. \nRegarding &quot;accuracy&quot; I agree that this word usage is unfortunate in case of R2. A &quot;goodness&quot; would be better description of R2.\nRegarding the &quot;one-hot&quot; encoiding of inputs, I would say - it depends. I know it is a common practice to do &quot;one hot&quot; encoding in Machine Learning. There are cases when it really helps the model to converge (for example, sometimes Neural Networks would require such curation of input).\nHowever, model that I have used in my post is Decision Tree based. And when you think for a moment about it, Decision Tree based model should handle numerical input just fine. Usually, Decision Tree based models do not even require standardization&#x2F;normlization of input and work correctly without it.","time":1493526270,"type":"comment"}],"parent":14228620,"text":"The model is predicting the number of 911 calls is dependent on latitudes and longitude...naturally, it would be expected that the number of 911 calls be strongly correlated with the amount of potential victims. (&quot;The model score (R2) is 0.81, so its accuracy is significant&quot; is an incorrect interpretation of the R2; it indicated the amount of variation explains by the model, which is much different from an accuracy metric, and the high value could be explained by the correlation)<p>I built a similar model which predicts the types of crimes in San Francisco using LightGBM (better than xgboost which is better than scikit-learn&#x27;s GBMs&#x2F;GBTs), filling lat&#x2F;long, month, day-of-week, hour, and year (<a href=\"http:&#x2F;&#x2F;minimaxir.com&#x2F;2017&#x2F;02&#x2F;predicting-arrests&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;minimaxir.com&#x2F;2017&#x2F;02&#x2F;predicting-arrests&#x2F;</a>). The classification aspect is much tricker than a simple regression. But even then, latitude and longitude constituted 70% of the Gain in the GBM model.<p>(as an aside, day-of-week&#x2F;hour should likely be encoded as categorical variables using one-hot-encoding, although when I tested that in my post, the results were unchanged, oddly)","time":1493504406,"type":"comment"},{"by":"slavakurilyak","id":14229531,"parent":14228620,"text":"TL;DR<p>It&#x27;s possible to predict the location and quantity of 911 calls based on call data (accident time, description of emergency calls and geolocation data) using Regression analysis","time":1493511519,"type":"comment"}],"id":14228620,"score":36,"url":"http://machinelearningexp.com/machine-learning-regression-911-calls/","by":"lukasz_km"},"14228647":{"by":"tjalfi","descendants":0,"id":14228647,"score":1,"time":1493498724,"title":"When Douglas met Struan (2012)","type":"story","url":"https://lifeinthefastlane.com/when-doug-met-struan/"},"14228912":{"time":1493501901,"type":"story","descendants":40,"title":"How to Read a Paper (2016) [pdf]","kids":[{"by":"haffi112","id":14230627,"parent":14228912,"text":"&gt; The first version of this document was drafted by my students: Hossein Falaki, Earl Oliver, and Sumair Ur Rahman.<p>The paper is two pages. Why aren&#x27;t these people included as authors then...?","time":1493539906,"type":"comment"},{"by":"AndrewOMartin","id":14229414,"kids":[{"by":"nickpsecurity","id":14229459,"kids":[{"by":"Cyph0n","id":14229673,"kids":[{"by":"yomly","id":14230853,"parent":14229673,"text":"If you&#x27;ve ever read a STEM textbook that gives references, you&#x27;ll often find an entire paper or PhD thesis condensed into a sentence...","time":1493547150,"type":"comment"},{"by":"nickpsecurity","id":14229699,"kids":[{"by":"Cyph0n","id":14229854,"kids":[{"by":"colmvp","id":14231358,"parent":14229854,"text":"I think you&#x27;re correct in your intuition.<p>I recall watching a recent talk by Andrew Ng who mentioned that reading research papers is a key method in improving as deep learning specialist &#x2F; data scientist, but that one should temper their expectations of knowledge acquisition. One might spend a Sunday trying to go deep into a paper, but at the end of the weekend that person may barely get much out of it. He even admits that sometimes it takes him a couple reads over a course of several sessions to fully grasp a new concept. Which isn&#x27;t all that surprising given the information asymmetry between the authors and the reader.","time":1493558050,"type":"comment"}],"parent":14229699,"text":"True, but reading the intro and background&#x2F;prior work sections takes approx. 5-10 minutes. And depending on the length of the paper, these sections may be pretty succinct and therefore not very helpful to a reader unfamiliar with the state of the art.<p>I agree. You can usually understand the general contributions and how they work at a high level pretty easily. But intuitively and deeply understanding a paper takes much more time from my experience. Again, YMMV.<p>I also have almost zero experience with analog haha! I&#x27;m going to be taking an intermediate course on analog circuits next semester. I&#x27;m interested in jumping into the field of analog hardeare security, so it&#x27;s a necessary first step.","time":1493518604,"type":"comment"}],"parent":14229673,"text":"The background accumulates as you thoroughly read them. You can understand a lot without knowing all the specifics. The good papers will usually explain the challenges, approaches so far, their weaknesses, their solution, and future work that&#x27;s essentially the solution&#x27;s weaknesses. One can get pretty far with that. Even formal verification papers were easy to follow <i>on general idea of their methods or results</i> without know the specialist stuff. Same with digital design. I only started getting slowed down, ineffective, or stomped when it was about analog or RF papers. It&#x27;s why I keep saying one might not be able to cheat those. Not entirely, anyway: my abstract predictions of techniques like A2, the fab material mod, semi-automated synthesis with stochastic methods, or chaining gates together in tamper-resistance show my almost detail-less mental model is still better than nothing. I already had mitigations for two just guessing something might happen with that mental model. ;)","time":1493515339,"type":"comment"}],"parent":14229459,"text":"It typically takes much longer to actually understand the contribution of a paper in engineering fields (EE, for example). Of course, it depends on how much background you have prior to reading the paper.","time":1493514677,"type":"comment"},{"deleted":true,"id":14229723,"parent":14229459,"time":1493515702,"type":"comment"},{"by":"fizixer","id":14229667,"kids":[{"by":"nickpsecurity","id":14229692,"parent":14229667,"text":"At least six. Maybe more. Obsessively, too, as it was my grand challenge problem to solve all of it with a holistic solution. Got pretty close conceptually from a number of angles. End result was software or especially hardware options will need to be developed by specialists at significant cost. Now, I still collect the science while looking at marketing or development strategies a bit more.","time":1493515061,"type":"comment"}],"parent":14229459,"text":"I assume you&#x27;re talking about a time frame of many years.","time":1493514581,"type":"comment"}],"parent":14229414,"text":"It&#x27;s how I got through over 10,000 papers on IT and INFOSEC. When they&#x27;re well-written, I could look at the abstract, a select bit of details, related work, and conclusion. Would take me about a minute or so a paper once I got good at it. Sometimes less. Some papers were more complex or just not well written where it took significantly more time to evaluate them. All in all, though, the speed reading methods save a ton of time.","time":1493510207,"type":"comment"},{"by":"tomsthumb","id":14230380,"kids":[{"by":"submeta","id":14231403,"parent":14230380,"text":"I was about to mention the same book and the same idea out of that book. It&#x27;s written by Adler and van Doren.","time":1493558871,"type":"comment"},{"dead":true,"deleted":true,"id":14231405,"parent":14230380,"time":1493558873,"type":"comment"}],"parent":14229414,"text":"This is the first phase of syntopical reading discussed in &quot;How to read a book&quot;, which is a great book about reading other (mostly nonfiction) books.","time":1493533175,"type":"comment"}],"parent":14228912,"text":"I was all ready to mock this by saying how most papers get only 1) Read the abstract, 2) Read the conclusion, 3) Look at the graphics, from me.<p>Turns out that it&#x27;s basically what the paper says, but then goes into more detail about going into more detail. Worth at least a second pass :)","time":1493509146,"type":"comment"},{"by":"tpetricek","id":14229125,"parent":14228912,"text":"This has some nice hints on how to read the text of a paper, but I think it misses all the important things that you need to be aware when you want to understand a paper. In particular, things like the research paradigm or research programme in which the paper fits, its historical context etc. I wrote a post about this recently: <a href=\"http:&#x2F;&#x2F;tomasp.net&#x2F;blog&#x2F;2017&#x2F;papers-we-scrutinize&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;tomasp.net&#x2F;blog&#x2F;2017&#x2F;papers-we-scrutinize&#x2F;</a>","time":1493504999,"type":"comment"},{"by":"rocket_woman","id":14229047,"kids":[{"by":"DanAndersen","id":14229596,"parent":14229047,"text":"My advisor (Voicu Popescu) wrote a couple of nice materials about &quot;How to Write a CS Paper&quot;. The emphasis is mostly on how to do it in the computer graphics field, but perhaps it&#x27;s applicable to other CS domains too:<p>In prose form: <a href=\"http:&#x2F;&#x2F;webarchiv.ethz.ch&#x2F;digitalartweeks&#x2F;web&#x2F;uploads&#x2F;DAWIntra&#x2F;test.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;webarchiv.ethz.ch&#x2F;digitalartweeks&#x2F;web&#x2F;uploads&#x2F;DAWIntr...</a><p>In slide form: <a href=\"http:&#x2F;&#x2F;spaf.cerias.purdue.edu&#x2F;classes&#x2F;Popescu.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;spaf.cerias.purdue.edu&#x2F;classes&#x2F;Popescu.pdf</a>","time":1493512835,"type":"comment"}],"parent":14228912,"text":"On the writing side of things, I really enjoyed this talk: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=L_6xoMjFr70\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=L_6xoMjFr70</a> &quot;How to Write Papers So People Can Read Them&quot;","time":1493503881,"type":"comment"},{"by":"c0achmcguirk","id":14229669,"kids":[{"by":"seanmcdirmid","id":14229711,"kids":[{"by":"UncleMeat","id":14242650,"parent":14229711,"text":"I&#x27;ve gotten reviews where it was obvious the reviewer didn&#x27;t read the paper. &quot;You didn&#x27;t address X at all&quot; when I had a section heading under Discussion labeled X in big bold font.<p>The review process is stochastic and leans towards reject by default.","time":1493680693,"type":"comment"}],"parent":14229669,"text":"Depending on the conference or journal, most papers can be rejected in one pass. Heck, the reviewer might abort after the intro if the paper is particularly bad.<p>The papers that make it past one pass get more scrutiny.","time":1493515530,"type":"comment"},{"by":"axlprose","id":14230444,"parent":14229669,"text":"Indeed, but then this is somewhat to be expected when the peer review process itself doesn&#x27;t have much in the way of incentives for the reviewers. Journals ask reviewers to <i>voluntarily</i> put their own work on hold for a potentially non-trivial period of time to grok a non-stop fire hose of papers, just so their and the original authors&#x27; efforts end up buried under a mountain of other research behind some absurdly expensive paywall later. And if you regularly slip up on deadlines or opt not to play along with these requests for some reason or another, good luck maintaining good relations with that journal in the future for your own papers.<p>Morals and civic duty aside, it&#x27;s hard to blame reviewers for skimming or &#x27;phoning it in&#x27; under such conditions. With all these subtle politics and screwy incentive structures, I&#x27;m unfortunately not surprised at all that science is having a replication crisis.","time":1493534729,"type":"comment"},{"by":"ISL","id":14238145,"parent":14229669,"text":"More practically, one should not expect that a peer-reviewed paper is correct.<p>For a YC-compatible analogy: think of it as code review. Pure junk gets filtered out, but bugs inevitably remain.","time":1493651649,"type":"comment"}],"parent":14228912,"text":"This part was most interesting to me:<p><i>&quot;Incidentally, when you write a paper, you can expect most\nreviewers (and readers) to make only one pass over it.&quot;</i><p>I understand reviewers are busy, but we depend on peer review to filter out bad or poorly-researched material. I don&#x27;t think one pass is enough.<p>Obviously, so does the author.","time":1493514617,"type":"comment"},{"by":"bfirsh","id":14230751,"parent":14228912,"text":"I thought that was going to be Trisha Greenhalgh&#x27;s How to Read a Paper: <a href=\"https:&#x2F;&#x2F;www.amazon.com&#x2F;How-Read-Paper-Evidence-Based-Medicine&#x2F;dp&#x2F;1118800966&#x2F;ref=sr_1_1?ie=UTF8&amp;qid=1493543273&amp;sr=8-1\" rel=\"nofollow\">https:&#x2F;&#x2F;www.amazon.com&#x2F;How-Read-Paper-Evidence-Based-Medicin...</a><p>Superficially the same idea, but it is for advising medical practitioners on how to apply research to their work. It goes about this by showing you how to find research, critique it, analyse it, use meta-research, and so on.<p>For somebody not in medicine, it had some transferable advice on how to use research in practice, but was mainly a detailed insight into how evidence-based medicine works. Highly recommended.","time":1493543681,"type":"comment"},{"by":"RichardHeart","id":14229452,"kids":[{"by":"jonsterling","id":14229507,"parent":14229452,"text":"This is not true. Some of the best papers ever, I have benefited from reading many times, more than three.","time":1493511073,"type":"comment"}],"parent":14228912,"text":"If papers were written better, you might not need to read them over 3 times.<p>There should be a paper called &quot;how to write useful headlines for your paper.&quot;<p>&quot;first pass&quot; &quot;second pass&quot; &quot;third pass&quot; should be replaced with unique, useful, preferably memorable headlines.  For instance:  &quot;Quick scan&quot; &quot;Deeper but ignore details&quot; and &quot;Challenge every assumption in every statement&quot;<p>Then you haven&#x27;t wasted the attention those big bold headlines get.","time":1493509980,"type":"comment"},{"by":"spookyuser","id":14230307,"parent":14228912,"text":"Obviously a different set of circumstances, but I would be curious to hear what people think about Cal Newport&#x27;s Question; Evidence; Conclusion - method of reading. From the grade A students guide. I recently switched to it and found myself understanding reading assignments much better. It seems like this method is more geared for Researchers though.","time":1493531154,"type":"comment"},{"by":"rectang","id":14229514,"kids":[{"by":"Kepler-239b","id":14230054,"kids":[{"by":"a3n","id":14231506,"parent":14230054,"text":"The site has launched far enough  to attract spammers. It looks like you&#x27;ve got some cleaning and monitoring to do:<p><a href=\"http:&#x2F;&#x2F;www.wikipaper.org&#x2F;p&#x2F;Special:AllPages\" rel=\"nofollow\">http:&#x2F;&#x2F;www.wikipaper.org&#x2F;p&#x2F;Special:AllPages</a><p>Bookmarked your site, looks interesting for this non-academic.","time":1493560745,"type":"comment"}],"parent":14229514,"text":"Agreed. Most research papers are a headache to read, even in a field you are familiar with. The full list of reasons is here:<p><a href=\"http:&#x2F;&#x2F;www.wikipaper.org&#x2F;p&#x2F;Why_So_Difficult\" rel=\"nofollow\">http:&#x2F;&#x2F;www.wikipaper.org&#x2F;p&#x2F;Why_So_Difficult</a><p>The site above ^^ has not launched yet, but should help alleviate the problem.","time":1493523513,"type":"comment"},{"by":"DonbunEf7","id":14229969,"parent":14229514,"text":"You have chosen the path of the laity.","time":1493521411,"type":"comment"},{"by":"CPUstring","id":14234567,"parent":14229514,"text":"One of the key questions after the first pass is &quot;is this well-written enough to keep reading?&quot;","time":1493595818,"type":"comment"}],"parent":14228912,"text":"I&#x27;d like to present a fourth option, the &quot;0-pass&quot;:<p>Don&#x27;t read most papers.  Don&#x27;t feel bad about not reading them, because in general they are terribly written.<p>Instead, read follow-on work which resynthesizes the ideas in these papers for a popular audience.","time":1493511214,"type":"comment"},{"by":"mad44","id":14229338,"parent":14228912,"text":"Another advice on the topic.<p><a href=\"http:&#x2F;&#x2F;muratbuffalo.blogspot.com&#x2F;2013&#x2F;07&#x2F;how-i-read-research-paper.html\" rel=\"nofollow\">http:&#x2F;&#x2F;muratbuffalo.blogspot.com&#x2F;2013&#x2F;07&#x2F;how-i-read-research...</a>","time":1493508049,"type":"comment"},{"deleted":true,"id":14229284,"parent":14228912,"time":1493507481,"type":"comment"},{"by":"f_allwein","id":14229441,"kids":[{"by":"nonbel","id":14229474,"parent":14229441,"text":"My experience from journal clubs is that strategies like this just encourages parroting whatever is claimed without thinking critically.","time":1493510472,"type":"comment"}],"parent":14228912,"text":"I sometimes do an exercise with my students where I give them a paper and ask them to tell me in 5 minutes what is the research question and the answer. Usually works well (if the paper is well written), and shows hem that they can get a good grasp of papers without spending hours reading them.","time":1493509732,"type":"comment"},{"by":"sytelus","id":14230285,"parent":14228912,"text":"For people in the field who are active authors and reviewers in CS&#x2F;AI related areas:<p>- How many papers do you read per week?<p>- How many hours you spent per week?","time":1493530707,"type":"comment"},{"by":"mkhalil","id":14229305,"parent":14228912,"text":"I first-passed this paper, and realized I needed only a first minimal second pass. Check what to do on the pass on that I on. Very helpful for new readers.","time":1493507672,"type":"comment"},{"by":"unheroic","id":14231247,"parent":14228912,"text":"Well this would have been very useful 6 months ago, when I started working on my undergraduate dissertation.","time":1493555606,"type":"comment"},{"by":"squaredpants","id":14229843,"parent":14228912,"text":"This went way too meta for my procrastinating brain.","time":1493518479,"type":"comment"},{"by":"sangd","id":14230099,"kids":[{"by":"tedmiston","id":14232528,"parent":14230099,"text":"I found it interesting in a meta sort of way that the paper&#x27;s first pass ctechnique can&#x27;t be applied to itself (there&#x27;s no conclusion).","time":1493571807,"type":"comment"}],"parent":14228912,"text":"I only got to 2nd pass for this paper.","time":1493524508,"type":"comment"},{"by":"mrcactu5","id":14229488,"parent":14228912,"text":"these &quot;how to read articles&quot; make me feel so illiterate -- having completed my formal education 4 years ago.  of course, the truth is we do not read closely, and there are always new signals to look into","time":1493510762,"type":"comment"},{"by":"darkmorning","id":14230886,"parent":14228912,"text":"I see a recursion in this post :p , Before learning to read other papers, could you please explain how to read this paper :D","time":1493547723,"type":"comment"}],"id":14228912,"score":371,"url":"http://blizzard.cs.uwaterloo.ca/keshav/home/Papers/data/07/paper-reading.pdf","by":"jdale27"},"14227779":{"time":1493488790,"type":"story","descendants":7,"title":"Show HN: Astral – Augmented Reality social network","kids":[{"by":"wyliec","id":14228129,"kids":[{"by":"mendeza","id":14233182,"kids":[{"by":"wyliec","id":14233301,"kids":[{"by":"mendeza","id":14235663,"kids":[{"by":"wyliec","id":14236374,"parent":14235663,"text":"It&#x27;s a mimic - there isn&#x27;t a method in apple maps that render it. I made the 3D versions myself. I use scene libraries that overlay the camera view (that is basically what AR is).","time":1493629744,"type":"comment"}],"parent":14233301,"text":"Oh, that makes sense, but how do you render the pin in 3D when you see the pin in Augmented Reality. I see your screenshots where you see the pin on google maps and the pin when you view it I augmented reality.","time":1493614783,"type":"comment"}],"parent":14233182,"text":"The pin gets rendered in a 3D scene, and positioned via finding the difference between your current coordinates and the pins. The building stuff is so that people cannot see a pin when there should be a building in the way. I do this by using computer vision that analyses the map imagery.","time":1493579599,"type":"comment"}],"parent":14228129,"text":"Looks interesting! How do you place the pin so it looks like the pin in placed on the sidewalk&#x2F;road?<p>I skimmed your code and you were analyzing the image to find buildings?","time":1493578225,"type":"comment"}],"parent":14227779,"text":"I started this project when I was 16 and it is now 5 months into development. I&#x27;m interested to know what people think of the idea, and how I&#x27;ve decided to go about the project (see README for screenshots and details). Depending on the interest I receive, I hope to get it onto the app store soon.  Thanks for taking a look.","time":1493492419,"type":"comment"},{"by":"throwaway29292","id":14245242,"kids":[{"by":"wyliec","id":14245576,"parent":14245242,"text":"I plan to make many different types&#x2F;colours of pins for different topics (social, informative, advertisement, etc).  Cheers.","time":1493725741,"type":"comment"}],"parent":14227779,"text":"Nice project! I&#x27;m especially interested by the possibility of a twitter-style feed per neighbourhood, the big red pins could look a little more varied though.","time":1493719756,"type":"comment"}],"id":14227779,"score":6,"url":"https://github.com/casparwylie/Astral","by":"wyliec"},"14228915":{"by":"MilnerRoute","descendants":0,"id":14228915,"score":1,"time":1493501924,"title":"Smartthings' GitHub integration gets access to all public and private repos","type":"story","url":"https://www.reddit.com/r/SmartThings/comments/67vkvn/heads_up_github_integration_requires_permissions/"},"14228598":{"by":"Dialexa","descendants":0,"id":14228598,"score":1,"time":1493497999,"title":"Platforms and Microservices–Is There a Middle Ground for Engineers and Strategists?","type":"story","url":"http://by.dialexa.com/platforms-and-microservices-is-there-a-middle-ground-for-engineers-and-tech-strategists"},"14228432":{"by":"gnicholas","descendants":0,"id":14228432,"score":1,"time":1493496064,"title":"Harvard Law prof Cass Sunstein on filter bubbles, serendipity, and democracy","type":"story","url":"https://www.theguardian.com/commentisfree/2017/apr/27/challenge-everything-democracy-representative-government"},"14228788":{"time":1493500523,"type":"story","descendants":14,"title":"Ask HN: Where do you turn for high quality journalism?","kids":[{"by":"wayn3","id":14256151,"parent":14228788,"text":"the only way to get a somewhat unbiased opinion is to consume multiple sources, cross-reference everything and ponder the results for hours.<p>Which is impossible (takes too much time). And kinda lame, because its the professionals job to provide results.<p>Obviously needs some kind of machine learning algorithm that just takes in all the news and spits out the average.<p>&quot;Independent media&quot; does not work.<p>Modern journalists dont make enough money, need to cater to external constraints like pageviews, need to put out way too many stories and are generally inept. Just looking at journalism on physics, you get major idiocies like &quot;the LHC will create a black hole and not only will it create a black hole, the black hole will eat the world and everyone dies&quot;. Physics is generally not a hot button topic that people outrage about. Yet they screw even that up. Something really simple where you just have to listen to your interviewee and not apply hyperbole.<p>Its ok for random folks to not understand what a black hole is. Its generally not ok for a tech reporter to not know his subject matter at all.<p>The New Yorker writes some interesting stuff. But thats more like reading novels than reading &quot;news&quot;.<p>People claim that pre internet, media was less biased. But I doubt that thats true. It was just way easier for them to be biased because nobody could even potentially fact-check them.","time":1493823110,"type":"comment"},{"by":"mmeister","id":14265210,"parent":14228788,"text":"Checkout this site, <a href=\"http:&#x2F;&#x2F;www.lumn.io&#x2F;documents&#x2F;about_us\" rel=\"nofollow\">http:&#x2F;&#x2F;www.lumn.io&#x2F;documents&#x2F;about_us</a>","time":1493909403,"type":"comment"},{"by":"sgillen","id":14230156,"parent":14228788,"text":"I believe The Economist to be top notch. A subscription is a bit expensive though.","time":1493526334,"type":"comment"},{"by":"taway_1212","id":14230769,"parent":14228788,"text":"Nowhere unfortunately. I accept that all journalism is sub-par and has a an (often well-meaning) agenda.","time":1493544171,"type":"comment"},{"by":"akulbe","id":14235474,"parent":14228788,"text":"I saw this question, and was nervous about expressing my true thoughts about it. I was afraid I&#x27;d be the outlier in thinking that most modern &quot;journalism&quot; is pitiful, and just a spin machine. Thankfully, others seem to share my feelings.<p>Interesting thing I read in a book called &quot;The Information Diet&quot; was that <i>many</i> things that happen and that the news also covers are much more boring and mundane than the news portrayal of the event.<p>A conclusion I came to, after reading that book and some related stuff... news media &#x2F; journalists... it&#x27;s one big spin machine. They get attention by keeping you emotionally engaged, usually geared to the respective liberal&#x2F;conservative agenda, and then get your eyes on ads.<p>I know it sounds cynical, but that&#x27;s my take. ¯\\_(ツ)_&#x2F;¯","time":1493611014,"type":"comment"},{"by":"ScalaNovice","id":14237186,"parent":14228788,"text":"I make sure that I never read on side. If I read something international on NYTimes, I go to RT.com to read the opposing account. When I read something national on WaPo or NYTimes, I go read the account on Brietbart. If it&#x27;s CNN, I go read the Fox account.<p>All these times I pray that these accounts are opposite. The rare times when they match, it&#x27;s a signal that someone very powerful wants something done. E.g. Iraq war. NYT and WaPo and everybody had proofs that they had WMDs","time":1493644137,"type":"comment"},{"by":"auganov","id":14232912,"parent":14228788,"text":"I don&#x27;t enjoy journalism too much and definitely didn&#x27;t like Nautilus. But you might enjoy edge.org.<p>Once a week they have someone successful in the respective field talk about whatever they&#x27;re passionate about in a philosophical manner. Usually, they happen to be prominent researchers. It&#x27;s not journalism, but I guess it fulfills a similar need.","time":1493575378,"type":"comment"},{"by":"JSeymourATL","id":14241075,"parent":14228788,"text":"Bloomberg does a pretty fair job for general reporting.  Unsurprisingly, their Op-Ed section runs left of center. &gt;<a href=\"https:&#x2F;&#x2F;www.bloomberg.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.bloomberg.com&#x2F;</a>","time":1493669519,"type":"comment"},{"by":"carlmungz","id":14245294,"parent":14228788,"text":"I sometimes find that reading the comments tells you more about the story than the story itself. I turn to Twitter for my journalism. I don&#x27;t have a &#x27;go to&#x27; source","time":1493720902,"type":"comment"},{"by":"Tomsredwagon","id":14231033,"parent":14228788,"text":"there is no true journalism in America anymore.  It&#x27;s all done with a political agenda.  For the most part the news media is just the political arm of a party, mostly democrat but in some cases the republicans.  You have to read multiple sources about the same subject to get a fair account.","time":1493551433,"type":"comment"},{"by":"paulcole","id":14244130,"parent":14228788,"text":"I stopped caring about quality a few years ago. Now I just read things that align with my opinions and viewpoints.<p>Honestly, it&#x27;s a lot more fun and makes me feel better.","time":1493702643,"type":"comment"},{"by":"AznHisoka","id":14236881,"parent":14228788,"text":"I meditate and like to think about the world by myself rather than read journalism. I find you can often learn new insights just be exploring your thoughts more.","time":1493639586,"type":"comment"},{"by":"atmosx","id":14230386,"parent":14228788,"text":"The Intercept, The Atlantic and NYTimes when it doesn&#x27;t talk about US politics.","time":1493533376,"type":"comment"},{"by":"spcelzrd","id":14236969,"parent":14228788,"text":"Washington Post and The Economist. Can&#x27;t think of any other examples right now.","time":1493641054,"type":"comment"}],"id":14228788,"score":19,"by":"jihadjihad","text":"Upon hearing on HN today that Nautilus, a beloved science magazine, is struggling financially, I thought I&#x27;d ask the community about places online or in print to find excellent journalism. Any field or topic is fine--it doesn&#x27;t have to be constrained to science or politics. I&#x27;m just hoping others can find journalistic gems, as rare as they may be today."},"14228199":{"time":1493493258,"type":"story","descendants":59,"title":"Are We Having Too Much Fun?","kids":[{"by":"jdavis703","id":14232107,"kids":[{"by":"visakanv","id":14232125,"kids":[{"by":"noblethrasher","id":14234702,"parent":14232125,"text":"Just recently, I was talking to a group of International Relations graduate students about global problems like climate change. I pointed out that none of them (in this case) had a background in science, and couldn’t even prove to themselves that the e.g. the Earth is round. So, “how can you possibly hope to cause ordinary people to understand, believe, and appreciate anthropogenic climate change?” I asked.<p>Predictably, most of the rejoinders were some variation of “we just need to show them the studies and the data”. My reply was that was that we all need to be more intellectually humble and realize that, even among us educated people, most of our beliefs come from having attended the right kinds of theatrical performances (e.g. a good lecture, book, documentary, etc.), which is the same for most of the skeptics and deniers. I told them that the best thing that they could do for their cause is to (1) make sure that they have a basic understanding of the principles of climate science and then (2) create a really good theatrical show that includes some powerful props.","time":1493598159,"type":"comment"},{"by":"gipp","id":14232718,"kids":[{"by":"pharrington","id":14233150,"kids":[{"by":"gipp","id":14233486,"kids":[{"by":"pharrington","id":14234719,"parent":14233486,"text":"There are probably <i>trivially few</i> fixed constants of social behavior. The animal&#x27;s feedback loop of encoding stimulus and producing response in environment <i>is</i>, though, determined by genetics. For example, you how would respond to me stroking your shoulder is extremely contextual. The given nervous system&#x27;s training which produces the response to said shoulder stroking is a complicated and chaotic system born from fixed genes.","time":1493598521,"type":"comment"}],"parent":14233150,"text":"This is patently false. There are no fixed constants at the level of social behavior. Nothing about society is &quot;purely genetic&quot;, and even if it were, the human genome changes all the time.","time":1493581976,"type":"comment"}],"parent":14232718,"text":"I think you&#x27;re agreeing with visakanv&#x27;s point while misunderstanding his words. What he&#x27;s referring to as behavioral psychology can&#x27;t be changed by changing society - it&#x27;s only changed by changing the genome.","time":1493577710,"type":"comment"}],"parent":14232125,"text":"&gt; I think Dan Ariely has the right attitude towards all of this [3]. When we design things like buildings and bridges, we take physics into account. We know that we can&#x27;t build a bridge a certain way because it&#x27;ll collapse. Similarly, when we&#x27;re designing for people, we have to take human nature (behavioral psychology, whatever you want to call it) into account.<p>The difference, of course, is that the laws of physics are, so far as we know, immutable. &quot;Human nature&quot;, informed by the culture of the moment, is not. When we accept the strategy of &quot;tailor your behavior to human nature&quot; en masse, we create a feedback loop, without a clear picture of where it leads.","time":1493573645,"type":"comment"},{"by":"ccvannorman","id":14232139,"kids":[{"by":"visakanv","id":14232149,"kids":[{"by":"dnautics","id":14232522,"parent":14232149,"text":"That&#x27;s still a generally good description of science.  Can I depress you more?  The structure of funding still incentivises fictional work.","time":1493571755,"type":"comment"}],"parent":14232139,"text":"&gt; If anything the case for science and facts is better than ever before in history.<p>Oh man, you just reminded me of this really depressing passage I read in a book about biology that I had put out of mind. A career scientist was complaining about how basically he got into science hoping to do science, but witnessed decades of academic politics hampering scientific progress. It&#x27;s distressing to think about how our own nature holds us back.","time":1493568181,"type":"comment"}],"parent":14232125,"text":"If anything the case for science and facts is better than ever before in history. People were burned at the stake for talking about facts in the past that didn&#x27;t agree with authority or mainstream.<p>Of course, human nature (when given broad free choice) is to polarize into Pro- or Anti- (science in this case) which is bad for the overall conversations.<p>Solution: Stop caring what others think and accept that the world will often make bad choices, and do what you can.","time":1493568079,"type":"comment"},{"by":"cylinder","id":14232802,"parent":14232125,"text":"Who wants to run a test and fedex direct letters like Davinci&#x27;s to top CEOs? A long form letter with detailed touting of your technical accomplishments as well as your ideas and inventions, rather than the currently en vogue brief email, &quot;would love to chat with you and see if we can work together to power your growth and mission!&quot;","time":1493574336,"type":"comment"}],"parent":14232107,"text":"&gt;  No longer can a scientist say &quot;take this vaccine so you won&#x27;t die,&quot; now they must also have a witty sign that infotains people.<p>Implying that this wasn&#x27;t the case before?<p>From what I remember, the guy who said &quot;wash your hands so your patients don&#x27;t die&quot; basically got ostracized [1], and even Leonardo Da Vinci had to sell himself in his resume&#x27;s cover letter [2].<p>I think Dan Ariely has the right attitude towards all of this [3]. When we design things like buildings and bridges, we take physics into account. We know that we can&#x27;t build a bridge a certain way because it&#x27;ll collapse. Similarly, when we&#x27;re designing for people, we have to take human nature (behavioral psychology, whatever you want to call it) into account.<p>Facts are important, but so is a sensitivity to the person you&#x27;re trying to convince of those facts. That&#x27;s just the reality of communication, I&#x27;m afraid.<p>_<p>[1] <a href=\"http:&#x2F;&#x2F;www.npr.org&#x2F;sections&#x2F;health-shots&#x2F;2015&#x2F;01&#x2F;12&#x2F;375663920&#x2F;the-doctor-who-championed-hand-washing-and-saved-women-s-lives\" rel=\"nofollow\">http:&#x2F;&#x2F;www.npr.org&#x2F;sections&#x2F;health-shots&#x2F;2015&#x2F;01&#x2F;12&#x2F;37566392...</a><p>[2] <a href=\"http:&#x2F;&#x2F;www.lettersofnote.com&#x2F;2012&#x2F;03&#x2F;skills-of-da-vinci.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.lettersofnote.com&#x2F;2012&#x2F;03&#x2F;skills-of-da-vinci.html</a><p>[3] <a href=\"https:&#x2F;&#x2F;www.ted.com&#x2F;talks&#x2F;dan_ariely_asks_are_we_in_control_of_our_own_decisions&#x2F;transcript?language=en\" rel=\"nofollow\">https:&#x2F;&#x2F;www.ted.com&#x2F;talks&#x2F;dan_ariely_asks_are_we_in_control_...</a>","time":1493567856,"type":"comment"},{"by":"Kenji","id":14232484,"kids":[{"by":"dgudkov","id":14232809,"kids":[{"by":"rdiddly","id":14232864,"kids":[{"by":"calvano915","id":14234613,"parent":14232864,"text":"Salesmanship does not always equal BS, and I&#x27;m not sure that the BS is inverse to importance. Rather, actualized importance and perception of importance are independent and the BS can be useful to magnify one and&#x2F;or the other. Thus, selling an effective vaccine vs snake oil, both of which may&#x2F;will not sell itself largely on facts alone.","time":1493596493,"type":"comment"},{"by":"dgudkov","id":14233661,"parent":14232864,"text":"Probably, to some extent. There is no way to sell Coca-Cola rather than by extreme level of salesmanship because nobody really needs it. At the same time you won&#x27;t see any advertisement for tap water.","time":1493584197,"type":"comment"}],"parent":14232809,"text":"Now we&#x27;re getting somewhere. Could it be extrapolated, then, that anything carrying that shiny veneer of salesmanship, is probably something you don&#x27;t really need, a.k.a. bullshit? Certainly the mindset results in hanging onto more of your money, more often, and for longer.","time":1493574934,"type":"comment"},{"by":"Kenji","id":14233382,"parent":14232809,"text":"&gt;The less something is important (or unique) the more entertainment you need to sell it.<p>Unfortunately, that includes you and me as individuals. Presentation matters for example is you wanna get a job or a relationship.","time":1493580612,"type":"comment"}],"parent":14232484,"text":"It heavily depends on importance. If you&#x27;re dying from thirst in a desert you won&#x27;t care if someone is offering you water in a &#x27;witty and interesting&#x27; way or not. The less something is important (or unique) the more entertainment you need to sell it.","time":1493574397,"type":"comment"}],"parent":14232107,"text":"This has always been the case. Every interaction with every other human is just some sort of &#x27;game&#x27; where you have to make things witty and interesting etc. You can&#x27;t just pour out the bland truth. People will be alienated and bored. Like a waiter in a restaurant, you have to serve the dish nicely so that it appeals the other person. That doesn&#x27;t mean you have to be dishonest, it just means that presentation matters a whole lot more than engineers and scientists want it to. In fact, presentation is absolutely crucial to success.","time":1493571341,"type":"comment"}],"parent":14228199,"text":"I&#x27;m coming more to the conclusion that to be &quot;successful&quot; (i.e. achieving your goal), one must have a substantial layer of good marketing behind it. No longer can a scientist say &quot;take this vaccine so you won&#x27;t die,&quot; now they must also have a witty sign that infotains people. While I&#x27;d like to see a more facts-based approach to civic life, this is the world we live in. All the better that people who are historically bad communicators (scientist, engineers, doctors, etc) are realizing that they too need to apply a marketing &quot;layer&quot; to their speech, otherwise their message will be totally ignored.","time":1493567606,"type":"comment"},{"by":"mythrwy","id":14232460,"parent":14228199,"text":"Don&#x27;t like spinach? No worries, I&#x27;ll put a bunch of sugar on it.<p>Wait, that&#x27;s even nastier!<p>How about we just realize spinach actually tastes pretty good and we feel better when we eat it instead of sugar? Still, some people just won&#x27;t like spinach and that&#x27;s ok. But it&#x27;s not a good idea to teach kids to hate spinach and love junk or assume that&#x27;s just how it is naturally. Because pooping our pants is natural. But a little training and habit sure makes us feel better and get by with less problems.<p>If presented properly and as a matter of custom, preferring nutritious food over empty calories comes naturally and is overall better for the person and their society.","time":1493571145,"type":"comment"},{"by":"rdiddly","id":14232952,"parent":14228199,"text":"I had noticed this trend, but interestingly came at it from the other direction: the only people we permit to speak the truth to us are comedians. The likes of Dave Chappelle &amp; Louis CK for example. Can anybody else get away with talking honestly about race? If it&#x27;s not a joke, we can&#x27;t even handle it. Or in politics it&#x27;s been Jon Stewart &amp; Colbert. In that realm the cognitive dissonance is so high, you&#x27;d rather just shoot yourself. Unless it&#x27;s a joke, then it&#x27;s bearable. Humor is how we deal with traumatic contradictions. It&#x27;s just sad that these areas (race &amp; politics) are still about traumatic contradiction rather than solved problems we can move on from.","time":1493575728,"type":"comment"},{"by":"linkmotif","id":14232329,"kids":[{"by":"milquetoastaf","id":14233007,"parent":14232329,"text":"That&#x27;s not true at all. You are simplifying the argument to the point of incoherency.","time":1493576234,"type":"comment"},{"by":"chrismealy","id":14232599,"kids":[{"by":"linkmotif","id":14233642,"parent":14232599,"text":"I never said he wasn&#x27;t :)","time":1493583941,"type":"comment"}],"parent":14232329,"text":"Mike Duncan is funny.","time":1493572459,"type":"comment"}],"parent":14228199,"text":"I once told a friend about Mike Duncan&#x27;s History of Rome Podcast. The friend asked &quot;is it funny?&quot; I didn&#x27;t get it, but my girlfriend told me, &quot;oh, yeah, everything has to be funny these days.&quot;<p>This over and over again.","time":1493570039,"type":"comment"},{"by":"ivanbakel","id":14232140,"kids":[{"by":"dTal","id":14232172,"kids":[{"by":"ivanbakel","id":14232202,"kids":[{"by":"dTal","id":14232477,"kids":[{"by":"ivanbakel","id":14232707,"kids":[{"by":"pjc50","id":14232796,"kids":[{"by":"peatmoss","id":14234190,"parent":14232796,"text":"While I understand that language changes over time, this new usage of neoliberalism is weird for anyone with a traditional understanding of the term.<p>I hold the view that neoliberalism is basically GOP-style capitalism where markets are deregulated and everything is privatized.<p>I&#x27;ve encountered a number of times recently where people appeared to be using neoliberalism as a stand-in for liberalism, which to me is exactly backwards.<p>Edit for clarification: I agree with your understanding of neoliberalism, and your assessment that Rowling&#x27;s left-wing politics are basically the opposite of neoliberalism.","time":1493590905,"type":"comment"}],"parent":14232707,"text":"&gt; many consider Rowling a big neoliberal type<p>These people are either wrong or have a very strange definition of &quot;neoliberal&quot;. It seems to have become, like &quot;socialist&quot;, an all-purpose swear word to apply to people whose politics you don&#x27;t like.<p>Rowling is an old-school Labourite, solidly pro-welfare state, Unionist and Remainer.","time":1493574268,"type":"comment"}],"parent":14232477,"text":"The ring of truth is that, since many consider Rowling a big neoliberal type, and exactly the kind of person who would argue against the boycott of Israel, <i>and</i> she is well known for using her characters after the books have been written to make political points in a &quot;relatable&quot; way, that it might well happen (and in some way, has happened). The absurdity of combining a children&#x27;s character with a major political view (which leftists tend to disagree with anyways) to try and defend her viewpoint forms the comedy.","time":1493573507,"type":"comment"}],"parent":14232202,"text":"Yes, I was referring to that reference. Sorry for mixing up the pro- and anti- positions. But now I&#x27;m even more confused - what&#x27;s the joke, and the ring of truth?","time":1493571316,"type":"comment"}],"parent":14232172,"text":"&gt;Given that this actually happened<p>Did it? It&#x27;s my understanding that Rowling casts Potter as a strongly pro-Palestine type, which is slightly absurd unto itself. [0]<p>[0] <a href=\"http:&#x2F;&#x2F;www.independent.co.uk&#x2F;news&#x2F;people&#x2F;harry-potter-would-be-disappointed-with-my-stance-on-israel-boycott-jk-rowling-says-a6710916.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.independent.co.uk&#x2F;news&#x2F;people&#x2F;harry-potter-would-...</a>","time":1493568720,"type":"comment"}],"parent":14232140,"text":"&gt;One joke that often circulates in leftist circles is &quot;J.K. Rowling explains why Harry Potter would support the state of Israel&quot;, but it has a ring of truth to it as well.<p>Given that this actually happened, what exactly do you mean?","time":1493568361,"type":"comment"},{"by":"pjc50","id":14232750,"parent":14232140,"text":"When has politics <i>not</i> been intertwined with entertainment? e.g., celebrity orators were a feature of the Roman Empire.","time":1493573940,"type":"comment"}],"parent":14228199,"text":"It struck me that the last point was the strongest. Entertainment is a fantastic way to humanize politicians and demystify complex systems from their state of worship, but the real danger is the marrying of entertainment to politics, rather than the other way around.<p>Is there a way to strike a boundary? We can&#x27;t fault celebrities for using their influence for political effect, and I doubt we can fault them for not doing so either - but does that make entertainers qualified political movers? One joke that often circulates in leftist circles is &quot;J.K. Rowling explains why Harry Potter would support the state of Israel&quot;, but it has a ring of truth to it as well. If entertainment becomes the primary way of thinking about politics, it will need to lose a lot of freedom to bring it up to a standard we deserve.","time":1493568079,"type":"comment"},{"by":"nom","id":14232485,"kids":[{"by":"hliyan","id":14232654,"kids":[{"by":"pjc50","id":14232741,"kids":[{"by":"mostlyskeptical","id":14233540,"parent":14232741,"text":"Absolutely.   How else can an activity like Riding dirt bikes, with a near 100% injury rate for even casual riders wearing full safety gear, be popular?<p>So many things in our society are overly sanitized to the point that we have an almost complete mental aversion to the idea that some things can be unavoidably dangerous and will still be beneficial (or at least that we should be allowed to do them because we want to, because we are free human beings).<p>Back on topic, after riding a dirt bike I just feel... Alive? For days afterwards I feel like a complete human. It makes the injuries worth it.<p>A good book on the subject is\n Foolproof: how safety can be dangerous and danger makes us safe -- Greg IP","time":1493582691,"type":"comment"}],"parent":14232654,"text":"I believe what you&#x27;re looking for is called &quot;sports&quot;.","time":1493573859,"type":"comment"},{"by":"VLM","id":14232778,"kids":[{"by":"nom","id":14233367,"parent":14232778,"text":"I should&#x27;ve included that on my list. Social media - the modern high. Also: games!","time":1493580393,"type":"comment"}],"parent":14232654,"text":"Thats social media, for the &quot;like&quot; addicted.","time":1493574144,"type":"comment"},{"by":"aswanson","id":14234192,"parent":14232654,"text":"The Game was great, though. My favorite movie by far.","time":1493590924,"type":"comment"},{"deleted":true,"id":14233219,"parent":14232654,"time":1493578714,"type":"comment"}],"parent":14232485,"text":"Perhaps what the first world needs is a little simulated conflict. Something a little more high stakes than video games and a little less than The Game starring Michael Douglas. Not sure what form it should take.","time":1493573030,"type":"comment"}],"parent":14228199,"text":"For most people in the first world the primary needs (water, food, health) are adequately satisfied, but the dopamine system doesn&#x27;t stop there and requires further stimulation. That&#x27;s why we have things like coffee, nicotine, alcohol and other drugs, theme parks, consumerism etc.. Most are never satisfied with what they&#x27;ve got, it&#x27;s just human nature.","time":1493571370,"type":"comment"},{"by":"tsunamifury","id":14231918,"kids":[{"by":"aswanson","id":14231938,"parent":14231918,"text":"I think the ability to be entertained constantly is a problem in and of itself, though.  There&#x27;s a serious case for the usefulness of boredom.","time":1493565581,"type":"comment"}],"parent":14228199,"text":"I think this pieces core thesis, that context collapse causes us to focus on irrelevant but entertaining information, is less true in the modern era. Google actually created a world where your results and advertising is MORE contextual to your real life, not less. And for what it&#x27;s worth, Facebook also made feeds information also more about you.  Apple made computing more about doing real things outside. And so on.<p>So I don&#x27;t think we are entertaining ourselves to death, we&#x27;re just doing the thing we&#x27;ve done best forever: procrastinating work we don&#x27;t want to do.  We just have better options for filling that time now.","time":1493565346,"type":"comment"},{"by":"bplatta","id":14232836,"parent":14228199,"text":"on the article: I like to wrap up these sorts of treatments into my own simplified cultural causal models, if you will (hopefully my syntax is intuitive).<p>Invention of telegraph := ~immediacy of information, minimal context -&gt; incredible boon for society! Essentially the beginning of modern technology, dare i say. The ability to CREATE networks as technology! ooo the power of (high bandwidth) networks!<p>Invention of Television := immediacy of visual information, lots more context, modern entertainment -&gt; oh the theories abound for what this caused. I like to consider televisions pacifying effect on modern society. This subtle lie about what it claims to be: a window in a room. Oh but of course we know much of it is fictitious! But do we? All the more confusing with &quot;reality TV&quot; and, as discussed here, modern news-tainment.<p>Just some of my thoughts!<p>meta, on this comment section: I&#x27;m a little surprised this article is getting so easily dismissed. Its simply an attempted synthesis and application of media&#x2F;normative&#x2F;critical theorists&#x27; work. That is, this is philosophical at heart and I appreciate the author&#x27;s attempt (it brings to mind David Foster Wallace&#x27;s constant questioning of entertainment and the effect of entertainment&#x27;s reflexivity). I think many hackernews readers (like myself) are scientifically minded and so this sort of thesis, i.e. not empirically verifiable, can lack the thrust that we want. But that said, I think it provides a valuable ontology for thinking about modern society and provokes some questions that actually may inform my behavior.<p>Much more difficult to parse out the noise with these types of articles, I grant you.<p>(Edit: grammar&#x2F;spacing)","time":1493574600,"type":"comment"},{"by":"cpr","id":14232716,"parent":14228199,"text":"The author sorta takes us through Postman&#x27;s arguments, but then turns on him in the end. I guess that&#x27;s inevitable (given Postman&#x27;s own arguments about trivializing things), but why not let them stand on their own?","time":1493573583,"type":"comment"},{"by":"d--b","id":14232042,"kids":[{"by":"visakanv","id":14232178,"parent":14232042,"text":"&gt; he couldn’t have known how comedians would come to double, in a culture saturated with information, as journalists<p>Also – comedians have been truth-tellers since the days of court jesters.","time":1493568409,"type":"comment"}],"parent":14228199,"text":"&gt; he couldn’t have known how comedians would come to double, in a culture saturated with information, as journalists<p>Er... Wasn&#x27;t Nixon interviewed by David Frost?<p>Hell, was Diogenes having too much fun?","time":1493566905,"type":"comment"},{"by":"jacob019","id":14231890,"kids":[{"by":"Erik816","id":14231917,"kids":[{"by":"hkmurakami","id":14231999,"kids":[{"by":"qwert-e","id":14232085,"parent":14231999,"text":"They&#x27;ve changed their business model in the last 7-8 years to be online friendly and it&#x27;s been largely a success. Might have something to do with it, might not.\n<a href=\"http:&#x2F;&#x2F;www.nytimes.com&#x2F;2010&#x2F;12&#x2F;13&#x2F;business&#x2F;media&#x2F;13atlantic.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.nytimes.com&#x2F;2010&#x2F;12&#x2F;13&#x2F;business&#x2F;media&#x2F;13atlantic....</a>\nIf you&#x27;re looking for the old Atlantic, a lot of their archived material is right alongside current stuff, in &quot;Also see...&quot;. For example, &quot;Sex and the College Girl&quot; (1957) was recommended after I read Kate Bolick&#x27;s famous &quot;All the Single Ladies&quot; piece (2011). Kind of interesting to have that juxtaposition.","time":1493567410,"type":"comment"},{"by":"visakanv","id":14232131,"parent":14231999,"text":"It suffers from the same malaise that all online publications suffer from – articles and headlines are increasingly optimized to get people arguing about it on Facebook (and Hacker News, and anywhere else).","time":1493567929,"type":"comment"}],"parent":14231917,"text":"Is it just me or has it gotten a lot worse over the last 5-6 years?","time":1493566315,"type":"comment"}],"parent":14231890,"text":"Nope, not just you. They do some really good journalism at times, but even their best articles have a sensationalist bent that gets old after a while.","time":1493565270,"type":"comment"},{"by":"educar","id":14232526,"parent":14231890,"text":"Probably just you. This is a fantastic well written and well researched article.<p>Are you just looking for a tldr?","time":1493571796,"type":"comment"},{"by":"leggomylibro","id":14232531,"parent":14231890,"text":"I think it depends on the author. They have a lot of good, thoughtful pieces, and most of their longform articles are great.<p>But they definitely have a few writers who have axes to grind. If you read their day-to-day articles often enough, probably half of the stories on their front page will be predictable enough to ignore.<p>But on the other hand, what media site is that not true of? Maybe The Economist? They don&#x27;t list authors, but their stance is still pretty predictable.","time":1493571826,"type":"comment"},{"deleted":true,"id":14232045,"parent":14231890,"time":1493566950,"type":"comment"}],"parent":14228199,"text":"Is it just me or do most Atlantic articles seem like pointless tirades?","time":1493565025,"type":"comment"},{"by":"hartator","id":14231932,"kids":[{"by":"Eerie","id":14232057,"parent":14231932,"text":"Just install anti-adblock blocker:<p><a href=\"https:&#x2F;&#x2F;reek.github.io&#x2F;anti-adblock-killer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;reek.github.io&#x2F;anti-adblock-killer&#x2F;</a><p>This arms race if so much fun!","time":1493567081,"type":"comment"}],"parent":14228199,"text":"&quot;It looks like your browser is unable to display ads&quot;. I guess not.","time":1493565475,"type":"comment"},{"by":"qwtel","id":14231969,"kids":[{"by":"visakanv","id":14232141,"kids":[{"by":"qwtel","id":14232318,"parent":14232141,"text":"we are very serious software ENGINEERS. very serious people. like lawyers, but not as attractive.","time":1493569833,"type":"comment"}],"parent":14231969,"text":"Excuse me sir, but it appears that you&#x27;re trying to have fun. This is Hacker News. Fun is strictly prohibited.","time":1493568083,"type":"comment"}],"parent":14228199,"text":"are we running out of clickbaity headlines?","time":1493565909,"type":"comment"},{"by":"yarrel","id":14231865,"parent":14228199,"text":"We?","time":1493564791,"type":"comment"},{"by":"ldehaan","id":14232448,"kids":[{"by":"toss1941","id":14232596,"parent":14232448,"text":"I imagined a Principle Skinner writing this article &quot;Are we out of touch with the wants and needs of the American people?  No, it&#x27;s the children (voters) who are wrong...&quot;","time":1493572447,"type":"comment"}],"parent":14228199,"text":"how is this even on hacker news? \nthis is a crappy repeat of: are you not doing&#x2F;believing something we all used to believe? <i>gasp</i> you must be doing it wrong.<p>did the atlantic hire bill orielly or something?","time":1493571059,"type":"comment"}],"id":14228199,"score":77,"url":"https://www.theatlantic.com/entertainment/archive/2017/04/are-we-having-too-much-fun/523143/","by":"BerislavLopac"},"14228817":{"by":"Mz","descendants":0,"id":14228817,"score":2,"time":1493500797,"title":"Study of bonobo muscles found they're more closely related to humans than chimps","type":"story","url":"https://www.sciencedaily.com/releases/2017/04/170429095021.htm"},"14228013":{"by":"ekm2","descendants":0,"id":14228013,"score":1,"time":1493491238,"title":"Unicorn League","type":"story","url":"http://www.sage.co.uk/c/v/unicorn-league/#founder%7Cfounder-universities"},"14228254":{"time":1493493981,"type":"story","descendants":1,"title":"Show HN: Allign.us – Crowd sourcing corporate values","kids":[{"by":"brandedMan","id":14228309,"parent":14228254,"text":"I built this in response to watching the marches and the conversation around climate change and education.  Maybe I&#x27;m naive, but I think consumers can have a huge impact based on their purchasing behavior and there isn&#x27;t enough being done to emphasize that.  Personally, if I had a way to easily identify companies that support the same values I do, it would play a major role in the brands and products I buy.  Since money == speech, a group effort has the potential to ripple upwards.<p>I hacked this app together over the last few weekends just to get the conversation started.  Let me know what you think!","time":1493494783,"type":"comment"}],"id":14228254,"score":1,"url":"http://allign.us","by":"brandedMan"},"14227993":{"by":"alxmdev","descendants":0,"id":14227993,"score":2,"time":1493490969,"title":"Rock and Roll Days of StarCraft: A Development Retrospective","type":"story","url":"https://starcraft.com/en-us/articles/20719767"},"14228442":{"by":"andreygrehov","descendants":0,"id":14228442,"score":3,"time":1493496239,"title":"How I Wrote a C++ Compiler 15 Years Ago","type":"story","url":"https://kukuruku.co/post/how-i-wrote-a-cpp-compiler-15-years-ago/"},"14227805":{"by":"ytNumbers","descendants":0,"id":14227805,"score":3,"time":1493489126,"title":"Elon Musk's vision for an underground road system","type":"story","url":"http://www.bbc.com/news/technology-39741094"},"14228158":{"by":"perfmode","descendants":5,"id":14228158,"kids":[{"by":"CarolineW","id":14228277,"parent":14228158,"text":"If you&#x27;re a hacker, I&#x27;ve heard good things about this:<p><a href=\"http:&#x2F;&#x2F;ledger-cli.org&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;ledger-cli.org&#x2F;</a><p>I have no personal experience of it, and I would welcome feedback from other HNers.","time":1493494385,"type":"comment"},{"by":"philiphodgen","id":14231953,"parent":14228158,"text":"1. Do marketing or billable work. If an activity does not create revenue, have someone else do it.<p>2. Your money is cheaper than your time. Spend money.<p>3. Conclusion: spend money on commercial software. Xero or Quickbooks. I prefer Xero. (Think of Xero as MacOS and Quickbooks as Windows in the commodity bookkeeping market).<p>4. Take a simple bookkeeping class or read a book so you understand the concepts. Then you can hire someone to do the grunt work.<p>Disclaimer: I eat this dog food.","time":1493565730,"type":"comment"},{"by":"dhruvkar","id":14235966,"parent":14228158,"text":"I&#x27;m paying bench.co to handle bookkeeping. They assign you a real live accountant, and a pretty saas interface that you can hookup your accounts to. With this combination, I&#x27;m able to learn and ask questions, as well as have one place for all my business transactions.","time":1493620512,"type":"comment"},{"by":"thunderleif12","id":14233266,"parent":14228158,"text":"Check out <a href=\"https:&#x2F;&#x2F;www.and.co\" rel=\"nofollow\">https:&#x2F;&#x2F;www.and.co</a> \nIt&#x27;s specifically designed for Freelancers, with a ridiculously simple interface.","time":1493579152,"type":"comment"},{"by":"roschdal","id":14234144,"parent":14228158,"text":"<a href=\"https:&#x2F;&#x2F;www.gnucash.org\" rel=\"nofollow\">https:&#x2F;&#x2F;www.gnucash.org</a>","time":1493590291,"type":"comment"}],"score":6,"time":1493492713,"title":"Ask HN: Simple accounting software for freelancers?","type":"story"},"14228601":{"by":"Dialexa","descendants":0,"id":14228601,"score":2,"time":1493498077,"title":"Still Struggling Between Platforms and Microservices? Think About Your Data Models","type":"story","url":"http://by.dialexa.com/still-struggling-between-platforms-and-microservices-think-about-your-data-models"},"14228671":{"by":"somid3","descendants":0,"id":14228671,"score":1,"time":1493499136,"title":"How Entrepreneurs Can Hone Their Management Skills to Fuel Production","type":"story","url":"https://www.entrepreneur.com/article/293280"},"14228342":{"by":"jrpt","descendants":0,"id":14228342,"score":2,"time":1493495189,"title":"The ACCEL moving sidewalk from ThyssenKrupp is a dream come true","type":"story","url":"https://www.treehugger.com/urban-design/accel-moving-sidewalk-thyssenkrupp-dream-come-true.html"},"14227930":{"by":"mpweiher","descendants":0,"id":14227930,"score":2,"time":1493490444,"title":"Cost-Effective High Capacity Hard Drives: 8TB Now Highly Attractive","type":"story","url":"https://macperformanceguide.com/blog/2017/20170427_1002-high-capacity-HGST-hard-drives.html"},"14228849":{"time":1493501216,"type":"story","descendants":63,"title":"Wacl: Tcl distro customized for WebAssembly","kids":[{"by":"kristopolous","id":14230375,"kids":[{"by":"pwg","id":14231978,"parent":14230375,"text":"At one point, very early in the web&#x27;s infancy, before Javascript became &quot;the one&quot; web language, Sun was considering Tcl for the role that Javascript took over in the &lt;script&gt; tag.","time":1493566038,"type":"comment"}],"parent":14228849,"text":"Of interesting historical note, the W3C HTML 4 standard alludes to TCL as a possible scripting language when describing the script tag, albeit just as an example:<p><a href=\"https:&#x2F;&#x2F;www.w3.org&#x2F;TR&#x2F;html4&#x2F;interact&#x2F;scripts.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.w3.org&#x2F;TR&#x2F;html4&#x2F;interact&#x2F;scripts.html</a>","time":1493533091,"type":"comment"},{"by":"jitl","id":14229266,"kids":[{"by":"lmm","id":14229329,"kids":[{"by":"jitl","id":14229526,"kids":[{"by":"denisw","id":14230562,"kids":[{"by":"yoodenvranx","id":14230699,"kids":[{"by":"mstade","id":14238078,"parent":14230699,"text":"As a Swede, I can echo this. I&#x27;m so used to the US layout by now that I have to do a double take whenever I switch to the SE layout, or type on someone else&#x27;s keyboard.<p>I used to get laptops and keyboards with the US layout on them, but stopped since the resale value in Sweden drops sharply because of it. Thankfully, I&#x27;ve touch typed since forever so I rarely look at the keyboard anyway. (Unless, of course, I have to type with the Swedish layout.)","time":1493651219,"type":"comment"},{"by":"qznc","id":14231123,"kids":[{"by":"hawski","id":14232098,"kids":[{"by":"yoodenvranx","id":14233407,"parent":14232098,"text":"There seems to be a layout called &quot;US international&quot; which might help:  <a href=\"https:&#x2F;&#x2F;en.m.wikipedia.org&#x2F;wiki&#x2F;File:KB_US-International.svg\" rel=\"nofollow\">https:&#x2F;&#x2F;en.m.wikipedia.org&#x2F;wiki&#x2F;File:KB_US-International.svg</a>","time":1493580869,"type":"comment"}],"parent":14231123,"text":"Is there a German keyboard layout such as?:<p>AltGr + a -&gt; ä<p>AltGr + o -&gt; ö<p>AltGr + u -&gt; ü<p>I&#x27;m Polish and I&#x27;m very glad that our most common layout is like that for ąćęłńóśźż (with AltGr + x for ź). Currently I&#x27;m in Germany and I wonder if there is similar layout for German umlauts.","time":1493567527,"type":"comment"}],"parent":14230699,"text":"All my colleagues would agree and did the same. I don&#x27;t. I want äöü quickly available for chatting and other &quot;quick&quot; writing, while coding typing is usually not the bottleneck.","time":1493553036,"type":"comment"}],"parent":14230562,"text":"As a German I haven&#x27;t use a German keyboard layout in years because the US layout easier in most cases (for examole all those curly braces in TeX).","time":1493542013,"type":"comment"}],"parent":14229526,"text":"&gt; - uses [ and ] for subexpressions instead of ( and ), which makes typing easier<p>I would like to point out that in several non-US keyboard layouts, [ and ] are <i>harder</i> to type, not easier. For instance, on German keyboards, they are mapped to Right-Alt (AltGr) + 8&#x2F;9, which is quite annoying to type compared to normal parentheses (which are mapped to Shift+8&#x2F;9, with Shift being better placed and available on both the left and right side of the keyboard).","time":1493537911,"type":"comment"},{"by":"auxym","id":14231546,"parent":14229526,"text":"I would also add that the &quot;Everything is a String&quot; paradigm makes it simple to reason about somewhat complex concepts. You don&#x27;t have to try to teach beginners about objects and pointers. Just plain old text strings. Everything else is under the hood.<p>I miss some features of more modern languages though. TclOO (object-oriented extension) is minimally useful but lacks GC, so you have to keep track of all objects to manually destroy them when you are done. I miss easily passing around functions (procs), and saner local namespacing for functions (ie like in python). Exception handling is also a bit of a pain.<p>A lot of these things are addressed in Jim Tcl, but it hasn&#x27;t seen much adoption.<p><a href=\"http:&#x2F;&#x2F;jim.tcl.tk&#x2F;index.html&#x2F;doc&#x2F;www&#x2F;www&#x2F;index.html\" rel=\"nofollow\">http:&#x2F;&#x2F;jim.tcl.tk&#x2F;index.html&#x2F;doc&#x2F;www&#x2F;www&#x2F;index.html</a>","time":1493561158,"type":"comment"},{"by":"CyberDildonics","id":14231360,"parent":14229526,"text":"Pragmatically it is actually a giant pain to use. Its bizarre text substitution semantics are hugely unintuitive compared to modern languages.","time":1493558106,"type":"comment"}],"parent":14229329,"text":"Thanks, this blog post was exactly the sort of discussion I was looking for!<p>The TL;DR:<p>- easy to write interactively because there&#x27;s no fiddling with the parens, quoting, or commas you find in JS, Ruby, or Python<p>- uses [ and ] for subexpressions instead of ( and ), which makes typing easier<p>- &quot;command&quot; oriented, instead of &quot;expression&quot; oriented<p>- saner than shell while having many of the same advantages","time":1493511461,"type":"comment"}],"parent":14229266,"text":"It&#x27;s an elegant, lightweight language, with a design thoroughly optimized for interactive use. <a href=\"http:&#x2F;&#x2F;yosefk.com&#x2F;blog&#x2F;i-cant-believe-im-praising-tcl.html\" rel=\"nofollow\">http:&#x2F;&#x2F;yosefk.com&#x2F;blog&#x2F;i-cant-believe-im-praising-tcl.html</a> .","time":1493507898,"type":"comment"},{"by":"forinti","id":14229447,"kids":[{"by":"mappu","id":14229756,"kids":[{"by":"eggy","id":14230273,"kids":[{"by":"mappu","id":14230298,"parent":14230273,"text":"There&#x27;s also Lazarus in this category.","time":1493530925,"type":"comment"},{"by":"deckiedan","id":14231282,"parent":14230273,"text":"The default download didn&#x27;t have GUI support on my Mac when I just tried it, and the documentation seems to indicate it&#x27;s Windows only so far?","time":1493556335,"type":"comment"}],"parent":14229756,"text":"I am now looking at the Red programming language [1] for exactly this, but it does not have the libraries of C++ or Tcl. Still it is under 1 meg complete with libraries and it is homoiconic, cross-platform, and has a REPL and a systems language Red&#x2F;System for going low level. The GUI and UI DSL and drawing DSL work on Windows and Mac for now, with Linux close behind.<p><pre><code>  [1]  http:&#x2F;&#x2F;www.red-lang.org&#x2F;p&#x2F;about.html</code></pre>","time":1493530029,"type":"comment"},{"by":"pjmlp","id":14231285,"parent":14229756,"text":"Back in the day a big mistake from Tk devs was how it just looked like Motif everywhere.<p>Eventually that got fixed, but we were already busy with other languages.","time":1493556369,"type":"comment"}],"parent":14229447,"text":"My usual solution for this is C++&#x2F;Qt. Runs well on Linux, and on Windows you can statically link Qt into the single .exe if your small app is FOSS (at least LGPL-compatible), otherwise you should ship a few extra .dll files.<p>Compared to Tcl&#x2F;tk you get (A) catch errors at compile time, and (B) Qt apps usually look better than Tk apps.<p>With mxe+qmake it&#x27;s one command to cross-compile from Linux to a Windows binary.","time":1493516478,"type":"comment"}],"parent":14229266,"text":"There&#x27;s a situation that springs up sometimes that is perfect for Tcl&#x2F;Tk: when you need to write a small app with a GUI and you would like it to be multiplatform.<p>Say you want to write an app to rename files in batch, or a wrapper for Ghostscript that automates certain tasks. With Tcl&#x2F;Tk you can immediately run it on most Linux distros and with Freewrap you get a Windows executable that&#x27;s a few MB+your source (it&#x27;s a lot better than having your users install Java).","time":1493509889,"type":"comment"},{"by":"tyingq","id":14229367,"kids":[{"by":"jancsika","id":14229522,"kids":[{"by":"auxym","id":14231588,"kids":[{"by":"pwg","id":14231930,"parent":14231588,"text":"This.  For a period of time in the 1990-1999 range, Tcl&#x2F;Tk was often <i>the only way</i> to have a cross platform program with a GUI that did not require the language equivalent of #ifdef WINDOWS&#x2F;#ifdef UNIX everywhere.  Which while providing &quot;one code base, two platforms&quot; really meant writing the platform specific code twice.<p>For most Tcl&#x2F;Tk usage at the time the same, unchanged, no &quot;ifdef&quot;&#x27;s present Tcl&#x2F;Tk script would run identically on the various environments that it supported.","time":1493565455,"type":"comment"}],"parent":14229522,"text":"Tcl 8.5 is a recent release though, around 2007.<p>When GP says &quot;one of the first scripting languages with a GUI toolkit&quot;, he is talking about the early 1990s. Before even python&#x27;s first release. In fact, python ended up with Tk as it&#x27;s stdlb GUI package because that was what was available.<p>Sure, Tk will never live up to Qt, but in 1991, I bet it was quite impressive to have a relatively simple yet expressive language like Tcl that shipped with a cross platform GUI toolkit, all under a very permissive license.","time":1493561653,"type":"comment"},{"by":"tyingq","id":14229556,"kids":[{"by":"jancsika","id":14233497,"kids":[{"by":"tyingq","id":14239783,"kids":[{"by":"jancsika","id":14255690,"parent":14239783,"text":"And that was quite obviously a reason many developers chose tcl&#x2F;tk at the time, <i>in spite of</i> tk not being a &quot;reasonably complete&quot; GUI toolkit.","time":1493820184,"type":"comment"}],"parent":14233497,"text":"Yes, qt is a better toolkit.  But it wasn&#x27;t embedded in a cross platform scripting language at the time.","time":1493660998,"type":"comment"}],"parent":14229556,"text":"It&#x27;s the &quot;reasonably complete&quot; phrase that I&#x27;m responding to.<p>For example: Qt was released around the same time.  Do you know if the first version included QGraphicsView? Because it has features we still associate with a modern 2d graphics API-- affine transforms, opacity, grouping of primitives, arbitrarily complex paths, and decent performance even with event handlers and many items being animated on the canvas.","time":1493582087,"type":"comment"}],"parent":14229522,"text":"All fair, but you have to take the time period in context.  There wasn&#x27;t the plethora of choice we have today.","time":1493511893,"type":"comment"}],"parent":14229367,"text":"&gt; A fair amount of the popularity was being the first scripting language with a reasonably complete, cross platform, UI widget toolkit.<p>That wasn&#x27;t my experience. At least in tcl&#x2F;tk 8.5 things like zooming in&#x2F;out of a tk canvas or updating a progress bar were a real pain.<p>For example, tk canvas has this nice, seemingly simple subcommand called &quot;scale&quot; that looks like it does exactly what it&#x27;s called with a tag and two double-precision floats. Apply it and all the relevant tk items are scaled accordingly. It even has a predefined tag called &quot;all&quot; that applies to all current tk canvas items. Trivial. Awesome.<p>Except text items don&#x27;t get scaled. And font sizes are limited to integer pixel&#x2F;point sizes. So zooming is actually non-trivial. Not awesome.<p>There are a sufficient number of such idiosyncracies that if you want to make a clear, usable interface you end up battling the toolkit.<p>Also, on the tcl language level I felt the &quot;everything is a string&quot; feature gets in the way. I&#x27;d much rather have implicit expressions and explicit string declarations.","time":1493511345,"type":"comment"}],"parent":14229266,"text":"A fair amount of the popularity was being the first  scripting language with a reasonably complete, cross platform,  UI widget toolkit.<p>It was also very easy to embed inside a C application for a user facing scripting capability.","time":1493508536,"type":"comment"},{"by":"systems","id":14229826,"kids":[{"by":"ecky-l","id":14236829,"kids":[{"by":"systems","id":14237172,"kids":[{"by":"ecky-l","id":14237486,"parent":14237172,"text":"&quot;well .. i am a big believer in the two layer separation&quot;<p>I believe in this too. Not only two layers, if necessary there can be more.<p>For that to work, well designed interfaces are quite necessary.<p>&quot;tcl + c .. are not exactly that and i believe a more modern combo will be better&quot;<p>You don&#x27;t necessarily need to reinvent Tcl in another &quot;more modern&quot; language to achieve that. You can compile Rust crates to dynamic libraries (.dll, .so) and use c types, or ffidl in Tcl (<a href=\"http:&#x2F;&#x2F;elf.org&#x2F;ffidl&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;elf.org&#x2F;ffidl&#x2F;</a>) to call the functions in your DLL-crates. Or write a small Tcl C extension to wrap function calls in the Rust code. That will do, without rewriting Tcl in Rust. For the other way around you can always call the Tcl library via its DLL interface in the same manner (which is the way to embed Tcl interpreters in other programs).","time":1493647378,"type":"comment"}],"parent":14236829,"text":"well .. i am a big believer in the two layer separation<p>we program at two layers, high level, and low level<p>features needed or preferred in low level programming, may not be required in high level programming and vice versa<p>there are several ways to work like this, and many people do \nfor example, many developers use lua or python with c&#x2F;c++<p>the effort needed to make the two language interact vary<p>another approach is to use one language with optional features, like optional typing or optional garbage collection, a language i believe is adopting this approach is red<p>have a programming framework, where two languages optimized for the two different layer use each others entities (names, objects, values, interfaces) seamlessly is in my opinion a super good approach for most programming<p>tcl + c .. are not exactly that and i believe a more modern combo will be better","time":1493644001,"type":"comment"},{"by":"lmm","id":14241457,"parent":14236829,"text":"I do think we need a richer ABI than C offers (in particular, one with native support for sum types). .net was intended to be that (sort of) but people don&#x27;t write low - level libraries in it because it ties you to GC.","time":1493671959,"type":"comment"}],"parent":14229826,"text":"&quot;I think if someone can rewrite tcl or a tcl like language, as the top level language, using a more modern low level language, like Rust or Go ... it will be a very nice combo, I think Tcl can serve as a really nice declarative language&quot;<p>Why would someone rewrite Tcl in another language? That is just an immense amount of work and would (re)introduce bugs that have been found and fixed in Tcl over the last 3 decades.<p>Just the fact that Tcl is old doesn&#x27;t mean that it is dead. It is actively developed and used, although mostly hidden (its not that kind of hype around as with Python or Ruby). \nThat Tcl is old does in fact imply that the code base is mature and reliable, its well documented and doesn&#x27;t come with surprises. Which in turn means that your code is almost never broken with a new Tcl version. In fact, scripts and extensions written for 8.4, 15 yrs ago, are mostly still functional in 8.6 without modifications. \nYet Tcl does come with pleasant surprises that don&#x27;t break old programs, as can be seen with the new features in 8.6 (TclOO, coroutines, tailcall, try&#x2F;trap ...)","time":1493638578,"type":"comment"}],"parent":14229266,"text":"well, for me, when i used to like Tcl, it was<p><pre><code>    * the everything is a string, mantra\n    * meta-programming possibilities \n    * tcl wiki ( http:&#x2F;&#x2F;wiki.tcl.tk&#x2F; ) \n</code></pre>\nthe tcl wiki is the reason i fell in love with wikis, my first wiki experience, and in my opinion when it was very active, it was home of a really nice community<p>I think if someone can rewrite tcl or a tcl like language, as the top level language, using a more modern low level language, like Rust or Go ... it will be a very nice combo, I think Tcl can serve as a really nice declarative language<p>If you look at Sqlite, it really is the perfect example of an offspring of the tcl community, a declarative solution for a complex problem , written in C ... a perfect tcl<p>I stopped following Tcl a long time ago, so I have no clue where it is at now ... but i hope it is still being used, for the super nice community .. it had&#x2F;has","time":1493518209,"type":"comment"},{"by":"jankedeen","id":14246508,"kids":[{"by":"ecky-l","id":14261890,"parent":14246508,"text":"I think you are a really good programmer by the time you use Tcl again: as a complementary language for test automation, or to integrate it in your software as DSL...<p>First you use it because it is simple to learn. Then you outgrow it and blame its weaknesses. Then you remember its strengths from a different perspective and pick it up again :)","time":1493863852,"type":"comment"}],"parent":14229266,"text":"By the time you outgrow TCL you are a really good programmer.\nYou choose and advocate appropriately.","time":1493734712,"type":"comment"}],"parent":14228849,"text":"Why do people like Tcl? I&#x27;ve never tried diving in to using the language, but I have debugged MacPorts now and then, which is all Tcl, and I&#x27;ve seen that Tcl UI library used in other scripting languages.<p>What&#x27;s the draw, other than having some existing code written in the language? Gems like the `upvar` command? (<a href=\"http:&#x2F;&#x2F;wiki.tcl.tk&#x2F;1508\" rel=\"nofollow\">http:&#x2F;&#x2F;wiki.tcl.tk&#x2F;1508</a>)<p>Is there something special about Tcl that makes it a joy to use?","time":1493507271,"type":"comment"},{"by":"grondilu","id":14229217,"kids":[{"by":"tyingq","id":14229401,"kids":[{"by":"kodablah","id":14229464,"parent":14229401,"text":"GC is not as far off as you might think. A markdown overview has been merged and there is a PR for impl in the interpreter. See PRs at <a href=\"https:&#x2F;&#x2F;github.com&#x2F;WebAssembly&#x2F;gc\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;WebAssembly&#x2F;gc</a>","time":1493510285,"type":"comment"},{"by":"vvanders","id":14229437,"kids":[{"by":"tyingq","id":14229536,"parent":14229437,"text":"On GC, maybe you should let them know. \nThey seem to be headed down that path: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;WebAssembly&#x2F;design&#x2F;blob&#x2F;master&#x2F;GC.md\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;WebAssembly&#x2F;design&#x2F;blob&#x2F;master&#x2F;GC.md</a><p>Oh, and on direct DOM access.  You presented a link to an implementation of indirect DOM access.  They have an open issue you might find interesting: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;tcr&#x2F;rust-webplatform&#x2F;issues&#x2F;20\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;tcr&#x2F;rust-webplatform&#x2F;issues&#x2F;20</a>","time":1493511629,"type":"comment"}],"parent":14229401,"text":"&gt; Wasm has no facility for GC<p>It shouldn&#x27;t, GC is a level above Wasm and would complicate languages that don&#x27;t use it.<p>&gt; or direct DOM integration<p>You mean like this: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;tcr&#x2F;rust-webplatform\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;tcr&#x2F;rust-webplatform</a> ?<p>The problem with most dynamic langauges you listed is they do things that the web doesn&#x27;t allow or do them in ways that aren&#x27;t friendly to a browser.","time":1493509532,"type":"comment"},{"by":"traverseda","id":14229654,"kids":[{"by":"tyingq","id":14229722,"kids":[{"by":"traverseda","id":14229822,"kids":[{"by":"tyingq","id":14229881,"parent":14229822,"text":"You have to come at it from the perspective of people that want languages like Perl or Python to run well in WASM.  They are thinking of it being used the same way that javascript is today.  If WASM has some of the features of a virtual machine (meaning the JVM type, not the hypervisor type), and direct DOM access, that would be possible.  Downloading all of the runtime would put them at a disadvantage.<p>Those things are on the WASM roadmap.  So this isn&#x27;t just me going off on a tangent. <a href=\"https:&#x2F;&#x2F;github.com&#x2F;WebAssembly&#x2F;design&#x2F;blob&#x2F;master&#x2F;GC.md\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;WebAssembly&#x2F;design&#x2F;blob&#x2F;master&#x2F;GC.md</a>","time":1493519113,"type":"comment"}],"parent":14229722,"text":"Well sure, but a runtime isn&#x27;t going to change all that much. It&#x27;s exactly the kind of thing that caches well. I mean a re-usable garbage collector sounds alright, but I don&#x27;t think it will be used that much. I mean, I presume that you could implement a garbage collector as a shared library, but nobody actually does that.","time":1493518123,"type":"comment"}],"parent":14229654,"text":"It is not a complaint. It is in their plans.  They describe it sometimes in VM terms, versus ASM terms.<p>Without those things, languages like Perl or Python aren&#x27;t practical, because you would have to download the whole interpeter runtime.  That&#x27;s not a complaint, it is an observation.","time":1493515702,"type":"comment"}],"parent":14229401,"text":"Assembly language also doesn&#x27;t have GC or polymorphic inline cache. I imagine that direct DOM integration would end up just being some kind of shared memory thing.<p>I don&#x27;t get this kind of complaint. It seems to completely miss the point that webassembly is a <i>compile target</i>, like arm or x86.","time":1493514320,"type":"comment"},{"deleted":true,"id":14229417,"parent":14229401,"time":1493509235,"type":"comment"}],"parent":14229217,"text":"Wasm has no facility for GC, polymorphic inline cache, or direct DOM integration.  They are on the roadmap, but probably far off.<p>So there isn&#x27;t a direct path to WASM for many dynamically typed languages.  Tcl can get by without all that because it&#x27;s small enough to just port the whole C interpreter instead of trying to have tcl compile down to wasm.  That would be very large, slow, and tricky for Perl, Python, etc.","time":1493508967,"type":"comment"},{"by":"petre","id":14230675,"parent":14229217,"text":"There would be several options I think.<p><pre><code>  - translate MoarVM bytecode to WASM\n  - add WASM as a Rakudo target\n  - write yet another Perl6 compiler that targets the WASM just as niecza targets the CLR\n</code></pre>\nPerl5 will probably end up as a Perl6 slang.","time":1493541211,"type":"comment"},{"by":"mstade","id":14229229,"kids":[{"by":"grondilu","id":14229242,"kids":[{"by":"Cyph0n","id":14229320,"kids":[{"by":"dozzie","id":14229454,"kids":[{"by":"Cyph0n","id":14229899,"kids":[{"by":"tyingq","id":14230060,"parent":14229899,"text":"Perl has some syntax that can be ambiguous.  To the point that some code can&#x27;t be parsed without running it.<p>See this for more on that: <a href=\"http:&#x2F;&#x2F;www.perlmonks.org&#x2F;?node_id=663393\" rel=\"nofollow\">http:&#x2F;&#x2F;www.perlmonks.org&#x2F;?node_id=663393</a>","time":1493523672,"type":"comment"}],"parent":14229454,"text":"You are right, I&#x27;m completely ignorant on the topic haha. Could you clarify what you mean by &quot;vote&quot;?","time":1493519617,"type":"comment"}],"parent":14229320,"text":"I know you&#x27;re being encouraging, but I think you&#x27;re underestimating the\ncomplexity of Perl parser. From what I remember, there were three subsystems\nthat voted for each expression what programmer meant.","time":1493510068,"type":"comment"},{"by":"BenGoldberg","id":14229451,"kids":[{"by":"Cyph0n","id":14229906,"parent":14229451,"text":"That makes sense. Library compatibility is a tough issue to deal with. Scala.js faces the same issue when it comes to libraries that depend on the Java stdlib. I believe their goal is to port the entire stdlib, but I&#x27;m not sure tbh. It might just be an insurmountable problem.","time":1493519688,"type":"comment"},{"by":"petre","id":14230707,"parent":14229451,"text":"Actually quite few are XS and XS is painful&#x2F;a terrible way to plug C code inside of the Perl interpreter&#x27;s guts. For this reason Perl6 aims to rewrite most of the stuff in Perl6&#x2F;NQP and use NativeCall to call on external libraries.","time":1493542227,"type":"comment"}],"parent":14229320,"text":"The stuff which makes perl really awesome are the distributions on CPAN.<p>Many (though not all) of these distributions contain XS, which is a type of glue between perl and C.  Most of these XS distributions are there to link to some library -- Math::GMP, for example, lets perl code use the GNU gmp multi precision math library.<p>Without some way to make use of distributions with XS parts, then a perl to $other_language_here transpiler is not going to be very interesting.","time":1493509979,"type":"comment"}],"parent":14229242,"text":"Ehh I don&#x27;t think so. I&#x27;m certain that you <i>are</i> a good coder. You just need to learn more about the techniques needed to implement a Perl to WASM compiler, and obviously, a ton of time.<p>You can do it man.","time":1493507818,"type":"comment"}],"parent":14229229,"text":"I&#x27;ve tried.  It&#x27;s just hard, frankly.  I&#x27;m just not that good a coder :(","time":1493506921,"type":"comment"}],"parent":14229217,"text":"Sounds like an opportunity to step up to the plate!","time":1493506699,"type":"comment"}],"parent":14228849,"text":"I&#x27;m a Perl fan and as such it saddens me to see other languages targeting wasm.  I&#x27;ve been convinced for a while that webassembly is the next big thing in computing and so far the Perl community as far as I know has shown close to no interest whatsoever.","time":1493506467,"type":"comment"},{"by":"mappu","id":14229339,"parent":14228849,"text":"I&#x27;d be interested to see a Tk implementation.<p>It would be neat if there were credible alternatives to the DOM.","time":1493508052,"type":"comment"},{"by":"interfixus","id":14230383,"kids":[{"by":"zwischenzug","id":14231094,"kids":[{"by":"interfixus","id":14239418,"parent":14231094,"text":"I didn&#x27;t ever. But nice to know.","time":1493659020,"type":"comment"}],"parent":14230383,"text":"If you&#x27;ve ever placed a sports bet anywhere in the world online, chances are your bet went through Tcl code front and back. I spent 15 years writing it.","time":1493552669,"type":"comment"}],"parent":14228849,"text":"At long, overdue, too late last...<p>In the very early days of the web, I used to fantasize - naively - about the whole undignified html hodgepodge never having happened, and the entire web just running on served-up tcl&#x2F;tk.","time":1493533314,"type":"comment"},{"by":"zackangelo","id":14232344,"parent":14228849,"text":"I learned Tcl back in the day just so I could customize Eggdrop [1].<p>[1] <a href=\"https:&#x2F;&#x2F;www.eggheads.org&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.eggheads.org&#x2F;</a>","time":1493570210,"type":"comment"},{"by":"themihai","id":14232022,"kids":[{"by":"pwg","id":14232382,"parent":14232022,"text":"tDOM is an XML parser based on expat that provides both a SAX and a DOM parser.  It parses into its own DOM that one can then run XPATH expressions against or manipulate as one sees fit with tDOM&#x27;s interface methods.<p>Unfortunately the DOM for tDOM is not the web browser DOM that Javascript interfaces with.  Same term, so very confusing, but not the same DOM&#x27;s.","time":1493570595,"type":"comment"},{"by":"ecky-l","id":14233083,"parent":14232022,"text":"tDOM is just for parsing and generating XML or, more interrestingly, HTML.\nOnce you have that, you can use the ::wacl::dom command to inject it into the browser dom. Or use the wacl::dom command to get HTML which then can be parsed via tDOM.","time":1493577037,"type":"comment"}],"parent":14228849,"text":"&gt;&gt; tDOM for parsing and creating XML and HTML content<p>How is tDOM supposed to work if WebAssembly doesn&#x27;t have access to the DOM?","time":1493566660,"type":"comment"},{"by":"ecky-l","id":14232424,"parent":14228849,"text":"To clarify: this is the Tcl interpreter compiled to webassembly. Not a Tcl program or the language.","time":1493570885,"type":"comment"},{"by":"kristopolous","dead":true,"id":14230376,"parent":14228849,"text":"Of interesting historical note, the W3C HTML 4 standard alludes to TCL as a possible scripting language when describing the script tag, albeit just as a number of examples:<p><a href=\"https:&#x2F;&#x2F;www.w3.org&#x2F;TR&#x2F;html4&#x2F;interact&#x2F;scripts.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.w3.org&#x2F;TR&#x2F;html4&#x2F;interact&#x2F;scripts.html</a><p>AFAIK no vendor took them up on even claiming to think about supporting tcl at the time","time":1493533093,"type":"comment"},{"by":"jblow","id":14229700,"parent":14228849,"text":"Guys. Stay away. Tcl is awful if you want to write software that doesn&#x27;t waste hours and hours and hours of your precious time hunting down simple bugs that would not have been an issue in most other languages.<p>- guy who used Tcl in like 1992 and helped write a &#x27;compiler&#x27; for it, etc.","time":1493515372,"type":"comment"}],"id":14228849,"score":91,"url":"https://fossil.e-lehmann.de/wacl/index","by":"blacksqr"},"14228010":{"by":"anigbrowl","descendants":0,"id":14228010,"score":1,"time":1493491222,"title":"Press freedom's dark horizon","type":"story","url":"https://freedomhouse.org/report/freedom-press/freedom-press-2017"},"14228211":{"by":"jseliger","descendants":0,"id":14228211,"score":1,"time":1493493482,"title":"A Bold Goal: Expediting Seattle's Light Rail System Expansion","type":"story","url":"https://www.theurbanist.org/2017/04/28/bold-goal-expediting-sound-transit-system-expansion/"},"14228592":{"time":1493497909,"type":"story","descendants":3,"title":"The Generalist, the Specialist, and the Leader","kids":[{"by":"baccheion","id":14229146,"kids":[{"by":"nbrempel","id":14232323,"kids":[{"by":"baccheion","id":14242194,"parent":14232323,"text":"Corporations, even if you look at the graph linked in that article, are biased toward Te users (with extroverted Te users being more favored than introverted ones), then the other extroverted judgers, then everyone else. That is, INTPs and others tend to not make as much.","time":1493676759,"type":"comment"}],"parent":14229146,"text":"Interesting comparison! I didn&#x27;t actually think to compare this to MBTI results.<p>According to this random article, the average salaries of those personalities is pretty evenly distributed over those personalty types:<p><a href=\"https:&#x2F;&#x2F;www.mindbodygreen.com&#x2F;0-18425&#x2F;the-personality-types-that-make-the-highest-and-lowest-salaries.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.mindbodygreen.com&#x2F;0-18425&#x2F;the-personality-types-...</a>","time":1493569935,"type":"comment"}],"parent":14228592,"text":"The INTP, INTJ, and ENTJ.","time":1493505259,"type":"comment"}],"id":14228592,"score":2,"url":"https://rempel.world/posts/generalist-specialist-leader.html","by":"nbrempel"},"14228675":{"by":"desdiv","descendants":0,"id":14228675,"score":2,"time":1493499181,"title":"Scalajs-react 1.0.0 Released","type":"story","url":"https://github.com/japgolly/scalajs-react/blob/master/doc/changelog/1.0.0.md"},"14228063":{"by":"quineoa","descendants":0,"id":14228063,"score":6,"time":1493491642,"title":"Communicating Sequential Processes (1978) [pdf]","type":"story","url":"http://www.cs.ucf.edu/courses/cop4020/sum2009/CSP-hoare.pdf"},"14227950":{"time":1493490630,"type":"story","descendants":1,"title":"“How do I opt out of Google Location services?”","kids":[{"by":"tinus_hn","id":14229636,"parent":14227950,"text":"Now just add _optput to opt out of wifi sense too and we&#x27;re done. I guess.","time":1493513933,"type":"comment"}],"id":14227950,"score":2,"url":"https://support.google.com/nexus/answer/1725632#how_opt_out","by":"davidbarker"},"14228376":{"by":"ColinWright","descendants":0,"id":14228376,"score":4,"time":1493495530,"title":"How Computers Boot Up","type":"story","url":"http://duartes.org/gustavo/blog/post/how-computers-boot-up/"},"14228325":{"time":1493494992,"type":"story","descendants":1,"title":"Ask HN: How to get entire list of all registered .io domain names?","kids":[{"by":"Bino","id":14228450,"parent":14228325,"text":"All names in the .io zone are DNSSEC signed<p><a href=\"https:&#x2F;&#x2F;www.nic.io&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.nic.io&#x2F;</a><p>hence, you should be able to do a DNSSEC walk?<p><a href=\"https:&#x2F;&#x2F;www.google.com&#x2F;search?q=dnssec+walk\" rel=\"nofollow\">https:&#x2F;&#x2F;www.google.com&#x2F;search?q=dnssec+walk</a>","time":1493496296,"type":"comment"}],"id":14228325,"score":2,"by":"traviswingo","text":"I doing some research on the trends of .io domain names. I&#x27;m having trouble getting a reliable list of all registered .io domain names, though. I&#x27;ve purchased a few curated lists, but they were obviously incomplete. The .io registry does not supply access to zone files like verisign does (use to?).<p>Anyone know of a reliable way to gather the entire dataset of registered .io domain names?"},"14228548":{"by":"jseliger","descendants":0,"id":14228548,"score":2,"time":1493497392,"title":"The Crisis of Western Civ","type":"story","url":"https://www.nytimes.com/2017/04/21/opinion/the-crisis-of-western-civ.html"},"14227876":{"by":"lamby","descendants":0,"id":14227876,"score":2,"time":1493489926,"title":"Django LTS: Security patches for older versions of the Django web framework","type":"story","url":"https://djangolts.com/"},"14228466":{"by":"protomyth","descendants":0,"id":14228466,"score":2,"time":1493496434,"title":"Scientists identify chemical causes of battery capacity fade – Argonne Nat'l Lab","type":"story","url":"http://www.anl.gov/articles/scientists-identify-chemical-causes-battery-capacity-fade"},"14228470":{"by":"uladzislau","descendants":0,"id":14228470,"score":4,"time":1493496456,"title":"How I work 70 hours a week without burning out","type":"story","url":"https://pilot.co/blog/how-i-work-70-hours-a-week-without-burning-out/?utm_content=buffer7f688&utm_medium=social&utm_source=twitter.com&utm_campaign=buffer"},"14227741":{"by":"abhikandoi2000","descendants":0,"id":14227741,"score":1,"time":1493488243,"title":"What I wish I knew about Computer Security in college","type":"story","url":"https://gist.github.com/abhikandoi2000/a1b92830fc45d319c8de16e98baa045b"},"14227843":{"by":"rmhrisk","descendants":0,"id":14227843,"score":2,"time":1493489591,"title":"Secondary effects of encrypting the web","type":"story","url":"https://unmitigatedrisk.com/?p=582"},"14228549":{"time":1493497407,"type":"story","descendants":1,"title":"Like looking at pictures of dogs?  Well, here's a thing.","kids":[{"by":"hank808","id":14228791,"parent":14228549,"text":"If you don&#x27;t want to flood your Facebook friends with millions of pictures of your dogs, here&#x27;s a place where people will love you for it.  #funsideproject","time":1493500538,"type":"comment"}],"id":14228549,"score":1,"url":"https://puppy.pics/","by":"hank808"},"14227849":{"by":"shubh24","descendants":0,"id":14227849,"score":1,"time":1493489634,"title":"Analytics on the New York Rental Market – Top 15% on Kaggle","type":"story","url":"https://shubh24.github.io/shubh24.github.com/math/2017/04/29/Analytics-on-the-New-York-rental-market-Top-17-on-Kaggle!.html"},"14228052":{"time":1493491557,"type":"story","descendants":5,"title":"Show HN: Book discussion community for book lovers","kids":[{"by":"__santoshg","id":14228065,"kids":[{"by":"qrv3w","id":14231315,"kids":[{"by":"__santoshg","id":14231347,"kids":[{"by":"qrv3w","id":14231786,"kids":[{"by":"__santoshg","id":14234806,"parent":14231786,"text":"Hi i had messaged u","time":1493600083,"type":"comment"}],"parent":14231347,"text":"I&#x27;m working on something that might be useful, maybe you could message me on discussbook to discuss it? My handle is the same as on HN.","time":1493563906,"type":"comment"}],"parent":14231315,"text":"Thats a bit concern for me, I am actively looking for people who can help me... are you interested ?? :-)","time":1493557779,"type":"comment"}],"parent":14228065,"text":"Nice idea! Just curious, how will you go about creating the community?","time":1493557042,"type":"comment"}],"parent":14228052,"text":"Its a QA book discussion forum, you can ask questions and post notes on books you read.... currently I am building the community.","time":1493491652,"type":"comment"}],"id":14228052,"score":4,"url":"https://discussbook.com","by":"__santoshg"},"14227827":{"by":"SugarPitch","descendants":0,"id":14227827,"score":1,"time":1493489442,"title":"The Definite Startup Funding Guide (From Idea to IPO and Facebook Case Study)","type":"story","url":"https://roadtofunding.com/startup-funding/"},"14227815":{"time":1493489256,"type":"story","descendants":1,"title":"Which messaging would make you want to subscribe to this mobile app?","kids":[{"by":"aszantu","id":14227854,"parent":14227815,"text":"sorry I&#x27;m poor. No amount of marketing will make me buy something I don&#x27;t absolutely need","time":1493489665,"type":"comment"}],"id":14227815,"score":1,"url":"https://betterdesign.io/poll/59049b6a5eea1d0ccfcb6f27","by":"Joanna198855"},"14228094":{"by":"philips","descendants":0,"id":14228094,"score":2,"time":1493491891,"title":"Terraform for Bare Metal with Matchbox","type":"story","url":"https://coreos.com/blog/matchbox-with-terraform"},"14228668":{"time":1493499049,"type":"story","descendants":2,"title":"Turkey blocked access to Wikipedia after it refused to remove content","kids":[{"by":"makecheck","id":14228793,"parent":14228668,"text":"The sooner we can move away from simple name resolution, the better.  It’s way too easy to filter out things you don’t like right now, way too easy for users to be misled by domains that look similar to well-known domains, etc.<p>When you load a web site, the only thing you should really have to seek is a verifiable identity (that can further be used to ensure the integrity of the content), and the identity should be a million times more important than the domain.  If I accept $SECURE_WIKIPEDIA_IDENTITY, I should be able to load mirrors from any of 10,000 domains that publish content under that identity, as long as my browser can verify the sender.  That makes it completely impossible for those in power to simply match a domain to a regex.  Incidentally, it would also eliminate garbage like registrars pocketing absurd amounts of cash for all possible domain variants of &lt;company&gt;.&lt;anything&gt; because a user wouldn’t even need to know domain names in a system that is based on much more descriptive identities.","time":1493500562,"type":"comment"},{"by":"I_am_neo","id":14229402,"parent":14228668,"text":"Ms Streisand called, wants her metaphor back","time":1493508976,"type":"comment"}],"id":14228668,"score":7,"url":"http://www.theverge.com/platform/amp/2017/4/29/15486692/turkey-blocked-access-wikipedia-refused-remove-content","by":"2bluesc"},"14228516":{"time":1493497093,"type":"story","descendants":3,"title":"Ask HN: Is Ethereum the next Bitcoin?","kids":[{"by":"cjbarre","id":14231768,"kids":[{"by":"cjbarre","id":14232001,"parent":14231768,"text":"ALSO:<p>A beautiful feature of this market is that most of these projects have whitepapers!<p><a href=\"https:&#x2F;&#x2F;github.com&#x2F;ethereum&#x2F;wiki&#x2F;wiki&#x2F;White-Paper\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;ethereum&#x2F;wiki&#x2F;wiki&#x2F;White-Paper</a><p><a href=\"https:&#x2F;&#x2F;golem.network&#x2F;doc&#x2F;Golemwhitepaper.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;golem.network&#x2F;doc&#x2F;Golemwhitepaper.pdf</a><p><a href=\"https:&#x2F;&#x2F;whitepaper.uport.me&#x2F;uPort_whitepaper_DRAFT20170221.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;whitepaper.uport.me&#x2F;uPort_whitepaper_DRAFT20170221.p...</a><p><a href=\"https:&#x2F;&#x2F;bravenewcoin.com&#x2F;assets&#x2F;Whitepapers&#x2F;Augur-A-Decentralized-Open-Source-Platform-for-Prediction-Markets.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;bravenewcoin.com&#x2F;assets&#x2F;Whitepapers&#x2F;Augur-A-Decentra...</a><p><a href=\"https:&#x2F;&#x2F;gnosis.pm&#x2F;resources&#x2F;default&#x2F;pdf&#x2F;gnosis_whitepaper.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;gnosis.pm&#x2F;resources&#x2F;default&#x2F;pdf&#x2F;gnosis_whitepaper.pd...</a><p>It&#x27;s important for everyone to realize that as some of the more technical people in the world, we are uniquely positioned to be able to judge the value of these projects by understanding of the technological implications they introduce.<p>I.E. We know the value of platforms, well, some of these projects are positioning themselves to be core platforms in an ecosystem where entire industries will be built with software. Any project that makes it easier to build this software is worth looking into and reading their whitepaper.<p>That&#x27;s all from me. It&#x27;s really exciting!","time":1493566317,"type":"comment"},{"by":"davidgerard","id":14237327,"parent":14231768,"text":"&gt; - Impossible to censor, decentralized news.<p>Until, as we saw with The DAO, the whales are in danger of losing money.","time":1493645663,"type":"comment"}],"parent":14228516,"text":"Heavily underreported? Yes.<p>Similar? Yes.<p>Ethereum is different because it is built to be a platform first and foremost. This platform is for allowing other individuals and organizations to build new blockchain technology without having to engineer their own blockchain.<p>Imagine if every crypto company had their own blockchain, adoption of crypto would be unlikely.<p>So, Ethereum allows you to create &#x27;smart contracts&#x27; which you can think of as microservices (yeah, code) that exist forever on the blockchain, maintaining application state on a decentralized and infinitely expanding database i.e. the blockchain.<p>Industries will be disrupted by the new concept (web3) of the decentralized app or DAPP. This concept effectively removes middlemen from various processes (middlemen charge fees and own your data in a centralized way).<p>So think:<p>- No more centralized trading exchanges with fees.<p>- No more Google owning your digital identity data.<p>- No more AWS running your computing infrastructure in a \nproprietary, closed manner.<p>- Direct licencing for artists and musicians.<p>- Impossible to censor, decentralized news.<p>The list goes on.<p>Why is Ethereum different? It aims to make it EASY for others to create ontop of a blockchain.<p>A few interesting projects:<p>Golem - Decentralized cloud computing<p>Uport - Self-Sovereign digital identities<p>Augur - Prediction market platform<p>OH and don&#x27;t forget about the popularization of a new (to me) investment model called​ the ICO, or &quot;Initial Coin Offering&quot; there are DAPP companies rasing millions of dollars in immediate funding in a matter of days right now.<p>See Gnosis.<p>Hope this helps you understand.<p>Edit: Missed letter (on phone), Formatting","time":1493563780,"type":"comment"}],"id":14228516,"score":5,"by":"emgram769","text":"It&#x27;s surging right now but seems to be heavily underreported.  They&#x27;re pretty similar, though, right?  Why is it climbing at all?"},"14228943":{"time":1493502328,"type":"story","descendants":1,"title":"Ask HN: What would be a good domain for this project?","kids":[{"by":"dozzie","id":14229433,"parent":14228943,"text":"Not what you&#x27;re asking about, but two things here.<p>I don&#x27;t see how &quot;realtime key-value DB&quot; would work like and how would I be\nsupposed to use it, nor I know this socket.io thing, so you should work more\non your project description. The best would be to avoid comparisons to any\nother software. Those belong to a different README section (or to FAQ).<p>Then, &quot;V&quot; name may be nice and short, but will be atrocious for searching the\nproject anywhere, and you&#x27;ll probably run into similar problems as you now\nhave (would have) with buying a domain, but with a different service (e.g.\ncreating an organization on GitHub). Consider changing the name.","time":1493509516,"type":"comment"}],"id":14228943,"score":1,"by":"diegorbaquero","text":"I&#x27;m building a realtime key-value DB (like redis without the queries) and events framework (could replace socket.io). It&#x27;s the most easy-to-use framework ever. It&#x27;s called V, you can install it with `npm install v`<p>Now, what would be a good domain for it? (The web GUI, the project info, etc). I have vars.online but I dislike it.<p>If you have any feedback or questions, feel free to msg me @DiegoRBaquero (any social network)<p>Thank you HN!"},"14228790":{"time":1493500535,"type":"story","descendants":1,"title":"(It’s Great To) Suck at Something","kids":[{"by":"creatine_lizard","id":14228918,"parent":14228790,"text":"The article was a bit pretentious for my taste, but I agree with the title.  I&#x27;ve noticed a small but definite &quot;trickle down&quot; effect to the things I do well from spending time doing things that I&#x27;m bad at.","time":1493501987,"type":"comment"}],"id":14228790,"score":1,"url":"https://www.nytimes.com/2017/04/28/opinion/its-great-to-suck-at-surfing.html","by":"sergeant3"},"14228113":{"time":1493492118,"type":"story","descendants":2,"title":"Yik Yak shuts down and sells off engineers for $1M","kids":[{"by":"elmerland","id":14228471,"kids":[{"by":"Cozumel","id":14228526,"parent":14228471,"text":"No business model. Just take the funding and run.","time":1493497167,"type":"comment"}],"parent":14228113,"text":"What is the business model for companies like these? They don&#x27;t collect data like social media sites so advertisers are not as drawn to them. And moderating the groups is near impossible. What was their end goal here?","time":1493496472,"type":"comment"}],"id":14228113,"score":4,"url":"http://www.theverge.com/2017/4/28/15480052/yik-yak-shut-down-anonymous-messaging-app-square","by":"Tideflat"},"14228807":{"by":"pjmlp","descendants":0,"id":14228807,"score":1,"time":1493500692,"title":"2017 EuroLLVM, Using LLVM for Safety-Critical Applications","type":"story","url":"https://www.youtube.com/watch?v=pmy1Ttieh3I"},"14228532":{"time":1493497206,"type":"story","descendants":76,"title":"Germany's Energy Giant Launches Ethereum-Based Electric Car Charging Stations","kids":[{"by":"Animats","id":14229071,"kids":[{"by":"Ursium","id":14229297,"kids":[{"by":"Animats","id":14229419,"kids":[{"by":"Ursium","id":14231129,"parent":14229419,"text":"It&#x27;s a soft launch. Looks like the media jumped on it a tad too early, but the proper launch is imminent regardless.","time":1493553105,"type":"comment"},{"by":"mlvljr","dead":true,"id":14230435,"parent":14229419,"text":"You one of those baby boomers, aren&#x27;t you?<p>XD","time":1493534472,"type":"comment"}],"parent":14229297,"text":"The article says &quot;has launched&quot;. It hasn&#x27;t?","time":1493509302,"type":"comment"},{"by":"runeks","id":14230697,"parent":14229297,"text":"Who is the debitor in this scenario? In other words, who sends me 1000 EUR via SEPA when I cash in my 1000 virtual Euro tokens?<p>Seems to me like, when it comes to credit, Chaumian cash makes much more sense, since you depend on a central party anyway. The only weakness of Chaumian cash is the central party, but with redeemable tokens you depend on a central party in the first place, since someone needs to redeem the tokens in question.","time":1493541975,"type":"comment"}],"parent":14229071,"text":"Actually, the Euro Token is a virtual FIAT implemented on Ethereum. I can&#x27;t reveal much more information on it until the project formally goes live (which is imminent), but I can&#x27;t tell you it thankfully goes a lot further than what you noted.<p>There&#x27;s a lot more information coming up because it&#x27;s my understanding Carsten only intended his tweet a bit as a &#x27;teaser&#x27;. I had written this piece back in September when we entered live beta: <a href=\"https:&#x2F;&#x2F;blog.slock.it&#x2F;blockchain-energy-p2p-sharing-project-share-charge-going-into-live-beta-ad4e069e79dwhich\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.slock.it&#x2F;blockchain-energy-p2p-sharing-project-...</a> might give a bit more context.","time":1493507602,"type":"comment"},{"by":"davidgerard","id":14229078,"parent":14229071,"text":"The original post is a completely BS Bitcoin&#x2F;Blockchain hype blog, any journalism will be completely coincidental.","time":1493504359,"type":"comment"},{"by":"softwarelimits","id":14230924,"parent":14229071,"text":"Note that &quot;Sofortüberweisung&quot; is a service where people do store their private bank account data (!) - when I first saw that I was sure it was a joke, but people are using it.<p>They even want to store payment tokens (PIN&#x2F;TAN, however you call it). Yes, you understood it right: they store your secret access tokens to your bank account to make the payment &quot;easy&quot; for you - good luck!<p>This gives a good impression about technical education in germany, there is still lots of ignorance, not only &quot;on the streets&quot; but also at places where decisions are made.","time":1493548481,"type":"comment"},{"deleted":true,"id":14231679,"parent":14229071,"time":1493562948,"type":"comment"}],"parent":14228532,"text":"On the site for RWE&#x27;s charging points, there&#x27;s no mention of this.[1]<p>The way RWE actually works is like cell phone plans. Users have to sign up for a 1-year contract. This gets you an ID token which the charging stations recognize when you plug into the charger. Then there&#x27;s an EUR 0.30&#x2F;Kwh charge, which is billed periodically. That&#x27;s the usual way the system is used.<p>The Share and Charge system [3] doesn&#x27;t use Etherium as a currency. They use Euros.\nPayments are made using SEPA, PayPal, and Sofortüberweisung (which is sort of like Venmo.) They mention that they&#x27;re using a blockchain, but don&#x27;t mention Etherium at all. Share and Charge is a third-party payment system for electric charging points.  They try to sign up charging point operators to accept their payment system.<p>So the headline is somewhat deceptive.<p>[1] <a href=\"https:&#x2F;&#x2F;www.rwe-mobility.com&#x2F;web&#x2F;cms&#x2F;en&#x2F;1178726&#x2F;private-customers&#x2F;frequently-asked-questions&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.rwe-mobility.com&#x2F;web&#x2F;cms&#x2F;en&#x2F;1178726&#x2F;private-cust...</a>\n[2] <a href=\"https:&#x2F;&#x2F;www.rwe-mobility.com&#x2F;web&#x2F;cms&#x2F;en&#x2F;1232368&#x2F;products-services&#x2F;rwe-epower&#x2F;rwe-epower-basic&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.rwe-mobility.com&#x2F;web&#x2F;cms&#x2F;en&#x2F;1232368&#x2F;products-ser...</a>\n[3] <a href=\"https:&#x2F;&#x2F;shareandcharge.com&#x2F;en&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;shareandcharge.com&#x2F;en&#x2F;</a>","time":1493504247,"type":"comment"},{"by":"RichardHeart","id":14228641,"kids":[{"by":"erikpukinskis","id":14228717,"kids":[{"by":"RichardHeart","id":14228829,"kids":[{"by":"darawk","id":14229252,"kids":[{"by":"RichardHeart","id":14229391,"kids":[{"by":"darawk","id":14229998,"parent":14229391,"text":"None of that is correct. &#x27;Series&#x27; or &#x27;parallel&#x27; are the wrong way to think about things. If you buy 100 shares of AAPL and then you buy a put on SPY, that position is objectively lower risk than the unhedged AAPL position. Your point about counterparties is irrelevant, as I didn&#x27;t claim that a hedge causes risk to go to zero - merely that it reduces it. It is possible for two risky things to cancel one another (or some components of one another, as in the AAPL&#x2F;SPY example, the SPY put hedges AAPL&#x27;s beta).","time":1493522170,"type":"comment"}],"parent":14229252,"text":"Nope. Depends on what kind of security you are looking for. Which door is more likely to reliably allow me to enter my home?  1. No door.  2. A door with N locks in parallel. 3. A door with N locks in series.  As N increases, or goes serial instead of parallel, my ability to enter my own home reliably decreases.  Consequently, assuming so side channel attacks (windows or other doors) the chance that other people can&#x27;t get in also increases.<p>Understanding that adding variables in serial in order to fuel your car reduces the chance you can successfully fuel your car is easy.  Understanding that when the internet goes down, you won&#x27;t get gas is easy to understand.<p>Hedges aren&#x27;t what they&#x27;re cracked up to be. 1. What happens when your hedge counterpart fails? (check out credit default swaps, or trades that can&#x27;t execute, or limit down markets, etc etc, bad oracles (credit rating agencies..))  All hedges require a counterparty.  Counterparties fail. Even when they don&#x27;t fail, they become corrupted by bad oracles.<p>You can&#x27;t create reliability by wiring variables in series. You can create &quot;security&quot; at the cost of reliablity. How much cash has been lost in &quot;smart&quot; contracts, vs stupid safes per capita.","time":1493508822,"type":"comment"},{"by":"golergka","id":14230756,"parent":14229252,"text":"&gt; A lock is a layer of abstraction on top of metal. That can increase security and reduce risk.<p>Metal door welded shut is more secure than a door closed with a metal lock. Harder to use though. But surely more secure.","time":1493543811,"type":"comment"}],"parent":14228829,"text":"&gt; 3. You can&#x27;t increase security or reduce risk, by layer abstractions on top of other things, in this case, the euro.<p>That is pretty demonstrably false. A lock is a layer of abstraction on top of metal. That can increase security and reduce risk.<p>More directly to your point, a set of investments that are, on their own, extremely risky can be set off against one another (i.e. hedged) in such a way as to make the whole far less risky. The idea that you cannot create a low-risk high security product on top of high-risk low-security substrates is simply false.","time":1493507046,"type":"comment"},{"deleted":true,"id":14228884,"parent":14228829,"time":1493501594,"type":"comment"},{"by":"erikpukinskis","id":14228934,"kids":[{"by":"dullgiulio","id":14230636,"parent":14228934,"text":"The DAO wasn&#x27;t a test, or at least the people involved in it didn&#x27;t realize it at the time.<p>And once again: the &quot;AI middleman&quot; mentioned above had very strong human opinions during &quot;The DAO&quot; debacle.","time":1493540189,"type":"comment"},{"dead":true,"deleted":true,"id":14230637,"parent":14228934,"time":1493540191,"type":"comment"}],"parent":14228829,"text":"Testing is the right place for millions to be accidentally lost.","time":1493502252,"type":"comment"}],"parent":14228717,"text":"1. They only accept euros. So you get to multiply the euro risk times the ethereum risk times their oracle keeping your balance on ethereum risk.<p>2. Ethereum has already human intervention rolled back millions of dollars of transactions in &quot;the dao&quot; and they chosen winning and losing implementations whenever there&#x27;s a network split due to their dual codebases trying to be bug for bug perfect in consensus.<p>3. You can&#x27;t increase security or reduce risk, by layer abstractions on top of other things, in this case, the euro.<p>Smart contracts should never be referred to as &quot;trivial&quot; for many the millions of dollars has been lost over bugs missed in testing.<p>Colored coins is what VISA already does really really well, with higher uptime, larger network effect, and hell even PCI DSS &quot;security&quot; standards.<p>I love crypto, especially when it makes things better, not worse.","time":1493500953,"type":"comment"},{"by":"TheSpiceIsLife","id":14228882,"kids":[{"by":"erikpukinskis","id":14228921,"parent":14228882,"text":"I probably wouldn&#x27;t need most or even many to use my currency. If I wanted a general purpose currency I&#x27;d use one of the extant ones.<p>You only need two users to have a healthy currency.","time":1493502051,"type":"comment"},{"by":"erikpukinskis","id":14228942,"parent":14228882,"text":"Cash value is not determined by the global market because the issuer can change the supply.","time":1493502315,"type":"comment"}],"parent":14228717,"text":"Imagine every service station across &lt;big continent&gt; now accepts Bitcoin or Ethereum. Ten years pass. Most vendors now have 10-ish year old Point Of Sales systems.<p>How are you going to convince everyone to upgrade their POS (either software upgrade or potentially requiring a hardware upgrade) to accept your newly forked cryptocurrency.<p>Generally speaking, the point of currency is to be able to exchange it for goods or services. That is the main <i>need</i> which people want their currency to <i>do</i>.<p>The value of cash is closely linked to the value of that denomination on the global market also, so I don&#x27;t believe cryptocurrency is any different in that respect.","time":1493501581,"type":"comment"}],"parent":14228641,"text":"Ethereum is an autonomous AI middleman, but yes it is a middleman. One whose plans and actions you can determine determinalistically.<p>&gt; Cash is King<p>The value of cash is subject to the whims of the issuer. The value of a cryptocurrency is subject to the whims of a global market.<p>They can also be trivially &quot;forked&quot; by creating colored coins which allow you to create a slightly different autonomous AI currency, if the mainline one doesn&#x27;t do what you need it to. This is the sense in which they are distributed. You can create a new autonomous authority for an arbitrarily small fee, from anywhere in the world.","time":1493499697,"type":"comment"},{"by":"onestone","id":14231385,"parent":14228641,"text":"&gt; Wasn&#x27;t Ethereum unusable for a a decent percentage of 2017 so far?<p>No. Ethereum suffered DoS attacks for a couple of months, but even during the worst of them it had significantly larger tx capacity than Bitcoin.","time":1493558610,"type":"comment"}],"parent":14228532,"text":"Wasn&#x27;t Ethereum unusable for a a decent percentage of 2017 so far? &quot; charging and billing solution with no middleman is created.”<p>The ethereum network is a middleman, that has fees and downtime, and the unknowable risk of future forks, downtime and client software choice incompatibilities.<p>This is their &quot;wallet&quot; <a href=\"https:&#x2F;&#x2F;shareandcharge.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;shareandcharge.com&#x2F;</a> which also, as for no other middleman free things, wants you to use the appstore or googleplay to use it.<p>&quot;“Tomorrow 100s of EV Charging Assets all over Germany Blockchainified. E2E Product using asset-backed Crypto-EURO for payments,” &quot;<p>Looks like the middlemen added to what could have easily been an interface like any other gas station are, unreliable Ethereum, unreliable appstore, playstore, and fiat currency, with trusting the accountant of that Currency to crypto gateway to maintain your balance.<p>This is not the distributed future. I&#x27;d prefer the charging station have a bill counter that I can feed cash into, that&#x27;s far less middlemen, far more reliable, and far more secure and anonymous.  Cash is king.  Also paying by btc instead of requiring an oracle to keep your balance would also be more reliable, and less risky.<p>Everyone long ETH though, you know what arrow to click.<p>Wouldn&#x27;t it be nice if charging your car didn&#x27;t require: 1. Smart phone. 2. Credits on an oracle. 3. Internet access. 4. Yet another account on yet another third party. 5. More loss of your personal driving and location habits to yet another place.","time":1493498653,"type":"comment"},{"by":"scott_ci","id":14228993,"kids":[{"by":"foepys","id":14230569,"kids":[{"by":"cashmonkey85","id":14230919,"parent":14230569,"text":"If Ethereum actually worked as an autonomy trustless network (which is what the project claimed to be) then there would be no middle man. But Ethereum is just vaperware and a marketing project","time":1493548378,"type":"comment"}],"parent":14228993,"text":"&gt; (no middle man)<p>Just because you cannot go to a miner&#x27;s office doesn&#x27;t mean that they aren&#x27;t a middle man. The illusion of direct payments is simply untrue and you need to trust that there will <i>never</i> be more nodes from people that want to fraud the whole system than there are trustworthy ones. You trust complete strangers with your money that you can never meet and never complain about. Worse, you can&#x27;t even sue them because they are most likely not in your jurisdiction and&#x2F;or anonymous.","time":1493538199,"type":"comment"},{"by":"sanswork","id":14229031,"kids":[{"by":"scott_ci","id":14229158,"parent":14229031,"text":"I imagine a marketplace with a ledger of electrons and money, with smart switches and meters that directly interact with this marketplace.<p>One interesting idea is having certain energy tagged as &quot;green&quot; energy, like wind generated, which some people might be willing to pay more for.<p>How do you prevent fraud (bypassing the meter) and who still pays to maintain the grid? Not sure. Is this really more efficient than a private &#x2F; gov run system? I don&#x27;t know. Blockchain interacting with real physical assets always seems murky to me.","time":1493505457,"type":"comment"},{"by":"bkanber","id":14230221,"kids":[{"by":"sanswork","id":14230230,"kids":[{"by":"davidgerard","id":14231090,"parent":14230230,"text":"There are none. The only practical example where a blockchain does things a centralised database doesn&#x27;t is a Bitcoin-style cryptocurrency.<p>(Even then, proof-of-work mining naturally recentralises, as we see with Bitcoin. Ethereum claims to be planning to move to proof-of-stake, but there&#x27;s no working implementation or date for this.)","time":1493552594,"type":"comment"}],"parent":14230221,"text":"Could you give me a practical example of how you would use one to solve this problem that couldn&#x27;t be just as easily solved without one?","time":1493528561,"type":"comment"}],"parent":14229031,"text":"From the wikipedia entry for &quot;blockchain&quot; [0]<p>&gt; Blockchains are &quot;an open, distributed ledger that can record transactions between two parties efficiently and in a verifiable and permanent way. The ledger itself can also be programmed to trigger transactions automatically.&quot;<p>Blockchains are exactly what they&#x27;re looking for, they solve the problem perfectly. By design, the blocks in a blockchain are a redundant, scalable, unhackable, cryptographically secure ledger transaction (in theory!).<p>From wikipedia again:<p>&gt; All blockchains are distributed ledgers but not all distributed ledgers are blockchains.<p>Ethereum is a blockchain implementation that has programmable contracts. If you&#x27;re designing a system like this, and need it to be out in the public and self-governing, it makes sense.<p>[0] <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Blockchain\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Blockchain</a>","time":1493528310,"type":"comment"}],"parent":14228993,"text":"How does a blockchain make that setup easier? You need to a system in place to track who is selling to who so if you have that it&#x27;s just as easy to have it do bank transfers as it is blockchain ones.<p>Do you also imagine there would be wires running between each set of properties?  If not you still need a third party to manage the centralized distribution network in which case you&#x27;re not going to sell directly to your neighbors you&#x27;re going to sell to the grid.","time":1493503595,"type":"comment"},{"by":"haddr","id":14229005,"kids":[{"by":"SirensOfTitan","id":14229035,"parent":14229005,"text":"Proof of stake (PoS) is certainly the future for consensus.  Ethereum has a built-in proof-of-work difficulty ramp up already started (a time bomb) and has had plans to move to PoS since the beginning.","time":1493503707,"type":"comment"},{"by":"skybrian","id":14229070,"kids":[{"by":"sanswork","id":14229107,"parent":14229070,"text":"Bitcoin miners fall behind the curve fast enough that if you aren&#x27;t running them full time with cheap electricity you are losing money.","time":1493504725,"type":"comment"}],"parent":14229005,"text":"I&#x27;m guessing there&#x27;s wasted electricity that solar panels generate at inconvenient times? If the power is &quot;free&quot; (not being used for anything else) at least they can mine Bitcoins.","time":1493504243,"type":"comment"},{"by":"scott_ci","id":14229023,"kids":[{"by":"SirensOfTitan","id":14229060,"kids":[{"by":"Moshe_Silnorin","id":14229605,"parent":14229060,"text":"Ethereum burns ~1 million dollars of electricity per day. But they seem to be on the way to moving to POS.","time":1493513004,"type":"comment"}],"parent":14229023,"text":"I find movement to PoS perhaps the most important milestone toward large scale adoption of Ethereum or any cryptocurrency-related technology.  PoW just isn&#x27;t feasible for large scale deployment: way too much energy is wasted for consensus.","time":1493504038,"type":"comment"}],"parent":14229005,"text":"the plan for ethereum is to switch to proof-of-stake, but that has definitely not been figured out yet. I could also see a more private blockchain supporting stuff like this. Maybe it&#x27;s not open to anonymous participants, but is still more distributed than a single company.","time":1493503448,"type":"comment"}],"parent":14228993,"text":"I wonder how they justify the use of proof of work to maintain consensus. Wouldn&#x27;t it consume a significant amount of the electricity generated by those solar panels?","time":1493503205,"type":"comment"}],"parent":14228532,"text":"There&#x27;s a recent podcast about this and blockchain + energy sector in general: <a href=\"https:&#x2F;&#x2F;epicenter.tv&#x2F;episode&#x2F;174&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;epicenter.tv&#x2F;episode&#x2F;174&#x2F;</a> Why blockchain? It enables peer-to-peer buying and selling of electricity (no middle man), which becomes more interesting as the grid itself is becoming more decentralized with solar, etc. Imagine being able to buy and sell electricity directly between you and your neighbors. Lots of questions about how this is metered &amp; controlled, but it seems promising.","time":1493502976,"type":"comment"},{"by":"chinathrow","id":14228794,"parent":14228532,"text":"&quot;Explaining why he is using a blockchain at all, Stöcker says because the “future of business will be fuelled by the #MachineEconomy … Machines – such as autonomous cars.”&quot;<p>So it&#x27;s just for PR. No reasonable explanation at all.","time":1493500569,"type":"comment"},{"by":"nnfy","id":14230177,"parent":14228532,"text":"Why do I feel like etherium is being crammed into all kinds of places where it really isn&#x27;t necessary, and offers little or no real benefit over conventional solutions? Perhaps I&#x27;m misunderstanding something here.<p>As an example in addition to this post, our petroleum company recently began a switch to an ETH based block chain for managing&#x2F;tracking inventory&#x2F;data samples. I don&#x27;t understand how hacking smart contracts together on a private ledger is not total overkill for such function.","time":1493526982,"type":"comment"},{"by":"jansan","id":14228707,"kids":[{"by":"Ursium","id":14229311,"kids":[{"by":"joosters","id":14230784,"parent":14229311,"text":"Will you campaign for a hard fork when your contract gets exploited again?","time":1493544660,"type":"comment"}],"parent":14228707,"text":"Stephan from Slock.it here. Essentially the idea is to recoup the cost of your investment in a charging station by renting it to other electric vehicle drivers that might be passing by. Can&#x27;t wait to be able to tell you more about it on our blog.","time":1493507740,"type":"comment"}],"parent":14228532,"text":"Thumbs up for the charging stations. But How does the customer benefit from the blockchain payment again?","time":1493499587,"type":"comment"},{"by":"contingencies","id":14229090,"parent":14228532,"text":"Recently I restarted thinking on IFEX[0], a generic transaction protocol for arbitrary assets&#x2F;settlement systems conceived in 2012 while building Kraken[1]. One of the four pilot use cases we are considering is energy routing within next-generation, renewables-focused, community-owned electricity and data infrastructure.[2] We are building an interesting team: one of the collaborators is a European inventor with significant experience in this area and some contact with major electric vehicle brands who would like a safe solution for rapid charging, another is a maths&#x2F;physics guy with nontrivial quantitative finance experience ($3bn+ under management). We also have conventional and distributed manufacturing and logistics as pilot use cases. If anyone would like to collaborate feel free to get in touch.<p>[0] <a href=\"http:&#x2F;&#x2F;www.ifex-project.org&#x2F;our-proposals&#x2F;ifex&#x2F;2012-04-11-partial-draft\" rel=\"nofollow\">http:&#x2F;&#x2F;www.ifex-project.org&#x2F;our-proposals&#x2F;ifex&#x2F;2012-04-11-pa...</a><p>[1] <a href=\"http:&#x2F;&#x2F;kraken.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;kraken.com&#x2F;</a><p>[2] <a href=\"http:&#x2F;&#x2F;fiberhood.nl&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;fiberhood.nl&#x2F;</a>","time":1493504500,"type":"comment"},{"by":"milansuk","id":14228800,"kids":[{"by":"iLoch","id":14228904,"kids":[{"by":"davidgerard","id":14229069,"kids":[{"deleted":true,"id":14229228,"parent":14229069,"time":1493506696,"type":"comment"}],"parent":14228904,"text":"You might be surprised how little research companies do before launching blockchain initiatives. <i>After</i> creating the Hyperledger consortium, IBM were <i>actually surprised</i> when it turned out business didn&#x27;t want to share all their dealings with all their competitors, but only with the specific other business each deal is with:<p><a href=\"https:&#x2F;&#x2F;lists.hyperledger.org&#x2F;pipermail&#x2F;hyperledger-requirements-wg&#x2F;2016-September&#x2F;000012.html\" rel=\"nofollow\">https:&#x2F;&#x2F;lists.hyperledger.org&#x2F;pipermail&#x2F;hyperledger-requirem...</a><p><a href=\"https:&#x2F;&#x2F;lists.hyperledger.org&#x2F;pipermail&#x2F;hyperledger-technical-discuss&#x2F;2016-September&#x2F;000391.html\" rel=\"nofollow\">https:&#x2F;&#x2F;lists.hyperledger.org&#x2F;pipermail&#x2F;hyperledger-technica...</a><p>The answer is, of course, that most &quot;blockchain initiatives&quot; are hypeware.","time":1493504194,"type":"comment"},{"by":"cashmonkey85","id":14230922,"parent":14228904,"text":"You sound like you are being sarcastic but Ethereum is a vaperware scam so yes they did not research the project.","time":1493548463,"type":"comment"}],"parent":14228800,"text":"No they probably didn&#x27;t do any research before launching this project.","time":1493501844,"type":"comment"},{"by":"DennisP","id":14228834,"parent":14228800,"text":"The clever way would be to use payment channels, then it&#x27;s instant and somewhat private.","time":1493501002,"type":"comment"},{"by":"solotronics","id":14228903,"parent":14228800,"text":"id I remember correctly the etherium blockchain adds a block every 10 seconds","time":1493501840,"type":"comment"}],"parent":14228532,"text":"Do they know that all transactions will be public and great resource for competitors?<p>Do they know that blockchain transactions need few confirmations to be trusted and mining takes time?","time":1493500630,"type":"comment"},{"by":"Ursium","id":14229263,"parent":14228532,"text":"Hi, Stephan from Slock.it here - there&#x27;s going to be a lot more info about this project coming up, but I wrote this blog post back in September when we entered live beta. I hope you find it helps answers some questions:<p><a href=\"https:&#x2F;&#x2F;blog.slock.it&#x2F;blockchain-energy-p2p-sharing-project-share-charge-going-into-live-beta-ad4e069e79d\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.slock.it&#x2F;blockchain-energy-p2p-sharing-project-...</a>","time":1493507226,"type":"comment"},{"by":"gcb0","id":14228648,"kids":[{"by":"Ursium","id":14229322,"kids":[{"by":"davidgerard","id":14231106,"parent":14229322,"text":"The DAO, right, but on the Internet of Things! I&#x27;m sure it will all be fine, fine.","time":1493552819,"type":"comment"}],"parent":14228648,"text":"I&#x27;m not yet allowed to give out numbers but it&#x27;s going to be the largest IoT + Blockchain deployment on the planet.<p>It&#x27;s early days, the tech is young, and we&#x27;re nowhere near &#x27;mainstream&#x27; yet but I&#x27;m excited we&#x27;re finally able to release real-life &#x27;dapps&#x27; to the general public so people can experience blockchain for themselves.","time":1493507847,"type":"comment"}],"parent":14228532,"text":"how big really is this project? sounds more like something thought up to an advertising agency.<p>bmw had tons of billboards advertising the i3 as a digital wallet in futuristic concept drawings. but again,  all the work of advertising agencies.","time":1493498738,"type":"comment"},{"by":"ralfd","id":14228719,"kids":[{"by":"davidiach","id":14228833,"parent":14228719,"text":"Yes it is. \nThere are actually many different cryptocurrencies (sometimes called altcoins) out there, here is a list of over 700:\n<a href=\"http:&#x2F;&#x2F;coinmarketcap.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;coinmarketcap.com&#x2F;</a><p>Ethereum is probably the second most important one after bitcoin.","time":1493500998,"type":"comment"},{"by":"Geee","id":14229317,"kids":[{"by":"davidgerard","id":14231111,"parent":14229317,"text":"&gt;  Ethereum is a decentralized platform that runs smart contracts: applications that run exactly as programmed without any possibility of downtime, censorship, fraud or third party interference.<p>Until the second the whales are in danger of losing money. <a href=\"https:&#x2F;&#x2F;davidgerard.co.uk&#x2F;blockchain&#x2F;the-dao&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;davidgerard.co.uk&#x2F;blockchain&#x2F;the-dao&#x2F;</a>","time":1493552880,"type":"comment"},{"by":"ubernostrum","id":14229694,"kids":[{"by":"woah","id":14229912,"parent":14229694,"text":":0","time":1493519766,"type":"comment"}],"parent":14229317,"text":"Contracts that run exactly as programmed <i>unless 51% of the network decides they don&#x27;t</i>.","time":1493515271,"type":"comment"},{"by":"wyldfire","id":14230058,"parent":14229317,"text":"Isn&#x27;t &quot;decentralized&quot; a stretch?","time":1493523613,"type":"comment"}],"parent":14228719,"text":"Ethereum is a  decentralized platform that runs smart contracts: applications that run exactly as programmed without any possibility of downtime, censorship, fraud or third party interference.<p>It is also a valuable cryptocurrency which is used as the payment to run code on the network.","time":1493507806,"type":"comment"},{"by":"davidgerard","id":14229087,"kids":[{"by":"RichardHeart","id":14229204,"parent":14229087,"text":"Love the links!","time":1493506296,"type":"comment"}],"parent":14228719,"text":"A cryptocurrency with Smart Contracts. Works a bit like this:<p><a href=\"https:&#x2F;&#x2F;davidgerard.co.uk&#x2F;blockchain&#x2F;ethereum-smart-contracts-in-practice&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;davidgerard.co.uk&#x2F;blockchain&#x2F;ethereum-smart-contract...</a><p><a href=\"https:&#x2F;&#x2F;davidgerard.co.uk&#x2F;blockchain&#x2F;the-dao&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;davidgerard.co.uk&#x2F;blockchain&#x2F;the-dao&#x2F;</a>","time":1493504469,"type":"comment"},{"by":"DennisP","id":14228821,"parent":14228719,"text":"Similar, with much more powerful scripting.","time":1493500846,"type":"comment"}],"parent":14228532,"text":"What is Ethereum? Something like Bitcoin?","time":1493499711,"type":"comment"},{"by":"andrejc","id":14230938,"kids":[{"by":"Ursium","id":14231131,"parent":14230938,"text":"Ah yes, what you describe is what Christoph Jentzsch dubbed the Universal Sharing Network, or USN. Slock.it [recent round of seed funding](<a href=\"https:&#x2F;&#x2F;blog.slock.it&#x2F;slock-it-secures-2-million-usd-seed-funding-to-build-next-generation-sharing-economy-platform-b795c6d1a92d\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.slock.it&#x2F;slock-it-secures-2-million-usd-seed-fu...</a>) is dedicated to its development. We&#x27;re really lucky to have some amazing partners such as [Canonical](<a href=\"https:&#x2F;&#x2F;www.canonical.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.canonical.com&#x2F;</a>) to help bring this to life.<p>We expect the first integrations to make their way to the general public during the course of 2018, with some private betas kicking off Q3-Q4 this year.","time":1493553155,"type":"comment"}],"parent":14228532,"text":"Could someone not build something similar, but for WiFi routers instead of charging stations?. I.e. a company selling or renting pre-programmed WiFi routers that sell bandwidth directly to the users. Anyone could buy or rent one and put it inside their private space that is within a public zone (e.g. cafes and restaurants). Thoughts?","time":1493548766,"type":"comment"},{"by":"xyproto","id":14228726,"kids":[{"by":"DennisP","id":14228813,"kids":[{"by":"RichardHeart","id":14228872,"kids":[{"by":"davidgerard","id":14229099,"parent":14228872,"text":"It&#x27;s also worth noting the quality of the thinkers at work on it:<p><a href=\"https:&#x2F;&#x2F;davidgerard.co.uk&#x2F;blockchain&#x2F;buterins-quantum-quest&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;davidgerard.co.uk&#x2F;blockchain&#x2F;buterins-quantum-quest&#x2F;</a>","time":1493504598,"type":"comment"}],"parent":14228813,"text":"The multiple implementations exponentially increase the breakdown of consensus. The network is literally unusable often. Their consensus is so bad, that the last breakdown of consensus created the nunber 6 crypto marketcap &quot;currency&quot; &quot;etherum classic&quot; which has &quot;value&quot; of $485 million as this is written.<p>It has no high fees, for there is no demand for what it does, and if there was demand, no limit to the supply to fill it.  Have they decided how much &quot;gas&quot; it takes to run things yet, or are they still manually humanly moving that number around, you know, the only number that would give an ETH any scarcity and thus upward price potential?<p>NASA knows how to build software that is unlikely to fail, and saves or costs human lives.  Little to none of the lessons NASA has learned regarding mission critical software development is used by Ethereum. Being turning complete is the enemy of consensus. The halting problem pretty much makes writing smart contracts that do what you want and nothing else in a turing complete language extremely difficult to the point of near impossiblity.<p>Thus, ETH may some day be useful for something, but making ETH tokens valuable isn&#x27;t one of those things.","time":1493501477,"type":"comment"},{"by":"cashmonkey85","id":14230930,"kids":[{"by":"DennisP","id":14231128,"kids":[{"by":"davidgerard","id":14237274,"kids":[{"by":"DennisP","id":14243575,"parent":14237274,"text":"I&#x27;m not getting funded to build Ethereum, I&#x27;m using Ethereum as a working technology stack. People pay me to build and deploy other projects on top of it, and some of the projects I&#x27;ve built are also in production.","time":1493693055,"type":"comment"}],"parent":14231128,"text":"VCs fund vaporware all the time - the track record of blockchain investments is about $1.5 billion in, $0 out, per <a href=\"http:&#x2F;&#x2F;www.coindesk.com&#x2F;bitcoin-venture-capital&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.coindesk.com&#x2F;bitcoin-venture-capital&#x2F;</a> - so this is hardly an implausible statement.","time":1493645104,"type":"comment"},{"by":"cashmonkey85","id":14232343,"kids":[{"by":"DennisP","id":14233180,"parent":14232343,"text":"There&#x27;s a thriving ecosystem of startups, a fair amount of corporate interest, and a shortage of people good at writing smart contracts. I work for a company that provides dev and security auditing, mostly for startups, and business is good.","time":1493578165,"type":"comment"}],"parent":14231128,"text":"I&#x27;m curious where? Someone actually pays you to do this?","time":1493570193,"type":"comment"}],"parent":14230930,"text":"Then I make my living on vaporware. My full-time job is writing smart contracts for Ethereum.","time":1493553085,"type":"comment"}],"parent":14228813,"text":"...and it&#x27;s a vaperware scam. Their technology just doesn&#x27;t add up. No way it does what is claims.","time":1493548581,"type":"comment"}],"parent":14228726,"text":"It has the second-biggest market cap at $6 billion, it&#x27;s been in production for a couple years, it has multiple open source implementations, its inventors and other developers are known to the public, it has much more powerful smart contract capabilities than Bitcoin, and it doesn&#x27;t have high fees and backlogs.","time":1493500759,"type":"comment"},{"by":"y2gray","id":14229877,"kids":[{"by":"DennisP","id":14229946,"parent":14229877,"text":"They did code that project, but it&#x27;s also worth pointing out that the exploit in question wasn&#x27;t widely known in the community until a week prior to the hack, when TheDAO was already live. Even some of the official tutorial material on the ethereum.org website had similar vulnerabilities.","time":1493520782,"type":"comment"}],"parent":14228726,"text":"i think its worth pointing out that the same company is behind this charging station project -- slock.it -- was also behind the dao disaster, they coded the smart contract that had the bug that was exploited and led to the hack of tens of millions of invested dollars and the biggest controversy in the history of ethereum. which sadly led to this guy Stephan Tual (ursium) --who is commenting on this thread about how excited he is for his revolutionary project -- basically resorting to conspiracy theory to deflect responsibility for his company&#x27;s lack of due diligence and false claims such as code audits for the contract. ethereum is a very interesting project but this guy is a snake.","time":1493519033,"type":"comment"}],"parent":14228532,"text":"I don&#x27;t trust Ethereum. Who&#x27;s behind it? Are there any backdoors? Why not Bitcoin?","time":1493499786,"type":"comment"},{"by":"red023","id":14229653,"parent":14228532,"text":"RWE (well like pretty much every big cooperation) is very corrupt and immoral. They for example fought hard against Germany&#x27;s plans to end Atom Power plants. So I am not really to happy about this news. They are in for the money thats it.","time":1493514222,"type":"comment"}],"id":14228532,"score":138,"url":"http://www.trustnodes.com/2017/04/29/germanys-energy-giant-launches-100s-ethereum-based-electric-cars-charging-stations","by":"campbelltown"},"14227885":{"by":"mpweiher","descendants":0,"id":14227885,"score":2,"time":1493490002,"title":"Rob Pike – 'Concurrency Is Not Parallelism' (2013)","type":"story","url":"https://www.youtube.com/watch?v=cN_DpYBzKso"},"14228371":{"time":1493495496,"type":"story","descendants":1,"title":"The End of the NSA's ‘About’ Searches Is Just the Beginning","kids":[{"by":"Neliquat","id":14229388,"parent":14228371,"text":"&#x27;&#x27;NSA does not have the ability at this time to stop collecting ‘about’ information without losing some other important data&#x27;&#x27;<p>Uh huh.","time":1493508794,"type":"comment"}],"id":14228371,"score":2,"url":"https://www.eff.org/deeplinks/2017/04/end-nsas-about-searches-just-beginning","by":"DiabloD3"},"14228454":{"time":1493496326,"type":"story","descendants":10,"title":"Is Memory Mapped File This Fast in Java?","kids":[{"by":"ro_sharp","id":14231118,"parent":14228454,"text":"Memory mapped files are great fun in C, but Java can&#x27;t safely unmap files! Refer to this bug that&#x27;s been open since 2002: <a href=\"http:&#x2F;&#x2F;bugs.java.com&#x2F;view_bug.do?bug_id=4724038\" rel=\"nofollow\">http:&#x2F;&#x2F;bugs.java.com&#x2F;view_bug.do?bug_id=4724038</a><p>Quote (December 2016): &quot;I have a plan to implement this, but it requires changes to the Java Memory Model and to the compilers.  I didn&#x27;t get it done in time for JDK 9 because of being distracted by a ton of other things, but I hope I&#x27;ll get it done by JDK 10.&quot;","time":1493552931,"type":"comment"},{"by":"tomfitz","id":14234308,"parent":14228454,"text":"If you find ByteBuffer&#x27;s API awkward&#x2F;insufficient, you might want to consider one of the replacements:<p>* Netty&#x27;s: <a href=\"https:&#x2F;&#x2F;netty.io&#x2F;4.0&#x2F;api&#x2F;io&#x2F;netty&#x2F;buffer&#x2F;ByteBuf.html\" rel=\"nofollow\">https:&#x2F;&#x2F;netty.io&#x2F;4.0&#x2F;api&#x2F;io&#x2F;netty&#x2F;buffer&#x2F;ByteBuf.html</a> as used by Netty<p>* Agrona&#x27;s, as used by Aeron and SBE: <a href=\"http:&#x2F;&#x2F;insightfullogic.com&#x2F;2015&#x2F;Apr&#x2F;18&#x2F;agronas-threadsafe-offheap-buffers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;insightfullogic.com&#x2F;2015&#x2F;Apr&#x2F;18&#x2F;agronas-threadsafe-of...</a>","time":1493592572,"type":"comment"},{"by":"RandyRanderson","id":14231457,"parent":14228454,"text":"You should never read() one byte at a time unless you like waiting. The C idiom is still true for Java:<p>byte[] buf=new byte[4096]; &#x2F;&#x2F; this matters<p>while(true) {<p><pre><code>  int num=in.read(buf,0,buf.length);\n\n  ...\n</code></pre>\n}<p>Also MemMapped files in Java have an int index so you can&#x27;t really use them for large files without using another method as well.<p>Finally typically one has to parse the files to a string of a certain charset. This poses still more issues in terms of how you read files; esp multi and variable byte charsets.","time":1493559906,"type":"comment"},{"by":"i336_","id":14230657,"kids":[{"by":"elFarto","id":14231143,"kids":[{"by":"i336_","id":14231465,"parent":14231143,"text":"Thanks.","time":1493560072,"type":"comment"}],"parent":14230657,"text":"I was slightly confused by the claim of the article saying:<p>&quot;Memory mapped files are new feature in Java nio package&quot;<p>They were introduced in Java 1.4, 15 years ago.","time":1493553476,"type":"comment"},{"by":"fulafel","id":14230791,"kids":[{"by":"i336_","id":14231461,"kids":[{"by":"fulafel","id":14237494,"kids":[{"by":"i336_","id":14238117,"parent":14237494,"text":"&gt; <i>(i tried to type &quot;segfault&quot; instead of &quot;default&quot; before autocorrect mangled it).</i><p>(Ah. If only the dictionaries were bigger..... sigh)<p>&gt; <i>The most common signals you get in this situation are SIGSEGV and SIGBUS. AFAIK you can&#x27;t catch it in Java.</i><p>I just had a look around, and it seems you&#x27;re unfortunately right.<p>- <a href=\"http:&#x2F;&#x2F;stackoverflow.com&#x2F;questions&#x2F;39183517&#x2F;java-8-application-using-all-of-system-ram-and-then-crashing-with-a-sigbus-what\" rel=\"nofollow\">http:&#x2F;&#x2F;stackoverflow.com&#x2F;questions&#x2F;39183517&#x2F;java-8-applicati...</a><p>- <a href=\"https:&#x2F;&#x2F;forums.macrumors.com&#x2F;threads&#x2F;java-catching-stack-overflow-sigbus-error.99812&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;forums.macrumors.com&#x2F;threads&#x2F;java-catching-stack-ove...</a><p>- Apple appears to have taken responsibility for one, but I don&#x27;t think mmap was involved: <a href=\"https:&#x2F;&#x2F;lists.apple.com&#x2F;archives&#x2F;java-dev&#x2F;2002&#x2F;Aug&#x2F;msg00129.html\" rel=\"nofollow\">https:&#x2F;&#x2F;lists.apple.com&#x2F;archives&#x2F;java-dev&#x2F;2002&#x2F;Aug&#x2F;msg00129....</a> (found in the above link)<p>It kind of makes sense, the JVM pretends it&#x27;s the &quot;world&quot;, so something platform-specific affecting that world is generally going to be treated as a literal end-of-the-world (pun genuinely not intended... lol).<p>But then there&#x27;s JNI. So Java does acknowledge that the OS is kind of there. And not all signals are fatal! This is mildly stupid.<p>&gt; <i>You can get these errors in circumstances that don&#x27;t involve physical IO device errors, you can also get them in cases where the OS decides you can&#x27;t get to that file (eg another process truncates it, or you run out of space writing to a sparse file, etc).</i><p>Oooh, riiight. Because you&#x27;re not doing read()&#x2F;write() I&#x2F;O and mmap() is memory-centric, the kernel treats failures as memory errors. Makes a lot of sense!!<p>&gt; <i>By proper use of read() i meant being performance conscious. read() will usually have to copy the data into your buffer, whereas mmap() can just give you a virtual-memory assisted view of the kernel buffer cache. To eliminate this as a source of slowdown, you should size the read buffer so that it fits in CPU cache but still results enough work per read() call that the system call overhead doesn&#x27;t get you. Around 128k is often close to the sweet spot.</i><p><i>Oh, it&#x27;s because of cache consistency! I get it now!</i><p>I remember reading an article on here very recently about exactly this, but I can&#x27;t remember any terms it had in it so I can&#x27;t find it :(","time":1493651474,"type":"comment"}],"parent":14231461,"text":"(i tried to type &quot;segfault&quot; instead of &quot;default&quot; before autocorrect mangled it).<p>The most common signals you get in this situation are SIGSEGV and SIGBUS. AFAIK you can&#x27;t catch it in Java.<p>You can get these errors in circumstances that don&#x27;t involve physical IO device errors, you can also get them in cases where the OS decides you can&#x27;t get to that file (eg another process truncates it, or you run out of space writing to a sparse file, etc).<p>By proper use of read() i meant being performance conscious. read() will usually have to copy the data into your buffer, whereas mmap() can just give you a virtual-memory assisted view of the kernel buffer cache. To eliminate this as a source of slowdown, you should size the read buffer so that it fits in CPU cache but still results enough work per read() call that the system call overhead doesn&#x27;t get you. Around 128k is often close to the sweet spot.","time":1493647432,"type":"comment"}],"parent":14230791,"text":"Is this a POSIX signal? How easy is it to handle from Java?<p>Also, I&#x27;m genuinely curious about what you mean by &quot;properly used read()&quot;. Could you give an example?","time":1493560022,"type":"comment"}],"parent":14230657,"text":"map is worse if you get I&#x2F;o errors: you will get a default or other fatal signal. It is also often slower than properly used read().","time":1493544995,"type":"comment"}],"parent":14228454,"text":"When was MappedByteBuffer introduced in Java?<p>Furthermore, in what situations is mmap() (or MappedByteBuffer, if the situation is Java-specific) worse than read() et al?<p>I ask because Java is on my &quot;I should probably know at least a little bit&quot; list and I&#x27;m interested to pick up all the tidbits and tricks that I can - and this article screams &quot;just use MappedByteBuffer everywhere you need I&#x2F;O!&quot;, so I want to know if there are any exceptions.","time":1493540782,"type":"comment"}],"id":14228454,"score":19,"url":"http://sherxon.com/blog/fastest-io-in-java","by":"Tulik"},"14228054":{"by":"sndean","descendants":0,"id":14228054,"score":3,"time":1493491581,"title":"Where Europe lives, in 14 lines of R code","type":"story","url":"http://blog.revolutionanalytics.com/2017/04/where-europe-lives.html"},"14228197":{"by":"sndean","descendants":0,"id":14228197,"score":2,"time":1493493244,"title":"Investigate Uber for phone tracking, consumer group tells FTC","type":"story","url":"https://www.cnet.com/news/uber-privacy-phone-tracking-consumer-watchdog-ftc/"},"14228811":{"by":"sndean","descendants":0,"id":14228811,"score":1,"time":1493500734,"title":"Funky Hand Jive","type":"story","url":"http://www.radiolab.org/story/funky-hand-jive/"},"14227892":{"time":1493490085,"type":"story","descendants":43,"title":"ZetaVM, my new compiler project","kids":[{"by":"grashalm01","id":14229215,"kids":[{"by":"DonbunEf7","id":14229472,"parent":14229215,"text":"I wonder whether a &quot;bridge-across-the-void&quot; approach would work. The idea is that a speculative optimization would not discard its original form, so that deoptimization is as cheap as a rollback. Then, when speculative optimizations are performed, they form a kind of bridging branching structure which reaches across the void of invalid low-level IRs, trying to find a safe point at which the optimization can complete.<p>I know that Truffle is based on partial evaluation; how close are you to Futamura #2? That&#x27;d relieve you of the burden of having to care about what an &quot;interpreter stack frame&quot; even looks like. OTOH I can confirm that the same kind of speculation in optimization has to occur during self-application.<p>It really is a thorny problem, isn&#x27;t it?","time":1493510436,"type":"comment"},{"by":"mpweiher","id":14230572,"kids":[{"by":"chrisseaton","id":14231006,"kids":[{"by":"mpweiher","id":14231771,"kids":[{"by":"chrisseaton","id":14231952,"kids":[{"by":"mpweiher","id":14232263,"kids":[{"by":"chrisseaton","id":14232314,"kids":[{"by":"mpweiher","id":14232574,"parent":14232314,"text":"&gt; you don&#x27;t need speculative optimisations to make something like Objective C fast.<p>There is a difference between &quot;make X fast&quot; and &quot;write fast code in X&quot;, a distinction that is hugely important in practice.<p>So no, I don&#x27;t need speculative optimization to write fast code in Objectice-C, but I would need speculative optimization to make Objective-C code fast [without touching the Objective-C source code].<p>&gt; But you say to do that you don&#x27;t use the dynamic features where you need performance<p>No, I did not say that at all.  I said I mix dynamic features and non-dynamic features where necessary, and that I need both to make things fast.  And (more importantly), that the most important optimizations have nothing to do with either (which counters the assertion that inlining is &quot;the mother of all optimizations&quot;).<p>&gt; So yes you don&#x27;t need speculative optimisations... as long as you apply similar optimisations manually in the source code yourself.<p>The point being that (a) those optimizations are such a small part of the overall optimization process, which in turn is applied to such a tiny part of the overall code-base, that automation is not needed.  Which invalidates the assertion that these optimizations are &quot;necessary&quot;.  Nice to have?  Yes.  Necessary?  No.<p>The other point (b) is that optimizations by the compiler&#x2F;JIT aren&#x27;t as good as those applied manually for many reasons, one being that the compiler&#x2F;JIT has to make the transformations indistinguishable at a fairly low-level, whereas the author has a higher-level overview and can adjust the semantics to fit.  So doing it manually is also worth it.<p>The third point is that I cannot rely on the compiler&#x2F;JIT making those optimizations, there is no guarantee that they will be applied.  And with today&#x27;s performance landscape being what it is, reliability is paramount, meaning that being able to guarantee even a slightly higher bound is more important than meeting a lower bound some of the time or even on average.<p>&gt;  I&#x27;m not convinced therefore :)<p>As long as I am <i>capable</i> of applying those optimizations manually, I have made my original point which is that having these optimizations done automatically is not necessary for performance, but at best &quot;nice to have&quot;.  Which doesn&#x27;t mean that more compiler support wouldn&#x27;t be nice, the process in Objective-C is too ad-hoc.","time":1493572186,"type":"comment"}],"parent":14232263,"text":"But going back to the original argument that was being made - you say that you don&#x27;t need speculative optimisations to make something like Objective C fast. But you say to do that you don&#x27;t use the dynamic features where you need performance - use macros and C functions instead.<p>So yes you don&#x27;t need speculative optimisations... as long as you apply similar optimisations manually in the source code yourself. I&#x27;m not convinced therefore :)","time":1493569825,"type":"comment"}],"parent":14231952,"text":"&gt; How do you think Objective C would perform if every operator was a dynamic method call as it is in Ruby?<p>Depends very much on what you mean with &quot;every&quot;:  the 97:3 rule applies, and is almost certainly even more highly skewed today[1].  So for the vast majority of code, it wouldn&#x27;t matter.  Correction: <i>doesn&#x27;t</i> matter.  For example, Apple&#x27;s Swift language produces code that is incredibly slow when non-optimized, loops and the like can easily be 1000x (a thousand times!) slower than optimized, and yet Xcode&#x27;s debug builds default to non-optimized and people don&#x27;t report that their debug builds are unusable.<p>Another example:  I implemented the central re-pagination loop in my BookLightning imposition app[2] in my Objective-Smalltalk language[3], which currently has just about the slowest implementation imaginable (an AST-walker inefficiently implemented in Objective-C), at least an order of magnitude slower than Ruby.  Despite that, BookLightning is at least an order of magnitude faster than the OS-X print system, which is largely written in C. Why?  It computes by page (which is sufficient for this task), rather than by individual PDF graphical element. That difference is so great that the steering code controlling the computation just doesn&#x27;t matter.<p>&gt; Surely then you&#x27;d start to get frustrated with the overhead?<p>As long as Objective-C were still a hybrid language: probably not, because I could always eliminate the overhead in the (very) few places that mattered, and could do so reliably&#x2F;predictably [4].  In fact, for Objective-Smalltalk I am very much leaning towards that approach (Smalltalk-ish by default, optimizations optional), and so far things are looking good.<p>&gt; That&#x27;s why languages like Ruby need the speculative optimisations.<p>Or C libraries, which is what I believe high performance Ruby code does.<p>p.s.:  I think Truffle and Graal are awesome, and as a researcher I wish I&#x27;d come up with them.  When doing actual practical performance work, I prefer simpler and more predictable tech.<p>[1] &quot;The Death of Optimizing Compilers&quot; <a href=\"http:&#x2F;&#x2F;cr.yp.to&#x2F;talks&#x2F;2015%2E04%2E16&#x2F;slides-djb-20150416-a4.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;cr.yp.to&#x2F;talks&#x2F;2015%2E04%2E16&#x2F;slides-djb-20150416-a4....</a><p>[2] <a href=\"http:&#x2F;&#x2F;www.metaobject.com&#x2F;Products&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.metaobject.com&#x2F;Products&#x2F;</a><p>[3] <a href=\"http:&#x2F;&#x2F;objective.st&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;objective.st&#x2F;</a><p>[4] <a href=\"http:&#x2F;&#x2F;blog.metaobject.com&#x2F;2015&#x2F;10&#x2F;jitterdammerung.html\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.metaobject.com&#x2F;2015&#x2F;10&#x2F;jitterdammerung.html</a>","time":1493569309,"type":"comment"}],"parent":14231771,"text":"Thanks for that extra info.<p>How do you think Objective C would perform if every operator was a dynamic method call as it is in Ruby? Surely then you&#x27;d start to get frustrated with the overhead? That&#x27;s why languages like Ruby need the speculative optimisations.","time":1493565728,"type":"comment"}],"parent":14231006,"text":"&gt; I don&#x27;t have any numbers<p>I do :-)  Wrote about a book about it, in fact.<p>&gt; but I think it&#x27;s generally possible to write very high performance code in Objective C... by not using the dynamic language features of it such as message sends.<p>Yes, that&#x27;s a common misconception...with a grain of truth.  In my experience, you get the best performance by judiciously mixing dynamic and static features.  And yes, that means eschewing some dynamic features in some inner loops (The 97:3 rule applies).  However, you can also often gain significant performance by hiding behind a polymorphic dispatch.<p>For example, I reimplemented Apple&#x27;s binary plist parsers+generators in Objective-C (from C) for a significant speed boost:  the polymorphic implementation allowed me to put in override points for things such as lazy loading, and interface-based (de-)serialization removes the need for a generic intermediate representation.  Compared to those advantages, the cost of message-sends is negligible (and optimizable if it becomes a problem).<p>&gt; Objective C I believe does a globally cached method lookup for every message send(!)<p>Yes.  It&#x27;s quite fast and despite what people fret about rarely a problem.<p>&gt; and so can&#x27;t inline through message sends (!),<p>If it does become a problem (measure, measure, measure!), there are techniques to avoid the lookup:  IMP-cache, convert to C function call, convert to inline function, convert to Macro.<p>&gt; since inlining is the mother of all optimisations<p>Hmm...the mother of all optimizations is measuring and removing unnecessary code.  Then comes eliminating&#x2F;reducing and &quot;sequentializing&quot; memory access.<p>Very few of these can be automated.<p>Inlining is nice, too.","time":1493563800,"type":"comment"}],"parent":14230572,"text":"I don&#x27;t have any numbers, but I think it&#x27;s generally possible to write very high performance code in Objective C... by not using the dynamic language features of it such as message sends.<p>Objective C  I believe does a globally cached method lookup for every message send (!) and so can&#x27;t inline through message sends (!), and since inlining is the mother of all optimisations I would imagine this would severely limit performance if you tried to use a lot of message sends in your inner loops. We should actually think about doing that experiment to see what the cost would be.<p>In a language like Ruby almost all operators, even basic arithmetic, are dynamic method calls, so you can&#x27;t avoid using message sends anywhere. I think if you tried to do that in Objective C things might grind to a halt.<p>Objective C also lacks many dynamic language features which are the ones solved through speculative optimisation, such as integer overflow, access to frames as objects, and so on.<p>I&#x27;m not an expert on Object C though so happy to be corrected.","time":1493550749,"type":"comment"}],"parent":14229215,"text":"&gt; essential for high performance dynamic language implementations<p>Is it?  Objective-C is a dynamic language (AOT-compiled) that doesn&#x27;t have these features, and it is possible to write very high performance code with it.","time":1493538277,"type":"comment"},{"by":"tachyonbeam","id":14229290,"parent":14229215,"text":"The interpreter I&#x27;m building right now will essentially be a JIT, but it will JIT to an internal IR instead of machine code. My plan is to eventually have it operate on compact and optimized stack frames as native code would.","time":1493507541,"type":"comment"}],"parent":14227892,"text":"Your mission seems to be matching with what we are trying with Graal and Truffle. The Truffle API aims to be stable as well. We also provide basic building blocks like an object model. I am curious how you plan to support speculative optimizations that need to deoptimize and reconstruct interpreter stack frames? In my experience that&#x27;s essential for building high performance dynamic language implementations.","time":1493506443,"type":"comment"},{"by":"msangi","id":14229674,"kids":[{"by":"Johnny_Brahms","id":14231330,"parent":14229674,"text":"I have been playing with toy languages for the guile VM, and you can do quite a lot of things before the VM limits you much.<p>With some exceptions though: Java VM  does not support tail call optimization, which limits how you implement loop constructs.","time":1493557457,"type":"comment"}],"parent":14227892,"text":"I&#x27;m wondering how different languages implemented on top of this VM could be, especially at the semantic level.<p>Having different syntaxes on top of the same VM is nice and all the JVM languages show that there is room for a good variety and for different paradigms.<p>On the other hand, the choice of a VM sets some constraints while providing important features. Think for instance at the differences between the languages running on the JVM and the languages running on the BEAM (Erlang&#x27;s VM).<p>I think there is a lot of untapped potential for innovative ideas at the VM-level but for some reason most of the effort goes into proposing new syntaxes that reuse the same concepts all the other languages are using.","time":1493514687,"type":"comment"},{"by":"marktangotango","id":14228771,"kids":[{"by":"tachyonbeam","id":14228808,"kids":[{"by":"akkartik","id":14229037,"kids":[{"by":"tachyonbeam","id":14229111,"kids":[{"by":"akkartik","id":14229140,"kids":[{"by":"tachyonbeam","id":14229167,"parent":14229140,"text":"&gt; How would you keep people from creating new libraries in your language for unanticipated use cases? Say a self-driving car library, or a command-and-control module for all the IoT devices in a house from 2029?<p>I can&#x27;t prevent people from doing that. I can only put together the conditions to make it easy to write software that doesn&#x27;t break, as much as possible.<p>&gt; It seems to me that bitrot is fundamentally a result of change in the outside world.<p>Yes and no. On the one hand, some breakage is inevitable with changing conditions. On the other hand, the computers we have now provide the same basic facilities as computers did in 1969. It ought to be able to provide some stable building blocks, and hope that people will use them.<p>Currently, it seems to me that software breaks all the time, at a rate that is unacceptably high.","time":1493505627,"type":"comment"},{"by":"sitkack","id":14232874,"kids":[{"by":"akkartik","id":14232925,"kids":[{"by":"sitkack","id":14235642,"kids":[{"by":"akkartik","id":14235947,"parent":14235642,"text":"Fascinating! Seems to have some commonality with dependency injection, which is one of my interests (<a href=\"https:&#x2F;&#x2F;github.com&#x2F;akkartik&#x2F;mu#readme\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;akkartik&#x2F;mu#readme</a>)<p>Can you point me at any Lua docs where I can read more about overriding IO in Lua?","time":1493620216,"type":"comment"}],"parent":14232925,"text":"Lua is under-coupled with the base system. For the longest time it wouldn&#x27;t even support dynamically loaded modules because it wasn&#x27;t portable. It wasn&#x27;t part of C89.<p>So when one uses Lua, it is up to the user to supply IO. This  threading through the needle or hour-glass allows the users (embedder) to define how the scripts interact with the base system. This makes them more resilient over time, the interactions are better specified and highly mediated.<p>Somewhat analogous to the library vs framework dichotomy. Libraries survive better than frameworks do.","time":1493614301,"type":"comment"}],"parent":14232874,"text":"Interesting. Can you show an example of how Lua&#x27;s interface to the underlying platform improves on Python? Doesn&#x27;t replacing APIs with protocols merely shift the breakage to higher-level logical errors rather than lower-level mechanical ones?","time":1493575516,"type":"comment"}],"parent":14229140,"text":"I have come to the same conclusion as tachyonbeam, it is interaction with the outside world that causes bitrot. Rather than have APIs, we need communication protocol with simple semantics. The VM should interact over a constrained, well defined protocol, that protocol could implement a POSIX io model, but that would be up to the client to offer that abstraction over messages.<p>The surface area of POSIX is too high to build systems that can run for 10s or hundreds of years. Look at the design of Lua over Python. The assumptions it makes of the underlying platform are much much cleaner, thus it is more portable and easier to debug platform issues.","time":1493575037,"type":"comment"}],"parent":14229111,"text":"I think I see what you mean. However, all these previous languages would claim that the parts they control have not suffered from bitrot. The dependencies you&#x27;re thinking of are not considered part of the language in each case. Is that right? How would you keep people from creating new libraries in your language for unanticipated use cases? Say a self-driving car library, or a command-and-control module for all the IoT devices in a house from 2029?<p>It seems to me that bitrot is fundamentally a result of change in the outside world. The only way to opt out of bitrot when the world changes rapidly seems to be to disengage from the world and become irrelevant. I&#x27;m fairly certain Mu will not suffer from bitrot in 30 years -- but it&#x27;ll only be because nobody ever built anything with it :)","time":1493505197,"type":"comment"},{"by":"jerrysievert","id":14229781,"parent":14229111,"text":"having fairly recently redeployed a MUD I worked on in the early 90&#x27;s (telnet mud.legitimatesounding.com 4000 - <a href=\"https:&#x2F;&#x2F;github.com&#x2F;JerrySievert&#x2F;SillyMUD\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;JerrySievert&#x2F;SillyMUD</a>), I can&#x27;t agree more.<p>I spent many hours fixing compile issues, memory problems that should have taken it down in the early 90&#x27;s but didn&#x27;t seem to matter at the time, and moving it to a modern socket API.  I was quite surprised how much things had changed in 25 years.","time":1493517351,"type":"comment"}],"parent":14229037,"text":"C has been fairly stable across time, but you gave to admit, a C program from 1992 still compiling as-is, that&#x27;s an exception rather than the rule. The reason Vim from 1992 might still compile is actually because it doesn&#x27;t have that much dependencies apart from standard C and POSIX APIs.<p>JavaScript has massive bitrot issues. The HTML DOM is huge and constantly changing. I have had my own web apps break multiple times over the years. As for Python and C, if you stick to the core language, and minimize dependencies, you might be Ok. The problem is that the more dependencies you have, if any one of them break, they can render your program broken... And if you&#x27;re not there to fix it, your program remains broken forever.<p>My argument for reducing API surface and keeping APIs low-level and minimalist is that the smaller an API, the more difficult it is to implement it wrong. It&#x27;s easier for two implementations to implement a smaller API and have the same behavior. It&#x27;s also easier to test small APIs for conformance, etc.","time":1493504779,"type":"comment"}],"parent":14228808,"text":"Hmm, I haven&#x27;t heard this idea before that the FFI or surface area of libraries in a language causes bitrot. Could you elaborate on the connection? I can take version 1 of the C sources of Vim from back in &#x27;92 and compile them without trouble. I&#x27;m not aware of dynamic languages like Javascript or Python 2 having any bitrot issues either. Backwards compatibility seems like a pretty big constraint for everyone.<p><i>Edit 16 minutes later</i>: I just tried your benchmark with my VM-like language (<a href=\"https:&#x2F;&#x2F;github.com&#x2F;akkartik&#x2F;mu\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;akkartik&#x2F;mu</a>), and the time taken was almost identical. Interesting exercise! Here&#x27;s the Mu and Plush&#x2F;0 programs side by side:<p><pre><code>  $ cat fib.mu\n  def fib n:num -&gt; result:num [\n    local-scope\n    load-ingredients\n    base-case?:bool &lt;- lesser-or-equal n, 1\n    return-if base-case?, n\n    n &lt;- subtract n, 1\n    fib-n-1:num &lt;- fib n\n    n &lt;- subtract n, 1\n    fib-n-2:num &lt;- fib n\n    result &lt;- add fib-n-1, fib-n-2\n  ]\n\n  def main [\n    local-scope\n    x:num &lt;- fib 29\n    $print x, 10&#x2F;newline\n  ]\n\n  $ cat benchmarks&#x2F;fib29.pls\n  #language &quot;lang&#x2F;plush&#x2F;0&quot;\n  var fib = function (n)\n  {\n      if (n &lt; 2)\n          return n;\n      return fib(n-1) + fib(n-2);\n  };\n  var r = fib(29);\n  print(r);</code></pre>","time":1493503734,"type":"comment"},{"by":"ternaryoperator","id":14228839,"kids":[{"by":"tachyonbeam","id":14228896,"kids":[{"by":"eropple","id":14229032,"kids":[{"by":"sitkack","id":14232888,"parent":14229032,"text":"Your tone could be improved.","time":1493575147,"type":"comment"},{"by":"tachyonbeam","id":14229075,"kids":[{"by":"eropple","id":14229093,"kids":[{"by":"tachyonbeam","id":14229147,"kids":[{"by":"eropple","id":14229150,"kids":[{"by":"coldtea","id":14229937,"kids":[{"by":"tachyonbeam","id":14234111,"kids":[{"by":"yumaikas","id":14235488,"parent":14234111,"text":"I suspect that some of that confusion comes from the fact that you directly compare yourself to LLVM, and that you haven&#x27;t mentioned much about ParrotVM or NekoVM, which are both efforts in this space. It&#x27;s also worth saying that the CLR and DLR are both efforts here as well.<p>When you compare yourself to LLVM, you phrase the comparison as only an advantage (Zeta will be easier to use than LLVM), rather than a tradeoff (Zeta will aim for ease of use before performance, as opposed to LLVM).<p>I don&#x27;t suggest that you start hedging your writing, but am just pointing out that if you make big comparisons, people will assume great ambition on your part.","time":1493611424,"type":"comment"}],"parent":14229937,"text":"I think people fail to understand, too, that I&#x27;m OK with having modest goals for Zeta. This system is going to be an experiment. If it doesn&#x27;t become hugely popular, it&#x27;s not the end of the world. If some things don&#x27;t work out, we can try something different. At the end of the day, I think some things really have to be tried out before we can decide if they&#x27;re viable&#x2F;useful or not.","time":1493589939,"type":"comment"},{"by":"eropple","id":14231774,"parent":14229937,"text":"In the large, sure. But &quot;if you&#x27;re going to say you can do X, you should have a good idea of what X is&quot; is pretty baseline, I think.","time":1493563832,"type":"comment"}],"parent":14229150,"text":"Let&#x27;s put it this way: WHEN (and IF) Zeta works, people can discuss its suitability for audio work, and how it would cater to the VST crowds. Until then, this is beyond premature discussion...","time":1493520492,"type":"comment"}],"parent":14229147,"text":"You&#x27;re not parsing so I&#x27;m done trying. Good luck with it.","time":1493505347,"type":"comment"}],"parent":14229093,"text":"I&#x27;m OK with not being able to replace every audio program ever written. That&#x27;s an impossible goal. I also know that I can never satisfy every possible use case.<p>I&#x27;m also quite sure that an audio program with a plugin architecture will be feasible in Zeta, once it&#x27;s more mature. The system is built for scripting, multi-language support and dynamically loading packages. It will be an excellent platform for plugins. You&#x27;ll be able to define your own custom plugin language(s) easily, and then you&#x27;ll be able to dynamically browse and load plugins from the package manager.","time":1493505268,"type":"comment"}],"parent":14229075,"text":"You can make useful audio software for a very tiny slice of a very picky market without a plugin architecture. Even crap like Audacity has a plugin architecture for a reason: because they <i>know</i> they don&#x27;t support what people need and want.<p>And yes, you can build your own plugins. You cannot replace the thousands upon thousands of VSTs out there. You aren&#x27;t replacing, for example, RealStrat, which is a supersampled virtual instrument, without re-recording the entire thing (do you know how? Is anyone going to bother doing it when they can use existing, conventional software?) and simultaneously reverse-engineering the algorithms used internal to it. You aren&#x27;t replacing even something comparatively simple like an Amplitube without heavy-hitting, lots-of-money algorithmic research in the first place. (And, on top of that, I sure wouldn&#x27;t want to deal with the patent encumbrances!)<p>And pardon my skepticism, but emulating latency-sensitive, CPU-intensive stuff like audio processing strikes me as a pretty foolish idea. When milliseconds count, your emulation layer just gets in the way. What benefit are you bringing to make additional failure cases and additional latency worth a user&#x27;s time?<p>You aren&#x27;t reinventing the entire audio world; as with many other fields, the lingua franca is C and not you and no matter how much you yell at the mountain the mountain&#x27;s not gonna move. If you want to play, you have to play <i>with</i> (good metaphor for music in general, now that I think about it). Maybe you should rethink some of your decisions, or better constrain your ambitions. Because right now--and this may sound harsh but I&#x27;m saying it because I like seeing people succeed--it sounds like you&#x27;re doing the software engineer That Guy thing and handwaving away difficult things because they aren&#x27;t conducive to the postulates you&#x27;re starting with.","time":1493504533,"type":"comment"},{"by":"tachyonbeam","id":14229132,"kids":[{"by":"zem","id":14230638,"parent":14229132,"text":"elm is a good example here - there is no ffi for somewhat similar reasons (specifically, that it can make safety guarantees about not crashing at run-time if you don&#x27;t allow arbitrary javascript code to be called), and that has both helped write reliable code, and hindered it&#x27;s usefulness in larger applications that have to play with the existing world of js libraries and components","time":1493540333,"type":"comment"},{"by":"eropple","id":14229136,"parent":14229132,"text":"You can click on the post itself to reply to it.<p>I&#x27;m not telling you not to have opinions, to be clear. I&#x27;m suggesting maybe you shouldn&#x27;t adjust those pince-nez and <i>pronounce</i> so hard. Many systems exist the way they do for reasons that Software Developer That Guy cannot divine from outside; you just happened to hit on one that I know a little bit about.<p>(Photoshop is another example; professional-level tools require professional-level expansion. Because everybody&#x27;s definition of &quot;professional&quot; is different.)","time":1493505123,"type":"comment"}],"parent":14229075,"text":"@eropple Replying to myself since HN doesn&#x27;t let me reply to your comment.<p>As previously stated, my goal with Zeta is not to replace all existing VMs and to satisfy every use case. It&#x27;s an experiment, it&#x27;s an opinionated system. I&#x27;m going to do things differently from other implementations and try to demonstrate interesting things along the way. Even if Zeta never becomes popular, I know it will make people talk, and I hope it inspires other systems.","time":1493505073,"type":"comment"}],"parent":14229032,"text":"1. That depends on the audio editing software you want to run. You can build useful audio editing software without plugins.<p>2. We can build our own plugins<p>3. It&#x27;s not impossible to translate or emulate existing VST plugins.","time":1493504290,"type":"comment"}],"parent":14228896,"text":"<i>&gt; audio editing software</i><p>In the audio space, it is vital to support FFI for a plugin architecture because I can guarantee you your language isn&#x27;t the-best-thing-since-sliced-bread for <i>somebody</i> who has stuff you really want available to you. Audio software lives and dies on the VST specification. (Audio Units are substitutable for VSTs--but the same problem remains.)<p>I admire your efforts, but perhaps you should understand the use cases of the things you want to use as examples before you try to employ them. It doesn&#x27;t instill confidence.","time":1493503612,"type":"comment"},{"by":"__s","id":14228983,"kids":[{"by":"tachyonbeam","id":14229083,"parent":14228983,"text":"WASM may remain stable, but it provides no APIs to the outside world AFAIK. The DOM keeps changing, and if the APIs are implementation-dependent, then WASM doesn&#x27;t guarantee non-breaking at all.<p>Another advantage that Zeta has is that it will come with useful building blocks for dynamic languages. With WASM, you have to implement your own dynamic typing, GC, JIT, etc, and the current WASM implementation doesn&#x27;t yet support JITting.","time":1493504447,"type":"comment"}],"parent":14228896,"text":"What about WebAssembly? It&#x27;s hit 1.0 now, &amp; it&#x27;s designed so that 1.0 wasm will never become deprecated<p>My own thoughts have been considering a wasm vm in kernel space. No need to ever exit kernel space; the wasm vm provides sufficient sandboxing. Wasm binaries could run on any architecture. Hopefully come up with a method that browsers can efficiently run wasm in directly in the kernel&#x27;s sandboxing rather than having wasm-in-wasm. Syscalls could be exposed through wasm&#x27;s import&#x2F;export system. Kind of like that Metal idea in &quot;The Birth &amp; Death of JavaScript&quot;","time":1493502879,"type":"comment"}],"parent":14228839,"text":"The IR, once past an initial prototyping state, will not change. Things will be added to it later, but not removed. The IR and semantics will be designed, as much as possible, to eliminate corner cases and undefined behaviors. Zeta will favor robustness over tiny performance gains. I realize that completely eliminating undefined behaviors isn&#x27;t necessarily possible, but we will do our best.<p>The outside world will be accessible through a set of APIs that are small, have limited surface area. For instance, sound output will be done by writing raw samples. Graphics will be done with pixel shaders (functions which given coordinates return a pixel color). New APIs will be added over time, new versions of APIs will be added, but the older APIs will remain functional.<p>There will eventually be a package manager, and it will have immutable package versioning. That is, you can publish v5 of libtern, and I can depend on it. You can later publish v6 of libtern, but you can&#x27;t change v5, so you can&#x27;t break my code which depends on v5 when you publish new versions of your lib.<p>Obvious caveat: Zeta will have no FFI. You won&#x27;t be able to immediately use all the libraries you could use in another system. I still think that building a huge amount of code that doesn&#x27;t break could turn out to be a huge advantage. We won&#x27;t try to satisfy every use case out there... But I think there are a lot of interesting and useful programs which don&#x27;t need much more than basic keyboard and mouse input, audio and video output, network and file access (think photoshop, audio editing software, IDEs, etc). We will probably end up adding APIs for other things like MIDI, etc later on.","time":1493501715,"type":"comment"}],"parent":14228808,"text":"&gt;&quot;The VM will be intentionally designed to avoid code rot&quot;<p>How do you plan to do that?","time":1493501085,"type":"comment"}],"parent":14228771,"text":"Not familiar with Neko, but superficially, it seems that VM is designed for a specific programming language. It uses a bytecode IR whereas Zeta uses a textual one. Neko is also farther along, more mature and feature complete than Zeta.<p>I intend to take a more experimental direction with Zeta. It won&#x27;t have an FFI, for instance. It will only provide a small set of minimalist APIs. The VM will be intentionally designed to avoid code rot and breaking changes.<p>Another thing I would like to experiment with is transparent compilation of pixel shaders to run on GPUs, the ability to run code in any language running on Zeta (given some restrictions) on both the CPU and GPU. I believe I have found a way to make this work, based on my type-specialization research.","time":1493500694,"type":"comment"}],"parent":14227892,"text":"How does this project compare to nekovm? Sounds very similar.","time":1493500306,"type":"comment"},{"by":"salmonlogs","id":14231853,"parent":14227892,"text":"+1 for the amazing domain name","time":1493564603,"type":"comment"},{"by":"zerr","id":14228520,"kids":[{"by":"tachyonbeam","id":14228640,"parent":14228520,"text":"Author here: sometimes you want to get the tag of a value, and operate on that tag as a value, but I guess this may not be necessary in this system, given that the get_tag instruction will produce an immutable string.<p>EDIT: removed it. It was probably left over from old code, previous VM&#x27;s I&#x27;ve written:\n<a href=\"https:&#x2F;&#x2F;github.com&#x2F;maximecb&#x2F;zetavm&#x2F;commit&#x2F;7ef746f061135304684c5029820631a688c399fa\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;maximecb&#x2F;zetavm&#x2F;commit&#x2F;7ef746f06113530468...</a>","time":1493498634,"type":"comment"}],"parent":14227892,"text":"Why do you need Tag member in the Word union?","time":1493497121,"type":"comment"}],"id":14227892,"score":94,"url":"https://pointersgonewild.com/2017/04/29/zetavm-my-new-compiler-project/","by":"ingve"},"14228365":{"by":"axiomdata316","descendants":0,"id":14228365,"score":3,"time":1493495420,"title":"How the Domain Name System (DNS) works and how you can make it better","type":"story","url":"https://medium.freecodecamp.com/the-domain-name-system-dns-is-the-backbone-of-the-internet-heres-how-it-all-works-5706d0afa0fa"},"14227770":{"by":"curtis","descendants":0,"id":14227770,"score":2,"time":1493488641,"title":"Flight Rail: using differential air pressure to power a railway vehicle","type":"story","url":"http://www.flightrail.com/our-prototype.html"},"14227817":{"by":"thebear","descendants":0,"id":14227817,"score":2,"time":1493489266,"title":"Your Music Player’s Random Shuffle Mode: Some Maths, Algorithms, and Probabilities","type":"story","url":"http://blog.greaterthanzero.com/post/159874910652/some-mathematics-algorithms-and-probabilities"},"14228682":{"by":"ColinWright","descendants":0,"id":14228682,"score":1,"time":1493499265,"title":"Surprisingly Quick","type":"story","url":"http://www.solipsys.co.uk/new/SurprisinglyQuick.html?HN_20170429"},"14228128":{"time":1493492418,"type":"story","descendants":72,"title":"Scraping Tinder selfies to make a dataset for AI experiments","kids":[{"by":"danso","id":14228358,"kids":[{"by":"SkyMarshal","id":14228407,"kids":[{"by":"joshumax","id":14228755,"parent":14228407,"text":"Now I feel bad for doing this exact thing with Tinder to create a data-set for determining age based on facial features...<p>At least I didn&#x27;t publicize it after and removed it when I was done","time":1493500080,"type":"comment"},{"deleted":true,"id":14228451,"parent":14228407,"time":1493496311,"type":"comment"},{"by":"toomuchtodo","id":14228617,"parent":14228407,"text":"It&#x27;s all fun and games until you violate the CFAA.<p>Laws you may not like are still there to be enforced.","time":1493498270,"type":"comment"}],"parent":14228358,"text":"CC aside (which I&#x27;m not sure he has the right to release Tinder&#x27;s data under any arbitrary license of his choosing, CC or otherwise), I&#x27;m actually ok with security and privacy vulnerabilities being openly exposed in this way.  Some random hacker in his garage figures out how to do it and just does, and makes it completely public.  The general public is so complacent about this stuff, it feels like events like this, or the fappening, motivate them far more than most advocacy does, while doing far less harm than a govt agency using it in secret could.","time":1493495767,"type":"comment"},{"by":"JumpCrisscross","id":14228654,"kids":[{"by":"devrandomguy","id":14228905,"parent":14228654,"text":"Perhaps this whole thing was just a very subtle PSA, designed to raise awareness of the dangers of using your real face as an avatar? If so, it seems to be effective, in this format.","time":1493501845,"type":"comment"}],"parent":14228358,"text":"It&#x27;s disturbing that Colliani&#x27;s LinkedIn lists him as a &quot;Cybersecurity Solutions Architect&quot; at PG&amp;E. That&#x27;s a lot of personal information for someone so clueless.","time":1493498841,"type":"comment"},{"by":"minimaxir","id":14228893,"parent":14228358,"text":"See also: the OKCupid data incident, where a user data was scrape and released non-anonymized and OKCupid was not happy about it: <a href=\"https:&#x2F;&#x2F;motherboard.vice.com&#x2F;en_us&#x2F;article&#x2F;70000-okcupid-users-just-had-their-data-published\" rel=\"nofollow\">https:&#x2F;&#x2F;motherboard.vice.com&#x2F;en_us&#x2F;article&#x2F;70000-okcupid-use...</a>","time":1493501703,"type":"comment"},{"by":"_pmf_","id":14228409,"kids":[{"by":"danso","id":14228468,"parent":14228409,"text":"Worth pointing out that Zuckerberg&#x27;s obliviousness was very much like the guy featured in the OP, and he was punished for FaceMash and apologized for it [0].<p>He then created TheFacebook as an alternative to Harvard&#x27;s online facebook, which was purportedly in development. The official facebook was taking longer because of worries about scraping of user information [1]:<p>&gt; <i>Davis said that the principle complication with the creation of an official facebook was figuring out how to design an interface so that directory information could not easily be compiled without authorization.</i><p>That said, Zuckerberg&#x27;s TheFacebook got around that because students apparently were happy to upload their information to his service. And the rest is history.<p>[0] <a href=\"http:&#x2F;&#x2F;www.thecrimson.com&#x2F;article&#x2F;2003&#x2F;11&#x2F;4&#x2F;hot-or-not-website-briefly-judges&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.thecrimson.com&#x2F;article&#x2F;2003&#x2F;11&#x2F;4&#x2F;hot-or-not-websi...</a><p>[1] <a href=\"http:&#x2F;&#x2F;www.thecrimson.com&#x2F;article&#x2F;2004&#x2F;2&#x2F;9&#x2F;hundreds-register-for-new-facebook-website&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.thecrimson.com&#x2F;article&#x2F;2004&#x2F;2&#x2F;9&#x2F;hundreds-register...</a>","time":1493496444,"type":"comment"},{"by":"thr0waway1239","id":14228463,"parent":14228409,"text":"No. He is a billionaire, which obviously means he is a visionary. These characterizations only apply to mere mortals and other dumb fucks such as those who contribute to Facebooks&#x27; MAU numbers.","time":1493496386,"type":"comment"}],"parent":14228358,"text":"&gt; This guy sounds like a caricature of the exact kind of socially unaware techie who blithely implements dystopian-powering software, because having data and writing code is all that matters apparently.<p>Zuck?","time":1493495795,"type":"comment"},{"by":"necessity","id":14228420,"kids":[{"by":"danso","id":14228482,"kids":[{"by":"ghaff","id":14228874,"parent":14228482,"text":"I read the parent as saying that they assumed photos on a service could&#x2F;would be used for who knows what purpose, not that it&#x27;s the fair or legal thing to happen. That seems a reasonable assumption to start with and be pleasantly surprised when it doesn&#x27;t happen.","time":1493501501,"type":"comment"},{"by":"devrandomguy","id":14228503,"kids":[{"by":"danso","id":14228590,"kids":[{"by":"ghaff","id":14228857,"kids":[{"by":"danso","id":14228941,"kids":[{"by":"ghaff","id":14228978,"parent":14228941,"text":"Absolutely right. I actually wrote about this at the time. [1] That CC has commercial&#x2F;non-commercial variants probably add further to the confusion even if they didn&#x27;t play into this case. As does the fact that the colloquial meaning of commercial is different from the meaning of commercial that&#x27;s relevant to publicity rights.<p>[1] <a href=\"https:&#x2F;&#x2F;www.cnet.com&#x2F;uk&#x2F;news&#x2F;more-commercial-creative-commons-conundrums&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.cnet.com&#x2F;uk&#x2F;news&#x2F;more-commercial-creative-common...</a> (Video autoplay, grr.)","time":1493502770,"type":"comment"}],"parent":14228857,"text":"I didn&#x27;t mean to imply that the CC licensing was at fault, though IIRC the girl and her family did originally include the CC Corporation as a defendant [0] before dropping them from the suit. I was merely stating the fact that just because the <i>photographer</i> has made their photo freely available under CC does not mean the subject has given consent for their image to be commercially used. Virgin Mobile screwed up into thinking that&#x27;s what CC meant.<p>[0] <a href=\"http:&#x2F;&#x2F;fairuse.stanford.edu&#x2F;case&#x2F;chang-v-virgin-mobile-creative-commons-corporation&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;fairuse.stanford.edu&#x2F;case&#x2F;chang-v-virgin-mobile-creat...</a>","time":1493502310,"type":"comment"}],"parent":14228590,"text":"&gt;You would just have to notice the commercial usage, as what happened when the teenager who was captured in a CC-licensed photo on Flickr found herself in a Virgin Mobile campaign<p>The issue in that case was (IANAL) nothing to do with the CC licensing but with the fact that the photo was used for a commercial (i.e. marketing&#x2F;advertising) purpose. Those require a model release form, hence the requirement by microstock sites for model releases.<p>Virgin Mobile messed up in that they used a photo for a marketing campaign that didn&#x27;t have a model release form either directly or through an agency that had vetted it.<p>Editorial use in the US at least doesn&#x27;t require this even though it&#x27;s commercial use in the sense that a for-profit entity is using the photo to illustrate a story.","time":1493501292,"type":"comment"},{"by":"devrandomguy","id":14228632,"parent":14228590,"text":"I guess, I just have very little faith in my ability to get personal justice versus a foreign corporation. The value of the dataset, when applied to an unethical but lucrative purpose, could easily outgrow the cost of getting caught. Especially if the operation is well isolated from the parent company.<p>It is not the possibility that I might appear in an ad that concerns me, but rather, that the set of photos that contain me in them, could be used correlate way more information than I would ever consent to releasing voluntarily. I would not even notice that happening.","time":1493498499,"type":"comment"}],"parent":14228503,"text":"International laws are all different, but American laws are generally among the most permissive. For example, newspapers don&#x27;t have to get consent forms for everyone who happens to appear in a photo of a public venue. I don&#x27;t think Google was legally obligated to blur faces in its Street View coverage of America, but it was likely the extremely wise thing to do (nothing stopping government from passing new laws) [0]. But documentaries <i>do</i> -- I&#x27;m honestly not sure if that is legally the case or if it&#x27;s done out of precaution, obviously the majority of TV news and newspaper photos don&#x27;t blur random people&#x27;s faces. And for things like the &quot;Ali G Show&quot; [1], you can bet all of those people who were unblurred had signed a release before entering that bar.<p>In contrast, I know that in the EU, <i>architects</i> have copyright on their work, which means you can&#x27;t photograph the Eiffel Tower at night and share the photo, legally, without consent [2]<p>As to how you know if your photo is being used commercially...obviously there isn&#x27;t a push-notification service (yet) that sends an alert to your inbox. You would just have to notice the commercial usage, as what happened when the teenager who was captured in a CC-licensed photo on Flickr found herself in a Virgin Mobile campaign<p>[0] <a href=\"https:&#x2F;&#x2F;www.cnet.com&#x2F;news&#x2F;google-begins-blurring-faces-in-street-view&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.cnet.com&#x2F;news&#x2F;google-begins-blurring-faces-in-st...</a>  (warning, autoplay video)<p>[1] <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=Vb3IMTJjzfo\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=Vb3IMTJjzfo</a><p><a href=\"http:&#x2F;&#x2F;www.thefrisky.com&#x2F;2009-07-15&#x2F;how-sacha-baron-cohen-keeps-from-getting-sued&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.thefrisky.com&#x2F;2009-07-15&#x2F;how-sacha-baron-cohen-ke...</a><p>[2] <a href=\"http:&#x2F;&#x2F;www.politico.eu&#x2F;article&#x2F;banned-taking-pictures-of-the-eiffel-tower-at-night-copyright-law-eu&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.politico.eu&#x2F;article&#x2F;banned-taking-pictures-of-the...</a>","time":1493497882,"type":"comment"},{"by":"toomuchtodo","id":14228560,"kids":[{"by":"devrandomguy","id":14228706,"kids":[{"by":"toomuchtodo","id":14228748,"parent":14228706,"text":"IANAL, but my understanding of contract law is that consideration is required:<p><a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Consideration\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Consideration</a><p><a href=\"https:&#x2F;&#x2F;nationalparalegal.edu&#x2F;public_documents&#x2F;courseware_asp_files&#x2F;contracts&#x2F;Consideration&#x2F;IntroductionAndConsideration.asp\" rel=\"nofollow\">https:&#x2F;&#x2F;nationalparalegal.edu&#x2F;public_documents&#x2F;courseware_as...</a><p>&quot;The idea of consideration is vital to contract law because, in order for a contract to be enforceable, there must be “mutuality of obligation.” In other words, in order for a contract to be valid, both parties to the contract must be required to perform under the contract. Consideration, which represents the commitment that the parties to the contract make to each other, is at the heart of the “mutuality of obligation” rule and, therefore, without consideration, a contract will not be enforceable.&quot;","time":1493499998,"type":"comment"}],"parent":14228560,"text":"I know you didn&#x27;t intend that as legal advice, but I sure hope that you are correct nonetheless. From the article:<p>&gt; It’s also worth noting that in agreeing to the company’s T&amp;Cs Tinder users grant it a “worldwide, transferable, sub-licensable, royalty-free, right and license to host, store, use, copy, display, reproduce, adapt, edit, publish, modify and distribute” their content — though it’s less clear whether that would apply in this case where a third-party developer is scraping Tinder data and releasing it under a public domain license.","time":1493499571,"type":"comment"}],"parent":14228503,"text":"&gt; What if the EULA of every major social network and photo sharing service, grants that service ownership and commercial usage of all of the content that you create with them?<p>Courts would consider it an overreach, and that specific clause would be nullified.<p>You can&#x27;t take everything from another party while offering no compensation and expect a court to uphold it.<p>EDIT: Disclaimer: Not a lawyer. Not your lawyer.","time":1493497531,"type":"comment"}],"parent":14228482,"text":"Does this apply internationally? Also, how would you know if your photo is being used commercially? What if the EULA of every major social network and photo sharing service, grants that service ownership and commercial usage of all of the content that you create with them?","time":1493496902,"type":"comment"}],"parent":14228420,"text":"You would be wrong. Uploading your photo to a commercial service that is publicly accessible does not allow someone or anyone else to use your photo for other commercial purposes, such as in an advertisement, without a model release [0].<p>The rules governing consent and data of human subjects are even more stringent in academia, hence the existence of institutional review boards.<p>[0] <a href=\"http:&#x2F;&#x2F;adland.tv&#x2F;content&#x2F;virgin-uses-cc-licenced-flickr-photo-ad-campaign-forgets-model-release-gets-sued\" rel=\"nofollow\">http:&#x2F;&#x2F;adland.tv&#x2F;content&#x2F;virgin-uses-cc-licenced-flickr-phot...</a>","time":1493496604,"type":"comment"},{"by":"devrandomguy","id":14228498,"parent":14228420,"text":"This is absolutely correct. Companies are bought and sold along with their data, and the new owners are not necessarily bound by the agreements or motives of their predecessor. Us users generally have no say in the matter. EULA&#x27;s that appear to promise a bit of privacy, are usually riddled with loopholes.<p>Identity is a liability, and a favor that we offer to our peers in order to simplify communication. It does not benefit the person being identified, so much. If I cannot have the identities of the people and projects who consume my data, then I will operate as a fresh, expendable identity.","time":1493496853,"type":"comment"},{"by":"throwaway865456","dead":true,"id":14229356,"parent":14228420,"text":"You fool should have informed yourself before commenting.","time":1493508414,"type":"comment"}],"parent":14228358,"text":"When I upload my photos to Tinder or Facebook I assume they are stored forever and may be used for any purpose by anyone. Any person who assumes otherwise is a fool.","time":1493495897,"type":"comment"},{"by":"facerecognizer","id":14228492,"kids":[{"by":"danso","id":14228529,"parent":14228492,"text":"Megaface is not &quot;available easily&quot;. You have to email the team and ask for permission to get access credentials: <a href=\"http:&#x2F;&#x2F;megaface.cs.washington.edu&#x2F;participate&#x2F;challenge2.html\" rel=\"nofollow\">http:&#x2F;&#x2F;megaface.cs.washington.edu&#x2F;participate&#x2F;challenge2.htm...</a><p>Since so few details about terms of use on the dataset are available, it&#x27;s reasonable to assume the access control is put up in place for reasons other than bandwidth concerns.","time":1493497201,"type":"comment"}],"parent":14228358,"text":"He is just an amateur, I find it funny that its news since he collected only 40K pictures, any one with couple of hundred dollars and smarts can probably get few million pictures easily using pool of EC2 spot instances with disposable IP addresses.<p>Not to mention there are several million face dataset available easily. <a href=\"http:&#x2F;&#x2F;megaface.cs.washington.edu\" rel=\"nofollow\">http:&#x2F;&#x2F;megaface.cs.washington.edu</a><p>Also there is really no point in attacking him, other than for typical clickbait outrage.<p>Finally how is this worse than those name and shame Tinder&#x2F;OKCupid&#x2F;Jezebel blog posts, or the horrible actions of the Wikileaks&#x2F;Intercept crooks.","time":1493496791,"type":"comment"}],"parent":14228128,"text":"&gt; <i>“I have often been disappointed,” he writes of other facial data sets. “The datasets tend to be extremely strict in their structure, and are usually too small. Tinder gives you access to thousands of people within miles of you. Why not leverage Tinder to build a better, larger facial dataset?”</i><p>This guy sounds like a caricature of the exact kind of socially unaware techie who blithely implements dystopian-powering software, because having data and writing code is all that matters apparently. Privacy law admittedly isn&#x27;t the simplest concept but you have to wonder how blissfully solipsistic someone has to be to write a simple script that scrapes proprietary data without asking himself, &quot;this is so easy, I wonder why no one else has had this idea?&quot;<p>And then he released the data under CC0, just to add insult to injury by making CC look unethical.","time":1493495375,"type":"comment"},{"by":"propman","id":14228603,"kids":[{"by":"devrandomguy","id":14228665,"parent":14228603,"text":"I do not believe that it would be possible to prevent this sort of behavior by force. Any script kiddie could pull this off, and there are more born every day. Some of them barely even understand Western values, let alone have an incentive to value them.<p>Rather than (edit: in addition to) relying on protection, we should rely on personal safety practices. Using our own portraits as avatars may have been a mistake, in hindsight. I will recommend to my friends, that they teach their children to use a photo of their favorite toy or something, instead of their own face.","time":1493498994,"type":"comment"}],"parent":14228128,"text":"This is a serious ethical violation in my opinion. Like the sjsu student in that article, I am extremely uncomfortable with people of suspect moral compas analyzing my face without my consent. As a Bay Area frequent user of tinder, I do actually feel violated. Only one of my photos is public on my profile but with that you can find my name, my college, and then using basic data engineering you can find my phone number and address. Using face recognition you could theoretically scour the web for nudes or suspect information and stalk, blackmail or worse. I hope someone drops the hammer on this person to send a message and prevent future occurrences of this","time":1493498103,"type":"comment"},{"by":"yoodenvranx","id":14228224,"kids":[{"by":"ben_jones","id":14228385,"parent":14228224,"text":"We were there a year ago [1].<p>[1]: <a href=\"https:&#x2F;&#x2F;www.theguardian.com&#x2F;technology&#x2F;2016&#x2F;may&#x2F;17&#x2F;findface-face-recognition-app-end-public-anonymity-vkontakte\" rel=\"nofollow\">https:&#x2F;&#x2F;www.theguardian.com&#x2F;technology&#x2F;2016&#x2F;may&#x2F;17&#x2F;findface-...</a>","time":1493495590,"type":"comment"},{"by":"minimaxir","id":14228878,"kids":[{"by":"pjc50","id":14228949,"kids":[{"by":"minimaxir","id":14228994,"parent":14228949,"text":"I said not-the-same-case; the legality is still incredibly complicated.","time":1493502987,"type":"comment"}],"parent":14228878,"text":"Really? Does this apply even if the photo is posted without the consent of photographer or subject?<p>(because we already had that, and it was a fiasco)","time":1493502355,"type":"comment"}],"parent":14228224,"text":"That is not the same case morally as Tinder because photos posted on Reddit are <i>public</i> and have no expectation of privacy. (also, it&#x27;s not technically complex to get the image URLs from the Reddit data dumps, albeit getting the images themselves <i>will</i> likely hit a ToS violation)","time":1493501524,"type":"comment"},{"by":"pjc50","id":14228938,"parent":14228224,"text":"I suspect someone out there is building the weapon of mass de-anonymisation.","time":1493502285,"type":"comment"}],"parent":14228128,"text":"I am still waiting for someone to scrape all the images of naked people on reddit&#x2F;imgur and do some classification based on the subreddit from which the image comes from. (For those who don&#x27;t know: a lot of porn subreddits are _highly_ specific to a certain topic which might help for classification)","time":1493493605,"type":"comment"},{"by":"dvt","id":14228235,"kids":[{"by":"TillE","id":14228448,"kids":[{"by":"dvt","id":14228484,"parent":14228448,"text":"What about services that use my face for things like facial recognition (without explicit consent)?","time":1493496636,"type":"comment"}],"parent":14228235,"text":"Basic copyright protections mean you have zero rights to random photos you grab from some internet service. It&#x27;s probably ok to just download them, but doing <i>anything</i> with them creates a derivative work which you cannot distribute without permission.<p>My point is, this kind of thing is already illegal.","time":1493496291,"type":"comment"},{"by":"noobermin","id":14228333,"parent":14228235,"text":"&gt;Is your face PII [personally identifiable information]?<p>Before computers existed, PII referred to information someone (ie., a human individual) can use to personally identify someone and probably[0] still does. I&#x27;d say a picture of someone is a good way to identify someone.<p>[0] The &quot;probably&quot; is sarcastic. Of course it is PII.","time":1493495060,"type":"comment"}],"parent":14228128,"text":"Data set no longer exists, Tinder probably sent a C&amp;D. I did something similar with FB a while ago -- scraped all photos of people that &quot;Liked&quot; a certain topic. It&#x27;s no longer possible.<p>Definitely feels wrong having such easy access to people&#x27;s pictures; it leads to interesting questions: is your face PII? Do you have ownership rights to your face? What about facial recognition algorithms that use pictures you upload to FB, Instagram, Tinder, etc. to generate, e.g., Haar cascades?","time":1493493728,"type":"comment"},{"by":"kolbe","id":14228301,"kids":[{"by":"ben_w","id":14228497,"parent":14228301,"text":"I used to, but now I disable Javascript by default and only enable it on websites that demonstrably benefit from it. The result is, the ad-block blocking scripts never run.","time":1493496849,"type":"comment"},{"by":"zeroer","id":14228634,"parent":14228301,"text":"Yes, but NoScript means I almost never see such things.","time":1493498537,"type":"comment"},{"by":"Animats","id":14228389,"parent":14228301,"text":"Yes.","time":1493495635,"type":"comment"}],"parent":14228128,"text":"Question unrelated to the article, but related to that link: is anyone else developing a knee-jerk reaction to just leaving a web site the moment they ask you to turn ad-block off?","time":1493494722,"type":"comment"},{"by":"ben_jones","id":14228352,"parent":14228128,"text":"Let&#x27;s not forget that pictures like this are used for social engineering attacks in domains ranging from finance to prostitution to blackmail. I honestly don&#x27;t care about the researcher (assuming he doesn&#x27;t release the data set publicly). It&#x27;s the responsibility of Facebook, Tinder, and similar sites which profit from such images, to go to extreme measures to protect them even if it incurs significant costs such as counter scraping.","time":1493495327,"type":"comment"},{"by":"zitterbewegung","id":14228278,"kids":[{"by":"hkon","id":14228292,"parent":14228278,"text":"&quot;you wouldn&#x27;t download an image&quot;","time":1493494620,"type":"comment"}],"parent":14228128,"text":"Nowadays scraping is the Uber of data collection . You will be fraught with legal problems with the dataset and people will block you if you become a big enough problem.","time":1493494399,"type":"comment"},{"by":"exabrial","id":14228633,"parent":14228128,"text":"Am I the only one who is greatly disturbed by the ethics of this? I don&#x27;t think he had those user&#x27;s consent, nor permission from Tinder.","time":1493498524,"type":"comment"},{"by":"alexc05","id":14228270,"kids":[{"by":"denzil_correa","id":14228431,"kids":[{"by":"alexc05","id":14228936,"kids":[{"by":"denzil_correa","id":14230501,"parent":14228936,"text":"&gt; On instagram, it is a broadcasting and publishing platform and it is very clear that by posting a photo, on a non-private-account the photo can be seen and generally browsed by others.<p>The keyword is published for &quot;browsing&quot; and other things which are codified. You can&#x27;t use it for mining data without consent.","time":1493536161,"type":"comment"}],"parent":14228431,"text":"See, I agree and disagree with that. People on tinder are probably reasonably expecting that their pictures are used for meeting up with locals for the purposes of dating. The debate about whether this is a reasonable expectation isn&#x27;t really what I&#x27;m on about. (Obviously, as techie types, we have a different understanding of how private this stuff really is)<p>On instagram, it is a broadcasting and publishing platform and it is very clear that by posting a photo, on a non-private-account the photo can be seen and generally browsed by others.<p>A researcher who conducts a study of &quot;looking at&quot; 400k public instagram photos is doing a different thing than spoofing their location and auto-swiping through 400k lonely hearts.<p>Obviously people disagree with this since I&#x27;m getting downvotes for my position. This is certainly my opinion But I do feel like running a study against one isn&#x27;t unethical while the other is.<p>Of course, that should be caveated that &quot;republishing&quot; the scraped data is unreasonable in both cases (IMO). I also think things like this artist <a href=\"http:&#x2F;&#x2F;fortune.com&#x2F;2015&#x2F;05&#x2F;26&#x2F;instagram-copyright-art&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;fortune.com&#x2F;2015&#x2F;05&#x2F;26&#x2F;instagram-copyright-art&#x2F;</a> are reprehensible... but that&#x27;s art, not science and doesn&#x27;t actually have the same expectation to abide by ethical principles.","time":1493502282,"type":"comment"}],"parent":14228270,"text":"&gt; Probably because insta is public by design<p>There&#x27;s a difference between public and public domain. Just because something is public, doesn&#x27;t mean you are free to use it as you wish. You <i>may</i> still require permission to use it for tasks beyond the originally intended purpose.","time":1493496056,"type":"comment"},{"by":"noobermin","id":14228312,"parent":14228270,"text":"At the bottom of the article, Tinder claimed he violated their TOS.","time":1493494843,"type":"comment"}],"parent":14228128,"text":"Experiments without informed consent. While Tinder <i>might</i> have something in their T&amp;C which requires that they&#x27;re allowed to look at the data, it isn&#x27;t ethical for third parties to scrape and use that same data without informed consent.<p>Interestingly though, I wouldn&#x27;t think the same of an instagram scrape. Probably because insta is public by design, while tinder is expected to be local, requires a login and ostensibly is for the purpose of looking for companionship.","time":1493494244,"type":"comment"},{"by":"unityByFreedom","id":14229018,"parent":14228128,"text":"This is an ugly thread.  Just a heads up =)","time":1493503389,"type":"comment"},{"by":"ourcat","id":14228274,"kids":[{"by":"llamataboot","id":14228455,"kids":[{"by":"louithethrid","id":14228703,"kids":[{"by":"467568985476","id":14228838,"kids":[{"by":"louithethrid","id":14228933,"kids":[{"by":"unityByFreedom","id":14229007,"parent":14228933,"text":"&gt; My open source code is riddled with jokes of all kinds on all kinds of hairless monkeys. Demanding dignity you shall have none, because you got none, disserving dignity because you stumble around naked of any - you shall have.<p>K.  Make those jokes about a protected class in a workplace and you might be looking at a lawsuit and lawyer telling you to cool it.<p>&gt; Call me animal names. I prefer that much more to that mental-graveyard of smiles and conservation. Insult is preferable to insulation. Always.<p>I don&#x27;t see why going to the other extreme is any sort of solution.  Obviously you don&#x27;t want to work in a PC culture so you can just avoid those workplaces.  There are different levels in various fields and locations.<p>&gt; To not joke about this existential absurdity is to not be a selfaware human.<p>I think we all get the joke now.  We just don&#x27;t find it funny.  So, forgive us if we don&#x27;t laugh while you continue exercising your right to free speech, and we can continue living side-by-side.","time":1493503226,"type":"comment"}],"parent":14228838,"text":"My open source code is riddled with jokes of all kinds on all kinds of hairless monkeys. Demanding dignity you shall have none, because you got none, disserving dignity because you stumble around naked of any - you shall have.<p>And you know- those professionals tend to have a scope-creep when it comes to professionalism. Do not talk about this its offensive, do not talk about that its offensive, do not talk about this invention, it could offend our buisness-partner XY. No, i demand the right to offend. And to be offended. Call me animal names. I prefer that much more to that mental-graveyard of smiles and conservation.\nInsult is preferable to insulation.\nAlways.<p>If the church still had power, it would be insulted by da-vincis drawing claiming that humans could handcraft angel-wings. And those intestines- what a insult.\nAnd that darwin guy, claiming we where ape-decendants.\nInsult upon insult.\nHow can any professional gentleman take this kind of talk into there mouth and not demean himself. Outrageous.\nTake your silk-sheated scissors and censor somehwere else.<p>Also sorry, but the whole process of human sexual interaction is demeaning, always was always will be. You have drug dealers and drug buyers, trades that go bust, and the attempt to cram the whole messy affair into contracts that should outlast the varous value-curves the trade-goods in the relationship perform. Its hillarious and hellirious. To not joke about this existential absurdity is to not be a selfaware human.","time":1493502242,"type":"comment"}],"parent":14228703,"text":"If political correctness means not making demeaning jokes about women in your code, then yes, it&#x27;s absolutely mandatory. Even if you were the most sexist business owner, it should still be obvious that behavior like this invites sexual harassment lawsuits in a professional setting.<p>And there are plenty of people who manage to be both unconventional and creative without making a juvenile joke that amounts to little more than slut shaming women for using a dating app.","time":1493501073,"type":"comment"},{"by":"unityByFreedom","id":14228976,"kids":[{"by":"louithethrid","id":14229017,"kids":[{"by":"unityByFreedom","id":14229048,"kids":[{"by":"louithethrid","id":14229170,"kids":[{"by":"unityByFreedom","id":14229567,"parent":14229170,"text":"&gt; Im would very much prefer a &quot;combatative society&quot; as you call it, one where a philosopher is free to challenge any idea<p>I meant combative as in leads to physical altercation.<p>Raising mental tensions can lead to that.<p>We already have a very open combative philosophical society.  You&#x27;re not jailed for any of your speech.  That&#x27;s not true in much of the world.<p>Perhaps you consider that a low bar, but, in terms of human development, I&#x27;d consider it state-of-the-art.<p>I agree with you that a lot of society doesn&#x27;t want open debate.  But, it is legal, and if you crave it, there are venues for it.  Debate club, politics, or really anywhere.  There&#x27;s a difference between legal and cultural.<p>The widespread cultural change you&#x27;re seeking is much more difficult to achieve than simply making open discourse legal.  And, arguably, making everyone talk and react the way you want, combatively, goes against your desire for everyone to have freedom to say what they please.<p>In fact, you have that freedom, you just don&#x27;t want to deal with the reaction from society.<p>&gt; To utilize courts as a artifical replacement parent to create a protected environment, from facts, from ideas, from the very reality of hostility - that breaks down, once not enough economic shield energy is left- what good is that for<p>Civility?  If no courts, then what?  Only money, and total rule by the wealthy?  That doesn&#x27;t sound sustainable.<p>The existence of courts naturally leads to upholding our written law, which needs to be interpreted as well as applied.<p>&gt; There is after all still the ability, to stop hugging the cactee, turn off that source of media, sit on a meditating pillow and softly shake your head until the arguments to drive back that opposing view emerge from the subconcious stream.<p>If there&#x27;s one thing on which we agree it&#x27;s this.<p>&gt; Not some ilusion of peace at paper-gunpoint, but a real understanding of what we made of allowing for real advances. Not this potemking village of civility, that falls apart at the first twitter huff and puff.<p>It sounds like you want better communication.  I do too.  I think we&#x27;re getting there.<p>Honestly to me the world doesn&#x27;t seem so bad, and I&#x27;m sure you have hobbies that you enjoy.  I&#x27;m going to do some today.  Hope you will too!","time":1493512294,"type":"comment"}],"parent":14229048,"text":"Im would very much prefer a &quot;combatative society&quot; as you call it, one where a philosopher is free to challenge any idea, no matter how holy of a cow it is declared. Where the protection of any feeling whatsoever is not used as a battering ram against debate. I rather be in a shouting match with someone who violently disagrees and gives me new perspectives, then in a society that silent threats any disagreement to death.<p>To be a adult in my opnion means, to be able to handle a rough outside world that constantly atttacks any firm believe i hold. To utilize courts as a artifical replacement parent to create a protected environment, from facts, from ideas, from the very reality of hostility  - that breaks down, once not enough economic shield energy is left- what good is that for.<p>There is after all still the ability, to stop hugging the cactee, turn off that source of media, sit on a meditating pillow and softly shake your head until the arguments to drive back that opposing view emerge from the subconcious stream.<p>I want a fightcloub of thoughts, insults are great, if they reveal something on the human condition, on what the person im dealing with really thinks and why it its that way and what society can do to realy change that. Not some ilusion of peace at paper-gunpoint, but a real understanding of what we made of allowing for real advances. Not this potemking village of civility, that falls apart at the first twitter huff and puff.","time":1493505668,"type":"comment"}],"parent":14229017,"text":"Okay, well if you agree that it&#x27;d be sexual harassment, I guess color me surprised.  I thought you would​ be leaning against the &quot;affirmative actions&quot; of the courts and would feel it should be legal.<p>I assume there are jokes that would get under your skin.  Perhaps white privilege.<p>If not, maybe you&#x27;d rather we lived in a more combative society.  Personally I don&#x27;t.  We need to work from today&#x27;s society&#x27;s expectation of civility","time":1493503902,"type":"comment"}],"parent":14228976,"text":"I never claimed there are not and they should not. And they can make jokes on men, woman, the elderly and especially me too. Its great.","time":1493503389,"type":"comment"}],"parent":14228703,"text":"Pretty sure it&#x27;d be grounds for a sexual harassment lawsuit if someone started littering their code with offenses directed at women.<p>It&#x27;s discrimination based on sex and against the law to make the workplace favor one sex.<p>You may not like that trampling of your free speech rights, but there you have it.  We agreed as a society to allow women to enjoy the right to earn their own wages in whatever line of work they choose.  Good thing too.  There are some super smart women out there who have contributed a lot.  Can&#x27;t believe this needs to be said in 2017 but here we are.","time":1493502720,"type":"comment"}],"parent":14228455,"text":"So politcal correct code is mandatory. Oh boy.\nSo if turing himself would appear at your doorstep and his code examples would be riddle with gay insider jokes and wordplay, you wouldnt hire him? Because, profesional behaviour beets a mind that recombines and is flexible any day?\nGood thing that relationship is bi-directional- unconventional creative guys are not searching for a job at your company.","time":1493499549,"type":"comment"}],"parent":14228274,"text":"tasteless enough that I wouldn&#x27;t hire anyone that gave me this code to look at before an interview","time":1493496330,"type":"comment"},{"by":"tdfx","id":14228402,"parent":14228274,"text":"Almost as distasteful as his use of tabs and camelcase in Python.","time":1493495751,"type":"comment"},{"by":"helthanatos","id":14228334,"kids":[{"by":"dvt","id":14228368,"kids":[{"by":"thinknot","dead":true,"id":14228381,"kids":[{"by":"zepto","id":14228399,"parent":14228381,"text":"Do you think this of all dating apps?","time":1493495722,"type":"comment"}],"parent":14228368,"text":"A woman who&#x27;s signed up for an app just to get fucked by a stranger is, well, a whore. It&#x27;s right there in the dictionary.<p>The only thing I lament is the non-existence of a similar term to describe men, because promiscuity is not only negative when women do it, of course.","time":1493495576,"type":"comment"}],"parent":14228334,"text":"I&#x27;m pretty liberal about stuff like this and I honestly think it&#x27;s pretty tasteless also.<p>I&#x27;ve often said that the sexism issue in tech is overblown (due to various agendas at work) but when you see shit like this (especially in the context of Tinder, a dating app), it&#x27;s just hard to deny :&#x2F;","time":1493495438,"type":"comment"},{"by":"Jare","id":14228400,"parent":14228334,"text":"Both. The problem is that a tasteless joke is usually worse than no joke at all.","time":1493495748,"type":"comment"}],"parent":14228274,"text":"Well, it&#x27;s probably more showing of a sense of humor.","time":1493495077,"type":"comment"},{"by":"thinknot","id":14228332,"parent":14228274,"text":"Yes, this codebase is old, because currently you&#x27;d use &quot;for thot in thots:&quot;","time":1493495058,"type":"comment"},{"by":"louithethrid","id":14228445,"kids":[{"by":"danso","id":14228490,"kids":[{"by":"louithethrid","id":14228653,"parent":14228490,"text":"Thanks for the links. Sorry, reply was not related to your post.","time":1493498829,"type":"comment"}],"parent":14228445,"text":"That kind of analysis (though not the neural net thing...I think...) has likely been done internally by Tinder. It certainly has been done over at OKCupid:<p><a href=\"https:&#x2F;&#x2F;theblog.okcupid.com&#x2F;the-mathematics-of-beauty-51bd25ae9a75\" rel=\"nofollow\">https:&#x2F;&#x2F;theblog.okcupid.com&#x2F;the-mathematics-of-beauty-51bd25...</a><p><a href=\"https:&#x2F;&#x2F;theblog.okcupid.com&#x2F;your-looks-and-your-inbox-8715c0f1561e\" rel=\"nofollow\">https:&#x2F;&#x2F;theblog.okcupid.com&#x2F;your-looks-and-your-inbox-8715c0...</a><p><a href=\"https:&#x2F;&#x2F;theblog.okcupid.com&#x2F;race-and-attraction-2009-2014-107dcbb4f060\" rel=\"nofollow\">https:&#x2F;&#x2F;theblog.okcupid.com&#x2F;race-and-attraction-2009-2014-10...</a>","time":1493496779,"type":"comment"},{"by":"louithethrid","id":14228660,"parent":14228445,"text":"Who cares anyway? Drug junkies and drug dealers on the meat-market, trying to hang nice drapes over everything related to it. If you call it diffrent, the uglyness will go away or at least be kept at bay. Controll the conversation over it and the reality goes away, what a laughing stock of a concept.","time":1493498930,"type":"comment"}],"parent":14228274,"text":"Hoe by now is genderneutral, so who cares. But it implies payment of any kind, so its very inprecise. But i guess from someone who does get laid as often as a graduate data scientist - any deal is better payment, thus anyone having a better deal - aka any deal, is a hoe. Virginity equals moral superpowers.<p>Still, i wonder what sort of pictures the dataset could correlate if convulated with the swipe quota. And if you could post those pictures as tinder profiles, generating a plattform where neural Nets pose as unavailable gods and goddeses of beauty, driving a generation of swingers into depression.<p><a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=mv43HXcRhw4\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=mv43HXcRhw4</a>","time":1493496245,"type":"comment"}],"parent":14228128,"text":"Pretty tasteless array name in there: `for hoe in hoes:` which exposes the base mentality of the coder.","time":1493494303,"type":"comment"},{"by":"lemonsqueeze","dead":true,"id":14228700,"parent":14228128,"text":"No one ever swiped right on him. This is his revenge.<p>Imagine how disappointed he would be if someone took all his pictures of him, his wife&#x2F;husband, and family members and released it under CC0.<p>This is absolutely disgusting and shameful.<p>How much of his actions you think are motivated by the fact that he likely never got a single women to swipe right, let alone go on a date with him?","time":1493499536,"type":"comment"},{"by":"Odenwaelder","dead":true,"id":14228355,"parent":14228128,"text":"&quot;40000 images, 20000 from each gender.&quot; - Dude, do you want to trigger SJWs?","time":1493495334,"type":"comment"},{"by":"icantdrive55","dead":true,"id":14228279,"parent":14228128,"text":"We need to stop giving out our facial pictures freely.  Just post the back of your head.<p>I had a relative who went to a dentist last week.  The dentist wanted a head shot.  I told her, just tell him no, and unless your going to just accept what my insurance sends you, I&#x27;ll find another Wingnut.<p>Giving up our pictures is just crazy.<p>As to companies protecting data sets, there&#x27;s always a work around.  Taking a picture of the screen will always be available.","time":1493494414,"type":"comment"}],"id":14228128,"score":66,"url":"https://techcrunch.com/2017/04/28/someone-scraped-40000-tinder-selfies-to-make-a-facial-dataset-for-ai-experiments/","by":"denzil_correa"},"14227964":{"by":"ajschumacher","descendants":0,"id":14227964,"score":2,"time":1493490765,"title":"From Behaviorist to Constructivist AI","type":"story","url":"http://planspace.org/20170429-from_behaviorist_to_constructivist_ai/"},"14227872":{"time":1493489901,"type":"story","descendants":5,"title":"Pkg – Package your Node.js project into an executable","kids":[{"by":"gmemstr","id":14230051,"kids":[{"by":"STRML","id":14230416,"kids":[{"by":"oneweekwonder","id":14230499,"kids":[{"by":"STRML","id":14230547,"parent":14230499,"text":"It&#x27;s large, of course. But you have a full VM and a bunch of unminified javascript dependencies sitting in there. V8 isn&#x27;t known for being small, either.<p>Compared to a proper systems language it&#x27;s always going to look ridiculous. And it appears to be 3-4x larger than, say, py2exe. You can apparently get about a 30% reduction using `strip`, and there&#x27;s likely other low-hanging fruit.<p>It&#x27;s about 12MB compressed. It&#x27;s not so terrible in today&#x27;s world, and the simplicity at runtime is worthwhile IMO. I don&#x27;t worry too much about my tools getting larger, so long as they solve problems and don&#x27;t cause them.","time":1493537341,"type":"comment"}],"parent":14230416,"text":"37MB large or small in your world view?<p>I miss the days where the c guys mocked my statically linked 3mb delphi app for being large!<p>$%^&amp; I just realised I have a lawn!?! How times change.","time":1493536138,"type":"comment"}],"parent":14230051,"text":"Anecdotally, I built a small project (lambda fn) with just a single dependency (`request`) - the mac&#x2F;alpine node6 build was 37MB.","time":1493533975,"type":"comment"},{"by":"dvlsg","id":14233626,"parent":14230051,"text":"I would be interested in that. Do any of these solutions include source protection or v8 snapshots? I think I saw that the overhead of using snapshots is negligible with a recent update of v8 (at least according to the author of nwjs).","time":1493583787,"type":"comment"}],"parent":14227872,"text":"Reminds me a lot of nexe, a project a friend of mine is the maintainer of. I&#x27;d like to compare the differences between this, nexe and enclosejs, in terms of speed and final binary size.","time":1493523402,"type":"comment"}],"id":14227872,"score":55,"url":"https://github.com/zeit/pkg","by":"brentvatne"},"14228491":{"by":"franzunix","descendants":0,"id":14228491,"score":2,"time":1493496787,"title":"News for Last Week – Inside Dev","type":"story","url":"https://www.dailydrip.com/topics/weekly-drip/drips/railsconf-web-dev-roadmap-stanford-teaches-js-over-java"},"14228508":{"by":"lukasz_km","descendants":0,"id":14228508,"score":5,"time":1493496959,"title":"Deep Learning: Language Identification Using Keras and TensorFlow","type":"story","url":"http://machinelearningexp.com/deep-learning-language-identification-using-keras-tensorflow/"},"14227937":{"time":1493490514,"type":"story","descendants":0,"title":"How to test a Swift package on Linux using Docker","kids":[{"by":"balermata","dead":true,"id":14228327,"parent":14227937,"text":"<a href=\"https:&#x2F;&#x2F;www.reddit.com&#x2F;r&#x2F;livefightskytv&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.reddit.com&#x2F;r&#x2F;livefightskytv&#x2F;</a>","time":1493495003,"type":"comment"}],"id":14227937,"score":2,"url":"https://oleb.net/blog/2017/03/testing-swift-packages-on-linux/","by":"mpweiher"},"14228614":{"time":1493498234,"type":"story","descendants":2,"title":"Spotifork – Fork a Spotify playlist","kids":[{"by":"detaro","id":14228626,"parent":14228614,"text":"How do you use Spotify that getting the playlist ID and pasting it to a shell is faster than just copying the songs to a new playlist? I use the default client and that seems easier there.","time":1493498428,"type":"comment"},{"by":"kabirvirji","id":14228678,"parent":14228614,"text":"Just a cool fun side project, I personally found it easier","time":1493499206,"type":"comment"}],"id":14228614,"score":1,"url":"https://github.com/kabirvirji/spotifork","by":"kabirvirji"},"14228914":{"by":"dudeinahat","descendants":0,"id":14228914,"score":3,"time":1493501919,"title":"Using RxJS to handle HTTP requests","type":"story","url":"https://medium.com/@jamesflight/using-rxjs-to-handle-http-requests-what-ive-learned-4640aaf4646c"},"14227752":{"time":1493488346,"type":"story","descendants":20,"title":"Sizzy:Sizzy: A tool for developing responsive websites crazy-fast","kids":[{"by":"overshard","id":14228195,"kids":[{"by":"shakna","id":14229540,"kids":[{"by":"alwillis","id":14230103,"kids":[{"by":"shakna","id":14230131,"parent":14230103,"text":"&gt; 1. Safari is not the new IE by a long shot: <a href=\"https:&#x2F;&#x2F;webkit.org&#x2F;status&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;webkit.org&#x2F;status&#x2F;</a><p>Yes, they&#x27;ve made great strides with JavaScript future support... But they still have some major issues! [0]<p>Let me just draw out a few from that list that are supported by Chrome, not Safari on iOS 10.3, that really should have support:<p>* No public key pinning<p>* No paged media queries<p>* No ChaCha20 for TLS<p>* No FLAC, no Ogg Vorbis support<p>* No png favicons, because Apple is special and needs their own format that doesn&#x27;t comply with anybody else<p>* No download attribute.<p>* No resize attribute for CSS.<p>[0] <a href=\"http:&#x2F;&#x2F;caniuse.com&#x2F;#compare=ios_saf+10.3,and_chr+57\" rel=\"nofollow\">http:&#x2F;&#x2F;caniuse.com&#x2F;#compare=ios_saf+10.3,and_chr+57</a>","time":1493525509,"type":"comment"}],"parent":14229540,"text":"1. Safari is not the new IE by a long shot: <a href=\"https:&#x2F;&#x2F;webkit.org&#x2F;status&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;webkit.org&#x2F;status&#x2F;</a><p>2. iOS 7 was released September of 2013; that&#x27;s ancient history in the iOS ecosystem<p>3. the installed base of iOS 10 is a smidge under 80%; iOS 7 is likely around 1%: <a href=\"https:&#x2F;&#x2F;developer.apple.com&#x2F;support&#x2F;app-store&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;developer.apple.com&#x2F;support&#x2F;app-store&#x2F;</a>","time":1493524628,"type":"comment"}],"parent":14228195,"text":"iOS feels like the new IE when it comes to this stuff.<p>For example:<p>&gt; iOS 7 Safari recalculates widths set in vh as vw, and heights set in vw as vh, when orientation changes.<p>If you really want iOS customers to feel at home, a lot of the time you have no option but to specifically target all their screen sizes with media queries.","time":1493511651,"type":"comment"},{"by":"snewk","id":14228826,"parent":14228195,"text":"responsive design mode is included in safari as well","time":1493500914,"type":"comment"}],"parent":14227752,"text":"This is pretty cool for a basic preview but it really doesn&#x27;t solve the bigger issue of devices handling basic CSS inconsistently in many situations.<p>Example is sizing things using &quot;vh&quot; and &quot;vw&quot;. On iOS this has been, and still is, completely broken. It is &quot;supported&quot; but if you try to size something at &quot;100vh&quot; it will scale multiple views without additional CSS on breakpoints or some JavaScript hacks.<p>For me this is just a glorified &quot;Responsive Design Mode&quot; which is already built into Chrome and Firefox dev tools.","time":1493493239,"type":"comment"},{"by":"cocktailpeanuts","id":14228200,"parent":14227752,"text":"Unless I&#x27;m missing something major, the title is false advertisement. I was expecting some sort of next.js&#x2F;netlify&#x2F;etc. kind of service (or framework)<p>But this looks like just a way to try viewing web pages on small screens.","time":1493493259,"type":"comment"},{"by":"anotheryou","id":14228116,"kids":[{"by":"fimdomeio","id":14228140,"kids":[{"by":"anotheryou","id":14228156,"parent":14228140,"text":"With so many devices I just check iPhones and 1366x768, the rest I don&#x27;t tailor, just make sure my CSS handles all sizes well (by dragging arround the viewport in the chrome dev tolls device preview thingy)","time":1493492702,"type":"comment"}],"parent":14228116,"text":"I guess so. I would say in any case that it might come handy","time":1493492523,"type":"comment"}],"parent":14227752,"text":"&quot;A tool for previewing for responsive websites&quot;, nothing more, right?","time":1493492206,"type":"comment"},{"by":"aphextron","id":14228375,"kids":[{"by":"kt9","id":14228459,"parent":14228375,"text":"Here&#x27;s a post that an engineer on my team wrote about why we switched from NPM to Yarn<p><a href=\"http:&#x2F;&#x2F;www.blog.distelli.com&#x2F;single-post&#x2F;2016&#x2F;12&#x2F;14&#x2F;Why-we-switched-from-NPM-to-Yarn\" rel=\"nofollow\">http:&#x2F;&#x2F;www.blog.distelli.com&#x2F;single-post&#x2F;2016&#x2F;12&#x2F;14&#x2F;Why-we-s...</a>","time":1493496347,"type":"comment"},{"by":"fishnchips","id":14228446,"parent":14228375,"text":"It&#x27;s similar to Ruby&#x27;s Bundler in that it uses a lockfile with a list of exact versions of dependencies. As a result, you get a more deterministic setup. At least that&#x27;s the main benefit I see here.","time":1493496248,"type":"comment"}],"parent":14227752,"text":"Slightly unrelated; can some explain &quot;Yarn&quot; to me? What&#x27;s wrong with NPM? Is this legitimate?","time":1493495523,"type":"comment"},{"by":"borski","id":14228550,"kids":[{"by":"robalfonso","id":14228815,"kids":[{"by":"Geee","id":14229511,"kids":[{"by":"makaio","id":14229546,"parent":14229511,"text":"Disabling embedding in frames is the default on Rails now, so that feature would have to be specifically disabled to use with this tool.","time":1493511748,"type":"comment"}],"parent":14228815,"text":"Why do you disable loading in frames? Security?","time":1493511101,"type":"comment"}],"parent":14228550,"text":"Exactly - loaded it up with my site - all blank, thought about it for a second realized we disable Frame loading.  That&#x27;s becoming so common now, any tool using frames is really at a disadvantage.","time":1493500786,"type":"comment"}],"parent":14227752,"text":"I wish this didn&#x27;t use iframes, since so many applications set the X-Frame-Options header. That said, if I were using this against my own sites, I suppose I could just not serve that header.","time":1493497425,"type":"comment"},{"by":"brak1","id":14228295,"kids":[{"by":"RodericDay","id":14228359,"parent":14228295,"text":"I use Firefox, which also has a responsive mode, but unless I&#x27;m missing something, the built-in tools don&#x27;t load multiple copies of the website in different sizes side-by-side.<p>I have my own version of this tool (trivial javascript + iframes), and I use it frequently for one-glance CSS changes.","time":1493495383,"type":"comment"}],"parent":14227752,"text":"whats the difference between this and using Chrome&#x27;s built in responsive tools? (<a href=\"https:&#x2F;&#x2F;developers.google.com&#x2F;web&#x2F;tools&#x2F;chrome-devtools&#x2F;device-mode&#x2F;emulate-mobile-viewports\" rel=\"nofollow\">https:&#x2F;&#x2F;developers.google.com&#x2F;web&#x2F;tools&#x2F;chrome-devtools&#x2F;devi...</a>)","time":1493494650,"type":"comment"},{"by":"tomcam","id":14228404,"parent":14227752,"text":"The idiot poster had a problem with mobile--sorry for the weird title :O","time":1493495757,"type":"comment"},{"by":"starik36","id":14228162,"parent":14227752,"text":"Wow, excellent. Useful right off the bat!","time":1493492734,"type":"comment"}],"id":14227752,"score":52,"url":"https://github.com/kitze/sizzy","by":"tomcam"},"14228314":{"by":"dsr12","descendants":0,"id":14228314,"score":2,"time":1493494861,"title":"Uber Doesn't Want to Share Self-Driving Car Crash Data with the DMV","type":"story","url":"https://motherboard.vice.com/en_us/article/uber-doesnt-want-to-share-self-driving-car-crash-data-with-the-dmv"},"14227813":{"time":1493489244,"type":"story","descendants":8,"title":"Create Next App","kids":[{"by":"fouadmatin","id":14228117,"kids":[{"by":"cies","id":14228714,"parent":14228117,"text":"I&#x27;d love to see an `--with-alt-js` flag where I can put values like &quot;reason&quot; or &quot;purescript&quot;. :)","time":1493499667,"type":"comment"}],"parent":14227813,"text":"Hey HN! I&#x27;m Fouad from engineering team at Segment.<p>We built `create-next-app` after we started playing around with Next.js a couple months ago and slowly found ourselves creating more &amp; more micro-next websites. When optimizing React for SEO or fast page loads, you really need to render pages server-side and Next makes that incredibly easy.<p>We&#x27;d been using Create React App for a while for UIs on top of our backend services and thought why can&#x27;t we just use Next the same way?<p>Here&#x27;s how it works:<p>$ npm install -g create-next-app\n$ create-next-app my-app<p>or<p>$ create-next-app --example with-socket.io my-app<p>(search through examples at <a href=\"https:&#x2F;&#x2F;open.segment.com&#x2F;create-next-app#examples\" rel=\"nofollow\">https:&#x2F;&#x2F;open.segment.com&#x2F;create-next-app#examples</a>)<p>We have a few more ideas for how to improve (like combining examples!) and would love feedback on what y&#x27;all would like to see - let us know here: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;segmentio&#x2F;create-next-app&#x2F;issues\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;segmentio&#x2F;create-next-app&#x2F;issues</a>","time":1493492216,"type":"comment"},{"by":"patates","id":14228026,"kids":[{"by":"fouadmatin","id":14228130,"parent":14228026,"text":"Ah that&#x27;s a good point! Usually when we ran this it was in the office, I just created an issue for it <a href=\"https:&#x2F;&#x2F;github.com&#x2F;segmentio&#x2F;create-next-app&#x2F;issues&#x2F;2\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;segmentio&#x2F;create-next-app&#x2F;issues&#x2F;2</a>","time":1493492435,"type":"comment"}],"parent":14227813,"text":"Not to take away from your great work but... No love for offline?","time":1493491337,"type":"comment"},{"by":"jaequery","id":14227880,"kids":[{"by":"tristanz","id":14227898,"parent":14227880,"text":"<a href=\"https:&#x2F;&#x2F;github.com&#x2F;segmentio&#x2F;create-next-app\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;segmentio&#x2F;create-next-app</a>","time":1493490141,"type":"comment"},{"by":"fouadmatin","id":14227933,"kids":[{"by":"jaequery","id":14228141,"parent":14227933,"text":"cool no worries, thx!","time":1493492524,"type":"comment"}],"parent":14227880,"text":"Sorry about that! We were pulling Github for the Next.js examples section and forgot to deploy caching + silencing that error.","time":1493490491,"type":"comment"}],"parent":14227813,"text":"500 error","time":1493489961,"type":"comment"}],"id":14227813,"score":57,"url":"https://open.segment.com/create-next-app","by":"montogeek"},"14228913":{"by":"tgragnato","descendants":0,"id":14228913,"score":3,"time":1493501911,"title":"Compromise recovery on Qubes OS: individual VMs and full system cases","type":"story","url":"https://blog.invisiblethings.org/2017/04/26/qubes-compromise-recovery.html"},"14228595":{"time":1493497966,"type":"story","descendants":1,"title":"Is there any way to truly secure Docker container contents?","kids":[{"by":"kuschkufan","id":14236176,"parent":14228595,"text":"Might there be a better time of day to try and repost this?","time":1493625605,"type":"comment"}],"id":14228595,"score":3,"url":"http://changelog.complete.org/archives/9782-is-there-any-way-to-truly-secure-docker-container-contents","by":"mwcampbell"},"14228123":{"by":"azuajef","descendants":0,"id":14228123,"score":2,"time":1493492301,"title":"The-next-generation-of-jobs-wont-be-made-up-of-professions","type":"story","url":"http://www.bbc.com/capital/story/20170424-the-next-generation-of-jobs-wont-be-made-up-of-professions"},"14227737":{"by":"kordless","descendants":0,"id":14227737,"score":1,"time":1493488190,"title":"Litecoin's SegWit Activation: Why It Matters and What's Next","type":"story","url":"http://www.coindesk.com/litecoins-segwit-activation-why-it-matters-and-whats-next/?utm_content=buffer6103a&utm_medium=social&utm_source=twitter.com&utm_campaign=buffer"},"14228591":{"time":1493497886,"type":"story","descendants":68,"title":"Mosh v1.3 Released","kids":[{"by":"st3fan","id":14229442,"kids":[{"by":"shakna","id":14229495,"parent":14229442,"text":"&gt; And specifically, no good Mobile clients.<p>I use JuiceSSH [0] on Android, which is based around mosh-client. It works great... What precisely do you mean by the above?<p>[0] <a href=\"https:&#x2F;&#x2F;juicessh.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;juicessh.com&#x2F;</a>","time":1493510868,"type":"comment"},{"by":"tptacek","id":14232414,"kids":[{"by":"Shish2k","id":14237846,"kids":[{"by":"tptacek","id":14240262,"parent":14237846,"text":"You have one cipher, deployed in exactly one authenticated encryption construction. The protocol has a version. If the cipher is weakened or broken, you upgrade <i>the whole protocol</i>. You don&#x27;t add better ciphersuites to the existing protocol to compensate.<p>Having a bunch of ciphersuites, all believed at the time of their inclusion to be strong, just maximizes the attack surface of the protocol. Having ciphersuite negotiation at all practically guarantees that interoperability will require lowest-common-denominator security.","time":1493664152,"type":"comment"}],"parent":14232414,"text":"&gt; Meanwhile, configurable &quot;cipher schemes&quot; have in practice been a disaster. They are, for instance, the reason we still have RC4 in TLS today, despite knowing for almost 2 decades now that RC4 is broken.<p>If TLS had hard-coded RC4 with no alternatives, how would we be better off?","time":1493649957,"type":"comment"}],"parent":14229442,"text":"This is a red herring. OCB --- which is possibly the best &quot;mainstream&quot; authenticated encryption construction --- has a blanket patent license for open source software. It applies to any software licensed under any license recognized by OSI, and its only restriction is that the license is withdrawn if you initiate patent litigation.<p>OCB should be far more widely used than it is.<p>Meanwhile, configurable &quot;cipher schemes&quot; have in practice been a disaster. They are, for instance, the reason we still have RC4 in TLS today, despite knowing for almost 2 decades now that RC4 is broken.","time":1493570814,"type":"comment"},{"by":"JdeBP","id":14231120,"parent":14229442,"text":"One reason that independent alternatives do not exist is nothing to do with patents, and everything to do with the protocol never actually being properly documented.<p>* <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=11612615\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=11612615</a><p>Make that 5 years and counting.","time":1493552969,"type":"comment"},{"by":"jitl","id":14229590,"kids":[{"by":"st3fan","id":14229823,"kids":[{"by":"brians","id":14229828,"kids":[{"by":"goerz","id":14232197,"parent":14229828,"text":"Why do you think it&#x27;s missing it? It has the same persistence as the mosh-client on a deskop. That is, the connection will persist as long as the client process exists. If you are observing anything else, that would justify a bug report on Blink. The one complication is that iOS can sometimes kill background processes at will, which would also kill the mosh-connection. As far as I know, the Blink team is currently working on dealing with this better (issue #59). It shouldn&#x27;t happen very often, though, and I&#x27;ve certainly had Blink persist in the background for multiple days.","time":1493568635,"type":"comment"}],"parent":14229823,"text":"It is missing the one crucial feature: resuming the last session after a while away!","time":1493518233,"type":"comment"}],"parent":14229590,"text":"It is not bad. But it took 5 years.","time":1493518135,"type":"comment"}],"parent":14229442,"text":"Is Blink &quot;bad&quot;? It works for me.<p><a href=\"http:&#x2F;&#x2F;www.blink.sh\" rel=\"nofollow\">http:&#x2F;&#x2F;www.blink.sh</a>","time":1493512669,"type":"comment"},{"by":"Flowdalic","id":14230617,"kids":[{"by":"tptacek","id":14232453,"kids":[{"by":"st3fan","id":14234878,"kids":[{"by":"tptacek","id":14235595,"parent":14234878,"text":"It&#x27;s not vague: it&#x27;s not connected to OpenSSL. You do not need permission; you need to use an OSI-compliant license for your software.","time":1493613372,"type":"comment"}],"parent":14232453,"text":"The license terms are vague. Is it connected to OpenSSL or not? Do you have to ask the author permission or not? And it is limited to open source software.<p>Nobody wants to involve expensive lawyers, so for many folks that rules out OCB.<p>Mosh is a great idea, but by connecting it to OCB, the authors completely stalled more widespread adoption. That, and like you said, the complete lack of protocol spec.","time":1493601398,"type":"comment"}],"parent":14230617,"text":"&quot;Open standard&quot; doesn&#x27;t really mean anything. It&#x27;s standardized, in that there is a standard (actually, multiple compatible standards) that you can code to and end up with interoperable OCB. The complaint upthread is that OCB is patented, which it is. But for many years now, OCB has been free for open source software.","time":1493571092,"type":"comment"}],"parent":14229442,"text":"&gt; The reliance on OCB is unfortunate. I wish the Mosh developers would introduce multiple cipher schemes so that people can move away from OCB.<p>Isn&#x27;t OCB an open standard? <a href=\"https:&#x2F;&#x2F;www.rfc-editor.org&#x2F;rfc&#x2F;rfc7253.txt\" rel=\"nofollow\">https:&#x2F;&#x2F;www.rfc-editor.org&#x2F;rfc&#x2F;rfc7253.txt</a>","time":1493539663,"type":"comment"}],"parent":14228591,"text":"Mosh would be more widely available, outside of just this &#x27;reference implementation&#x27;, if it did not use patent encumbered OCB crypto.<p>Phillip Rogaway holds patents relevant to OCB. See the following for his patent grant: <a href=\"http:&#x2F;&#x2F;www.cs.ucdavis.edu&#x2F;~rogaway&#x2F;ocb&#x2F;grant.htm\" rel=\"nofollow\">http:&#x2F;&#x2F;www.cs.ucdavis.edu&#x2F;~rogaway&#x2F;ocb&#x2F;grant.htm</a><p>I think this is the primary reason why there are still no alternative clients. And specifically, no good Mobile clients.<p>The reliance on OCB is unfortunate. I wish the Mosh developers would introduce multiple cipher schemes so that people can move away from OCB.<p>Unfortunately the protocol is also pretty poorly designed, with no easy backward compatible way to do this.<p>For example, when a client starts a session, the server prints &quot;MOSH CONNECT 60001 sdmDrHqo8DBdpKxtAFAUyw&quot; where the last part is the OCB key. It should have been prefixed with the ciper type for extensibility, but it is not. So this would need a backward incompatible redesign to get it going.","time":1493509808,"type":"comment"},{"by":"jiqiren","id":14229043,"kids":[{"by":"feld","id":14229753,"kids":[{"by":"jiqiren","id":14234808,"kids":[{"by":"feld","id":14236660,"parent":14234808,"text":"X Forwarding and TCP Forwarding is also insecure. Not everyone has the same threat model, but for the average person it&#x27;s a bad idea to do agent Forwarding unless they fully understand the consequences. This doesn&#x27;t mean the OpenSSH team should remove it.","time":1493635670,"type":"comment"}],"parent":14229753,"text":"This link is full of counter arguments the author even concedes. If this is so serious why doesn&#x27;t openssh team remove the feature?<p>There is no excuse for denying mosh users existing patches&#x2F;features and the above link changes nothing.","time":1493600089,"type":"comment"}],"parent":14229043,"text":"Ssh agent forwarding is insecure. Don&#x27;t use it.<p><a href=\"https:&#x2F;&#x2F;heipei.github.io&#x2F;2015&#x2F;02&#x2F;26&#x2F;SSH-Agent-Forwarding-considered-harmful&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;heipei.github.io&#x2F;2015&#x2F;02&#x2F;26&#x2F;SSH-Agent-Forwarding-con...</a>","time":1493516443,"type":"comment"},{"by":"emmelaich","id":14229410,"kids":[{"by":"jitl","id":14229571,"parent":14229410,"text":"A patch for SSH Agent forwarding has existed for 4+ years, and there have been several iterations of PRs to merge that into Mosh. The maintainers don&#x27;t care enough to merge working code for an oft-requested feature.<p>PRs:<p>Most recent: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;mobile-shell&#x2F;mosh&#x2F;pull&#x2F;696\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;mobile-shell&#x2F;mosh&#x2F;pull&#x2F;696</a><p>Oldest: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;mobile-shell&#x2F;mosh&#x2F;pull&#x2F;423\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;mobile-shell&#x2F;mosh&#x2F;pull&#x2F;423</a><p><a href=\"https:&#x2F;&#x2F;github.com&#x2F;mobile-shell&#x2F;mosh&#x2F;pull&#x2F;583\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;mobile-shell&#x2F;mosh&#x2F;pull&#x2F;583</a>","time":1493512391,"type":"comment"},{"by":"st3fan","id":14229456,"kids":[{"by":"tibbetts","id":14230913,"parent":14229456,"text":"I figure this can go along like screen for a long time. I remember in about 1999 I was really annoyed that screen wasn&#x27;t getting better fast enough and no one wanted my patches. Then I got used to using screen and it was fine. Now the cool kids use tmux or something and I can&#x27;t be bothered to change, but I am abstractly glad the world is improving. Similarly I expect someone to clone&#x2F;replace&#x2F;improve mosh, and for people who demand the best new functionality to eventually head there.","time":1493548243,"type":"comment"}],"parent":14229410,"text":"No, what it shows is that this project is just in maintance mode. There is plenty to be improved, but there is zero momentum.<p>This is hard for open source projects in general. What it needs is not just a happy user base, but also developers and a strong leader wanting to move this into the future. I think specially the latter is missing. I think Mosh was a great thesis project, but stalled after that.<p>It has so much potential. I wish they would push this to the next level and do proper protocol documentation and an IETF proposal like an RFC.","time":1493510115,"type":"comment"}],"parent":14229043,"text":"To be clear a FeatureRequest not a Bug. So I think the age is understandable.","time":1493509065,"type":"comment"}],"parent":14228591,"text":"SSH Agent forwarding issue &gt;5years old now. :(\n<a href=\"https:&#x2F;&#x2F;github.com&#x2F;mobile-shell&#x2F;mosh&#x2F;issues&#x2F;120\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;mobile-shell&#x2F;mosh&#x2F;issues&#x2F;120</a>","time":1493503817,"type":"comment"},{"by":"therealmarv","id":14229181,"kids":[{"by":"yebyen","id":14229199,"kids":[{"by":"geofft","id":14229268,"kids":[{"by":"nojvek","id":14229377,"kids":[{"by":"geofft","id":14229502,"kids":[{"by":"yebyen","id":14229747,"kids":[{"by":"geofft","id":14232810,"parent":14229747,"text":"That&#x27;s probably doable. I think you don&#x27;t want to start with the patch I linked, since that disables <i>all</i> terminal sync and all use of the Terminal classes. Instead, try editing Terminal::Framebuffer to have a concept of both normal rows and scrollback rows, and adjust Terminal::Display&#x27;s new_frame function to sync the scrollback rows in some different way. Note that there&#x27;s already some code in that function to do scrollback, if the diff between two frames consists of scrolling.<p>(I haven&#x27;t really contributed to mosh and haven&#x27;t looked at the codebase in years, so asking on the mailing list or IRC is probably a better place to start)","time":1493574416,"type":"comment"}],"parent":14229502,"text":"How many kilobytes are in 10000 lines of text?  Less than about a megabyte, right...<p>There could be a happy medium mode or setting that enables scrolling as you described by emulating the keyboard behavior, but mosh would recognize through some buffer capacity if you catted more than about 1MB and skip to printing the last 0.75MB of it.  (Makes me want to go on and read that patch you sent to see if I can get it to work like that...)<p>You probably didn&#x27;t mean to read more than about 1000 lines of text into your terminal so you could mouse cursor select it by hand into your paste-buffer.  You answered very informatively, thank you.","time":1493516194,"type":"comment"}],"parent":14229377,"text":"But native scroll is <i>native</i>. There&#x27;s no way for mosh, a program running inside the terminal, to know when a user is trying to scroll, and fetch data then.<p>If you want non-native scroll, just nest mosh inside screen&#x2F;tmux.<p>(That may actually be why my theory doesn&#x27;t work: once a line has scrolled off the screen, there&#x27;s no way to update it, I think. So even if mosh wanted to do background, low-priority sync of scrollback, it couldn&#x27;t. The only way to update the scrollback is to write the scrollback <i>before</i> writing the current screen.)","time":1493510976,"type":"comment"}],"parent":14229268,"text":"I think mosh could be improved with a single trick. Native scrolling for last 10000 lines is super useful.  however 99% of time user only looks at say 150x80 chr screen.<p>Mosh syncing that 150x80 screen is a superb idea. Udp is great for mobile hotspot connections. However mosh server should save a buffer of 150x10000 on server side. Only sync 150x80 but If user uses native scroll then it should ask server for last X lines depending on scroll position.","time":1493508677,"type":"comment"}],"parent":14229199,"text":"It&#x27;s &quot;impossible&quot; as defined because the advantage of Mosh is it synchronizes your current screen (the visible, 80x25 or whatever part) as if it were frames in a variable-bandwidth video stream. So, if you&#x27;re behind a very bad connection and you cat a large file, the scrolling all happens server-side, the intermediate frames get <i>dropped</i>, and only the final frame actually gets sent to the client.<p>Meanwhile, in ssh, if you&#x27;re behind a very bad connection and you cat a large file, your TCP bandwidth gets throttled down, but it still has to send the <i>entire</i> file over the connection, driving performance way down.<p>There is a fork of mosh (<a href=\"https:&#x2F;&#x2F;github.com&#x2F;4ast&#x2F;mosh&#x2F;commits&#x2F;master\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;4ast&#x2F;mosh&#x2F;commits&#x2F;master</a> , primarily the &quot;use UserStream instead of Terminal&quot; commit) which disables the frame-sync behavior and just uses the byte-stream-sync code (which is used for keyboard data) to sync the raw bytes &#x2F; ANSI escape codes back to the client. I haven&#x27;t tried this, but my guess is that you&#x27;d be very sad once you accidentally catted a large file, but if you manage to never do that, you&#x27;ll get mosh-like behavior but also scrollback.<p>I think you could also change the mosh model to involve maintaining scrollback server-side and syncing it (so you&#x27;d render and sync a (80+10000)x25 array, not just the last 80 lines), possibly at lower priority than the non-scrollback portion of the screen. I don&#x27;t know if anyone&#x27;s tried implementing this.<p>(Personally I just use screen anyway, so this isn&#x27;t a major pain point for me)","time":1493507281,"type":"comment"},{"by":"therealmarv","id":14229300,"parent":14229199,"text":"It&#x27;s impossible by the design of mosh. Mosh transmitts the current state only... it does not care about the past, so you know what currently happens. Imagine your connection is lost for 2 seconds (or many hours&#x2F;days) and you reconnect... then you will get the current state right back but not everything from the past will be transmitted. So screen or tmux saves you there.","time":1493507641,"type":"comment"},{"by":"joshka","id":14229278,"kids":[{"by":"yebyen","id":14246153,"parent":14229278,"text":"This link might actually be close enough to native scrolling for me, thanks!","time":1493731852,"type":"comment"}],"parent":14229199,"text":"Try tmux perhaps?\n<a href=\"http:&#x2F;&#x2F;www.davidverhasselt.com&#x2F;better-mouse-scrolling-in-tmux&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.davidverhasselt.com&#x2F;better-mouse-scrolling-in-tmu...</a>","time":1493507390,"type":"comment"},{"deleted":true,"id":14229562,"parent":14229199,"time":1493512012,"type":"comment"}],"parent":14229181,"text":"I would rather have the terminal&#x27;s native scrolling... is that really impossible with mosh?  I know I can use screen but I don&#x27;t like screen&#x27;s scrolling behavior.","time":1493506196,"type":"comment"}],"parent":14228591,"text":"Used moshed a lot when I was travelling in the Philippines and done some devops on US servers. It works great and better than ssh (compressed), even with flakky bad connection, high ping to US and 500Kb&#x2F;s on an island.<p>Tip for getting scrolling back also working:<p><pre><code>    mosh yourserver -- screen\n</code></pre>\nCtrl+a Esc let&#x27;s you scroll through your screen (with iTerm also with your mouse scroll).","time":1493505898,"type":"comment"},{"by":"chatmasta","id":14229038,"kids":[{"by":"weitzj","id":14229277,"kids":[{"by":"cookiecaper","id":14229350,"parent":14229277,"text":"Not the guy you asked, but for me, nested tmux is usually just pressing the hotkey twice. ^b^b &lt;cmd&gt; for nested and ^b &lt;cmd&gt; for parent.","time":1493508249,"type":"comment"}],"parent":14229038,"text":"How do you handle the nested tmux shortcuts? Just another keybinding?","time":1493507373,"type":"comment"}],"parent":14228591,"text":"Mosh is the best kind of software. It&#x27;s an indispensable tool that I use every day without even noticing I&#x27;m using it because it does its one job very well.<p>I run tmux with nested tmux over a mosh session in a pane for each remote server.","time":1493503734,"type":"comment"},{"by":"tombert","id":14229665,"kids":[{"by":"fishnchips","id":14230461,"kids":[{"by":"tombert","id":14231242,"parent":14230461,"text":"For that, just running my stuff in tmux is generally sufficient.","time":1493555532,"type":"comment"}],"parent":14229665,"text":"Yes and no. I don&#x27;t use mosh these days, mostly because SSH is perfectly fine for my current use case of occasionally having to log in to a remote server and perform some quick one-off task. When I did on-call shifts for large production systems, often with complex tasks that took a while to complete - that&#x27;s when the combination of Mosh and tmux on a remote machine came in very handy.","time":1493535109,"type":"comment"}],"parent":14228591,"text":"I like Mosh, but it&#x27;s one of those programs that&#x27;s &quot;insufficiently better&quot; for me to use, especially since it doesn&#x27;t implement all the features of ssh.","time":1493514573,"type":"comment"},{"by":"Zarel","id":14230735,"kids":[{"by":"tibbetts","id":14230895,"parent":14230735,"text":"Just have your mosh server attached to a screen client package (by connecting with &quot;mosh hostname -- screen -rd&quot;) and then when you detach that screen client it will terminate the now-useless mosh server. I think that&#x27;s how most mosh developers do it.","time":1493547923,"type":"comment"}],"parent":14228591,"text":"I&#x27;ve been using mosh a lot because I travel a lot so my internet is pretty questionable most of the time.<p>My main issue with it is that it can&#x27;t clean up after itself.<p>When I log in, I always get multiple messages like &quot;Mosh: You have a detached Mosh session on this server (mosh [25933]).&quot; These are because I closed mosh (e.g. restarted my computer) while not connected to the internet. Especially since mosh is made for unreliable internet connections, you&#x27;d think it&#x27;d be better about this.<p>mosh says it can&#x27;t automatically deal with these sessions (e.g. by reconnecting) because it&#x27;s not the same mosh process that opened them, but it&#x27;s the same computer. It shouldn&#x27;t be too hard to write the information necessary to reconnect to disk.","time":1493543212,"type":"comment"},{"by":"daleroberts","id":14228889,"kids":[{"by":"geofft","id":14229355,"parent":14228889,"text":"Here&#x27;s the upstream issue: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;mobile-shell&#x2F;mosh&#x2F;issues&#x2F;649\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;mobile-shell&#x2F;mosh&#x2F;issues&#x2F;649</a><p>Looks like it&#x27;s a desired feature, but just requires some work (in part around parsing the extended escape sequences correctly).","time":1493508391,"type":"comment"},{"by":"cyruscm","id":14229059,"kids":[{"by":"baobrien","id":14229328,"parent":14229059,"text":"I don&#x27;t think mosh is just an SSH wrapper. IIRC, it uses SSH to start a mosh session on the server side, but from there it uses it&#x27;s own UDP based protocol to sync the terminal &#x27;framebuffer&#x27; instead of sending character streams.","time":1493507897,"type":"comment"},{"by":"jck","id":14229332,"parent":14229059,"text":"Mosh is not a shower wrapper. They support ssh auth, but that&#x27;s about it.","time":1493507905,"type":"comment"}],"parent":14228889,"text":"Considering mosh is a wrapper for ssh, it is very unlikely they&#x27;ll work on 24 bit color","time":1493504015,"type":"comment"},{"by":"BillinghamJ","id":14229024,"parent":14228889,"text":"Seems reasonable given its intended purpose. Why do you particularly want that?","time":1493503465,"type":"comment"}],"parent":14228591,"text":"Still no true color support? :-(","time":1493501649,"type":"comment"},{"by":"scriptdevil","id":14230126,"parent":14228591,"text":"I don&#x27;t know why this isn&#x27;t plugged more, but on a Windows laptop, I found <a href=\"https:&#x2F;&#x2F;github.com&#x2F;rpwoodbu&#x2F;mosh-chrome\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;rpwoodbu&#x2F;mosh-chrome</a> the best client to connect to remote Linux machines. mosh-chrome+tmux is so good that I got a tonne of my friends who previously used VNCs to switch. You can get as good a screen resolution as you want with all your favorite fonts - I use Fira Code that I couldn&#x27;t get working in putty.","time":1493525420,"type":"comment"},{"by":"xmichael99","id":14229080,"kids":[{"by":"JdeBP","id":14231059,"parent":14229080,"text":"Don&#x27;t fall into the trap of thinking that mosh is based upon SSH, that mosh is just another SSH client.  mosh is not &quot;mosh special&quot; SSH in place of &quot;normal&quot; SSH.  The actual main run-time operation of mosh <i>does not involve SSH at all</i>.<p>It is not even architecturally the same as SSH.  mosh runs an internal terminal emulator on the server machine.  SSH employs an external terminal emulator on the client machine.  The terminal emulator on the server machine <i>is</i> the mosh-server program, which is necessary for this architecture to work.  If there is no server-side program installed, part of the overall system is missing, for which SSH is <i>not</i> a substitute.<p>mosh <i>uses</i> SSH, but <i>merely</i> at client startup, as a means of remotely executing the server command that it speaks to and exchanging a shared secret with it.  In theory, it could even be changed to use something other than SSH for that, without changing the primary operation of the mosh client and server.  (Parsing the output of a shell, including the output of whatever non-interactive startup scripts that shell may run, for a magic sequence is a somewhat rickety mechanism; reminiscent of Fidonet handshakes and Zmodem, but not done as well as they.)","time":1493551836,"type":"comment"},{"by":"Gaelan","id":14229888,"parent":14229080,"text":"Even better: use the SSH connection to drop a statically-linked mosh-server in &#x2F;tmp (or ~) and use that.","time":1493519320,"type":"comment"},{"by":"apostacy","id":14229103,"kids":[{"by":"geofft","id":14229308,"parent":14229103,"text":"Mosh already negotiates an ssh connection, so I <i>think</i> you can do this safely - attempt to execute mosh-server, if the execution fails, open a normal shell and proxy the data back to the original screen.<p>You probably don&#x27;t want mosh to do the proxying, since ssh (the client) is a pretty involved program - it handles signals, it supports port-forwarding, etc.<p>I sort of suspect SSH ControlMaster would work. I could imagine a mosh client script that sets ControlMaster=yes and a random ControlPath, tries to mosh, and runs ssh -o ControlMaster=no if it fails. And then unconditionally does an ssh -o ControlMaster=no -O exit.","time":1493507694,"type":"comment"},{"by":"xmichael99","id":14229128,"parent":14229103,"text":"No, it is only a terminal.<p>mosh root@192.168.1.10\nroot@192.168.1.10&#x27;s password: \nbash: mosh-server: command not found\nConnection to 192.168.1.10 closed.\n&#x2F;usr&#x2F;local&#x2F;bin&#x2F;mosh: Did not find mosh server startup message. (Have you installed mosh on your server?)<p>I&#x27;m pretty sure they could just change it to execute &#x2F;usr&#x2F;local&#x2F;bin&#x2F;mosh;&#x2F;bin&#x2F;bash without much of an issue. As that is all it is, it is a terminal.","time":1493505023,"type":"comment"}],"parent":14229080,"text":"I&#x27;m sure there are good security reasons. ssh is very conservative about how it is invoked.","time":1493504632,"type":"comment"},{"by":"samtregar3","id":14229101,"kids":[{"by":"nojvek","id":14229394,"kids":[{"deleted":true,"id":14229455,"parent":14229394,"time":1493510091,"type":"comment"}],"parent":14229101,"text":"To be honest I find C&#x2F;C++ quite scary. I would love to get better but I had a very bad taste when I was in school.<p>Now if this was javascript, I&#x27;d be all over it.","time":1493508826,"type":"comment"}],"parent":14229080,"text":"Sounds like a nice idea - maybe offer them a patch?","time":1493504608,"type":"comment"}],"parent":14228591,"text":"Mosh is great, however, I don&#x27;t understand why it can&#x27;t safely failback to regular SSH mode. My point being if the server I am connecting to doesn&#x27;t have Mosh installed why can&#x27;t it just warn, and then proceed as a normal SSH session. E.g. if mosh is there you get the benefits of mosh, if its not there well you still got a regular ssh.","time":1493504370,"type":"comment"},{"by":"mwcampbell","id":14229119,"kids":[{"by":"moosingin3space","id":14230088,"kids":[{"by":"Buge","id":14230706,"kids":[{"by":"JdeBP","id":14230969,"kids":[{"by":"Shish2k","id":14237907,"kids":[{"by":"JdeBP","id":14274817,"parent":14237907,"text":"Incorrect.  TCP does not work that way and the failure mode is nowhere near that smooth.  I suggest actually trying it.<p>No cheating and watching Keith Winstein&#x27;s video on the mosh WWW site, which shows what actually happened in the case of one fairly well-known WWW app, now!  (-:","time":1494002858,"type":"comment"}],"parent":14230969,"text":"&gt; Try roaming whilst one of those HTTP transactions is in progress<p>That specific connection silently fails, then the app silently retries, and succeeds - from the end user&#x27;s perspective, they&#x27;ve switched IP addresses and the webapp still works fine.","time":1493650266,"type":"comment"}],"parent":14230706,"text":"You&#x27;ve glossed over the part about TCP connections.  Try roaming <i>whilst one of those HTTP transactions is in progress</i>.","time":1493549852,"type":"comment"}],"parent":14230088,"text":"Most interactive webapps such as gmail send many HTTP requests. And those requests do not have to be over the same TCP connection. So the webapp could continue to work even if you change IPs. Any requests going at the time of the change would fail, but ideally the javascript of the app would retry them.","time":1493542217,"type":"comment"}],"parent":14229119,"text":"A TCP connection is identified by the tuple of (source IP, source port, destination IP, destination port), therefore whenever one side&#x27;s IP changes (the effect of roaming), the connection has to be re-established.<p>Mosh is built on UDP, where there are no &quot;connections&quot; and the wire protocol is stateless, so when the client IP changes, that endpoint simply transmits some &quot;session cookie&quot; information to the server, which allows it to carry on, uninterrupted.<p>HTTP runs over TCP, so it cannot roam like mosh does. QUIC (Google&#x27;s experimental HTTP&#x2F;2, TLS, and UDP integration) is interesting in part for this reason.","time":1493524346,"type":"comment"},{"by":"fulafel","id":14230342,"parent":14229119,"text":"They expand on the Gmail issue thusly:<p>&gt; fancy apps like Gmail-in-Chromium or on Android still behave atrociously on dodgy connections or after switching IP addresses. (Have you ever had Gmail leave an e-mail message in &quot;Sending...&quot; for ten hours while merrily retrieving new mail and not indicating any kind of error? Us too.)<p>So it&#x27;s about the mobile app, not the web app. Not necessarily HTTP. Maybe someone who knows more about Android can say what happens to existing TCP connections when roaming. Or what protocol the Gmail app is using.","time":1493532197,"type":"comment"},{"by":"revelation","id":14229560,"parent":14229119,"text":"HTTP uses TCP, which is always terribly slow to establish a connection, often useless with high packet loss.<p>Mosh is UDP, so there is no connection establishment (no need for multiple initial round trips before sending one bit of data) and no indiscriminate retransmission of data. Additionally, you can just continue sending data when your IP changes, connections aren&#x27;t lost. That typically happens when in a train and you&#x27;re quickly traversing multiple cells.","time":1493511991,"type":"comment"}],"parent":14228591,"text":"The home page says that web apps like Gmail don&#x27;t support roaming as mosh does. Why would that be the case? After all, web apps use HTTP requests, which are fundamentally transient (though persistent connections are available as an optimization). Do long polling and WebSockets mess this up?","time":1493504927,"type":"comment"},{"by":"iso-8859-1","id":14230875,"kids":[{"by":"JdeBP","id":14230935,"parent":14230875,"text":"That is a slipshod statement that is not true.  See <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=11573487\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=11573487</a> for some more accurate information.","time":1493548716,"type":"comment"}],"parent":14228591,"text":"Please note that Mosh does still not support IPv6...","time":1493547501,"type":"comment"},{"by":"placeybordeaux","id":14229655,"parent":14228591,"text":"No true color :&#x27;(","time":1493514323,"type":"comment"},{"by":"simooooo","id":14230565,"kids":[{"by":"skrebbel","id":14230581,"parent":14230565,"text":"It&#x27;s not a &quot;text based page&quot;, it&#x27;s a mailinglist archive page. The release was done by sending an email to a list.","time":1493538407,"type":"comment"}],"parent":14228591,"text":"This text based page is not a cool way to do a release","time":1493538087,"type":"comment"}],"id":14228591,"score":138,"url":"http://mailman.mit.edu/pipermail/mosh-users/2017-March/000341.html","by":"nikolay"},"14228038":{"by":"ishtiaq","descendants":0,"id":14228038,"score":1,"time":1493491433,"title":"Learning at Scale and the End of “If -Then” Logic","type":"story","url":"https://medium.com/archieai/learning-at-scale-the-end-of-if-then-logic-bd3a4e292222"},"14228802":{"by":"pjmlp","descendants":0,"id":14228802,"score":3,"time":1493500644,"title":"2017 EuroLLVM, Delivering Sample-Based PGO for PlayStation(R)4","type":"story","url":"https://www.youtube.com/watch?v=ceCEXnuWdmo"},"14228033":{"by":"happy-go-lucky","descendants":0,"id":14228033,"score":2,"time":1493491405,"title":"Hacker Releases New Episodes of 'Orange Is the New Black'","type":"story","url":"http://www.hollywoodreporter.com/news/hacker-threatens-release-new-episodes-orange-is-new-black-998670"},"14228436":{"by":"samuraibunny","descendants":0,"id":14228436,"score":1,"time":1493496116,"title":"The Most Interesting CEO in the World","type":"story","url":"https://www.lazyunicorn.com/the-most-interesting-ceo-in-the-world/"},"14227968":{"by":"shawndumas","descendants":0,"id":14227968,"score":1,"time":1493490807,"title":"No bones needed: ancient DNA in soil can tell if humans were around","type":"story","url":"https://arstechnica.com/science/2017/04/no-bones-needed-ancient-dna-in-soil-can-tell-if-humans-were-around/"},"14228624":{"by":"sharp11","descendants":0,"id":14228624,"score":1,"time":1493498396,"title":"Sketch Engine","type":"story","url":"https://www.sketchengine.co.uk/"},"14228787":{"by":"azuajef","descendants":0,"id":14228787,"score":3,"time":1493500520,"title":"Fear of Neofascism Keeps Emmanuel Macron Ahead of Marine Le Pen","type":"story","url":"https://www.theguardian.com/world/2017/apr/29/france-election-neofascism-le-pen-macron"},"14227957":{"by":"azuajef","descendants":0,"id":14227957,"score":1,"time":1493490683,"title":"She just wanted some water","type":"story","url":"https://twitter.com/m_4rina/status/854051279437529089/photo/1"},"14228012":{"by":"jsprenne","descendants":0,"id":14228012,"score":2,"time":1493491237,"title":"How much does a website cost?","type":"story","url":"https://fulfilli.com"},"14228076":{"by":"ajschrier","descendants":0,"id":14228076,"score":1,"time":1493491751,"title":"Project to create facial image dataset by scraping Tinder profiles","type":"story","url":"https://github.com/scoliann/TinderFaceScraper/blob/master/README.md"},"14227956":{"time":1493490680,"type":"story","descendants":6,"title":"In Any Business Crisis, These Two Magic Words Change Everything","kids":[{"by":"mgkimsal","id":14228348,"parent":14227956,"text":"In other words, people need to talk to each other some more, and perhaps drop some egos?<p>I&#x27;d be pissed off to high heaven to learn that my friends or family (or me!) had been in previous rounds of layoffs because some simple math and a couple hours of conversations were too much for management (and previous consultants had been paid big bucks to fire people months earlier).<p>&quot;Management doesn&#x27;t like to see people idle&quot;.  WTF.  This reminds me of &quot;butts in seats&quot; thinking, vs looking at real productivity output numbers.<p>Worked a place years ago where some of us were &quot;upsetting&quot; others on the floor because every so often one of us didn&#x27;t come in until 10:30 or 11.  This &#x27;upset&#x27; some of the other folks (call center, marketing, etc) who were always in by 9.  It didn&#x27;t matter that one of us had been <i>on premises</i> from 10pm-3am hours earlier doing a system push&#x2F;upgrade.  They didn&#x27;t think it was &quot;fair&quot; that every 8-12 weeks someone in my group worked a &#x27;half day&#x27;.","time":1493495257,"type":"comment"},{"by":"edejong","id":14228738,"parent":14227956,"text":"The thing I get from this article is that, after a plant has been cost cut until total inefficiency, the thing to do is ask your managers what was taken from them to do their job normally, and giving it to them. Afterwards, you take the credit by claiming it all came down to two simple words: impossible unless...","time":1493499899,"type":"comment"},{"by":"dakotasmith","id":14228078,"parent":14227956,"text":"The words being, &quot;impossible, unless?&quot; when someone says doing _something_ is impossible.","time":1493491761,"type":"comment"},{"by":"cbanek","id":14228262,"kids":[{"by":"smacktoward","id":14229171,"parent":14228262,"text":"<i>&gt; what I learned from this is that people don&#x27;t focus on solving problems, but covering their own ideas&#x2F;interests</i><p>You misspelled &quot;asses.&quot;<p>:-D","time":1493505679,"type":"comment"}],"parent":14227956,"text":"Really, what I learned from this is that people don&#x27;t focus on solving problems, but covering their own ideas&#x2F;interests, which are somewhat misguided.  I can change the circumstances (software instead of mining, servers&#x2F;people instead of equipment) and it looks like any number of situations I&#x27;ve been in before that could be solved, if the people actually wanted to solve it.<p>Sure, think of the impossible.  But really, it&#x27;s hard to get people to do what they admit they believe to be impossible.  Not because it&#x27;s impossible, but because they simply don&#x27;t want to do it (and will undermine it at the next possible opportunity).","time":1493494145,"type":"comment"},{"by":"CurtMonash","id":14228926,"parent":14227956,"text":"Sometimes, the other department really isn&#x27;t a bottleneck; the first department just incorrectly thinks it is.<p>For example, decades ago I had a consulting gig to help an enterprise pick an app dev tool. This was during the period in the 1990s that fat-client run-times were clearly the best choice, yet my clients thought that the security folks were (foolishly) insisting on X-terminals instead.<p>My solution was to suggest they get security on the phone. It turns out my client department&#x27;s belief was false. End of problem.","time":1493502137,"type":"comment"}],"id":14227956,"score":16,"url":"http://www.huffingtonpost.com/entry/in-any-business-crisis-these-two-magic-words-change_us_58ff5d08e4b0c13feaa5c850","by":"CarolineW"},"14228556":{"by":"Jerry2","descendants":0,"id":14228556,"score":1,"time":1493497508,"title":"Once-flush startups struggle to stay alive as investors get picky","type":"story","url":"https://blog.gerbsmanpartners.com/2017/04/24/the-black-swan-flies-again-once-flush-start-ups-struggle-to-stay-alive-as-investors-get-picky-by-eliot-brown-wall-street-journal-as-seen-in-the-australian-business-review/"},"14228856":{"by":"fvargas","descendants":0,"id":14228856,"score":2,"time":1493501261,"title":"Hacker repairs broken SIM card contacts on OnePlus One","type":"story","url":"https://www.youtube.com/watch?v=AmgdumN4WCo"},"14228818":{"by":"ArneBab","descendants":0,"id":14228818,"score":2,"time":1493500811,"title":"Elegant commandline argument parsing on the shell","type":"story","url":"http://www.draketo.de/english/free-software/shell-argument-parsing"},"14228378":{"by":"DiabloD3","descendants":0,"id":14228378,"score":1,"time":1493495554,"title":"New Human Rights for the Age of Neuroscience?","type":"story","url":"http://blogs.discovermagazine.com/neuroskeptic/2017/04/29/human-rights-neuroscience/"},"14228783":{"by":"dzautner","descendants":0,"id":14228783,"score":2,"time":1493500483,"title":"Symbolically Expressed Lambdas","type":"story","url":"https://github.com/dzautner/Sel"},"14228519":{"time":1493497117,"type":"story","descendants":1,"title":"Reverse-Engineering Google’s Algorithm","kids":[{"by":"DamonHD","id":14228608,"parent":14228519,"text":"Yes, even the title is good and the reasoning for its form given.  If &quot;SEO&quot; had been in it I would not have clicked...","time":1493498178,"type":"comment"}],"id":14228519,"score":4,"url":"https://medium.freecodecamp.com/seo-secrets-reverse-engineering-googles-algorithm-92fad4f5a39","by":"denzil_correa"},"14227826":{"by":"jseliger","descendants":0,"id":14227826,"score":2,"time":1493489407,"title":"Reforming land use regulations","type":"story","url":"https://www.brookings.edu/research/reforming-land-use-regulations/"},"14228841":{"by":"ptrptr","descendants":0,"id":14228841,"score":1,"time":1493501093,"title":"Elon Musk Slices the Idea of Flying Cars with a 'Guillotine' Insult","type":"story","url":"https://www.inverse.com/article/30968-elon-musk-insults-flying-cars"},"14228945":{"by":"alexcweiner","descendants":0,"id":14228945,"score":1,"time":1493502344,"title":"Cities sorted by place name length / English preferred","type":"story","url":"https://pastebin.com/yWmXnamR"},"14227747":{"by":"miheerdew","descendants":0,"id":14227747,"score":2,"text":"Here is a small prototype I wrote: https:&#x2F;&#x2F;github.com&#x2F;miheerdew&#x2F;delayed-admin, which is a self-control tool for administrators. I basically wrote it because I would find ways to bypass all the self-control tools that were there.<p>I use it to (1) Lock me out of my laptop at 10pm (2) Prevent me from changing my dns from OpenDNS-family filter. (3) Save the passwords for parental controls apps in a file readable by root only so that I can&#x27;t access them at whim.<p>It is still a prototype, but I believe it is full proof. I don&#x27;t know a lot about user&#x2F;group mechanism in Mac&#x2F;Unix, so I am trying to find someone who does. The aim would be to have an abmindicate like tool (http:&#x2F;&#x2F;www.pluckeye.net&#x2F;abmindicate.html) for Mac&#x2F;Linux users.","time":1493488297,"title":"Temporarily drop admin privileges. Self-control for admins. Mac/Linux","type":"story"},"14227999":{"by":"s3arch","descendants":0,"id":14227999,"score":2,"time":1493491065,"title":"Is mathematics an effective way to describe the world?(2013)","type":"story","url":"https://www.phys.org/news/2013-09-mathematics-effective-world.html"},"14228382":{"by":"dollar","descendants":0,"id":14228382,"score":1,"time":1493495583,"title":"Comic book legend Michael Golden shares his secrets for storytelling success","type":"story","url":"http://thomason.io/comic-book-legend-michael-golden-shares-his-secrets-for-successful-storytelling/"},"14228864":{"time":1493501380,"type":"story","descendants":1,"title":"Show HN: [WebGL Demo] Indirect Lighting Using Reflective Shadow Maps","kids":[{"by":"erkaman","id":14228867,"parent":14228864,"text":"Hello, I&#x27;m the writer of this demo. \nBecause this is WebGL, this demo may or may not run, so here(<a href=\"https:&#x2F;&#x2F;github.com&#x2F;Erkaman&#x2F;webgl-rsm\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;Erkaman&#x2F;webgl-rsm</a>) you can see\nan image of what it should look like.<p>This is an implementation of Indirect Lighting using Reflective Shadow Maps(<a href=\"http:&#x2F;&#x2F;www.klayge.org&#x2F;material&#x2F;3_12&#x2F;GI&#x2F;rsm.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;www.klayge.org&#x2F;material&#x2F;3_12&#x2F;GI&#x2F;rsm.pdf</a>).\nThis technique results in some nice color bleeding effects, which can be seen in the red glow on Lucy(statue)\nand the blue glow on the cute rabbit. This is light that has bounced from the colored walls.<p>The implementation details  can be found in the repo: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;Erkaman&#x2F;webgl-rsm#implementation-details\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;Erkaman&#x2F;webgl-rsm#implementation-details</a>","time":1493501398,"type":"comment"}],"id":14228864,"score":6,"url":"https://erkaman.github.io/webgl-rsm/webgl-rsm.html","by":"erkaman"},"14228231":{"time":1493493666,"type":"story","descendants":4,"title":"Love in the Time of Numbness; Or, Doctor Chekhov, Writer","kids":[{"by":"two2two","id":14232232,"kids":[{"by":"breatheoften","id":14233251,"parent":14232232,"text":"I&#x27;ve come to see the desire for positivity in the face of overwhelming reasons for a negative outlook to often be accompanied by an implicit co-attribution of blame on to those who hold a negative outlook.  I&#x27;m starting to perceive this misattribution of blame as part of the whole post truth machinery -- an attempt to dissipate the will to topple the worst actors.  Let the rulers pillage, they try to say, and some of us will be better off.<p>I&#x27;m coming to see it for what it is: cowardice.","time":1493579037,"type":"comment"},{"by":"vwcx","id":14234271,"parent":14232232,"text":"&quot;What will move me beyond this state of anesthesia? How will I counteract the lassitude that creeps over my soul?&quot;<p>What a great set of reflections. I&#x27;ve paused on this for the past 15 minutes and will continue to ponder it the rest of this evening.","time":1493592017,"type":"comment"}],"parent":14228231,"text":"&quot;Anger, like false news, is cheap and easily digestible; it is the fast food of the indignant.&quot;<p>and<p>&quot;Today, and especially today, as the threat of desensitization—and the accompanying seductions of detachment, outrage, revulsion, indignation, piety, and narcissism—looms over all our lives, we might need to ask ourselves the question that Chekhov asked himself in the spring of 1890: What will move me beyond this state of anesthesia? How will I counteract the lassitude that creeps over my soul?&quot;<p>At first I was &quot;withdrawing from engagement altogether,&quot; but now I find myself with more compassion and an urge to help myself and others move forward.","time":1493569051,"type":"comment"},{"by":"theprop","id":14233982,"parent":14228231,"text":"Chekhov&#x27;s short stories are one of the great accomplishments of any human being ever.<p>His plays also began the modern theatre.","time":1493588204,"type":"comment"}],"id":14228231,"score":40,"url":"http://www.newyorker.com/culture/cultural-comment/love-in-the-time-of-numbness-or-doctor-chekhov-writer","by":"Hooke"}}