{"14219563":{"time":1493389260,"type":"story","descendants":61,"title":"Torcoin: Crypto's latest scam","kids":[{"by":"timdorr","id":14220216,"parent":14219563,"text":"Crazy part is this guy didn&#x27;t even come up with the name!<p><a href=\"https:&#x2F;&#x2F;github.com&#x2F;torcoindev&#x2F;torcoin&#x2F;issues&#x2F;4\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;torcoindev&#x2F;torcoin&#x2F;issues&#x2F;4</a> You can see he changed the title in that issue, indicating he was taking over the abandoned name.<p>The original project is at least nearly 3 years old: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;torcoindev&#x2F;torcoin&#x2F;issues&#x2F;1\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;torcoindev&#x2F;torcoin&#x2F;issues&#x2F;1</a> (Git timestamps can be forged, but not Github issues)<p>And for the pièce de résistance, there&#x27;s a backdoor in the code: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;torcoindev&#x2F;torcoin&#x2F;issues&#x2F;3\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;torcoindev&#x2F;torcoin&#x2F;issues&#x2F;3</a>","time":1493393514,"type":"comment"},{"by":"chatmasta","id":14220724,"parent":14219563,"text":"Just want to say this has absolutely nothing to do with the research I did for my senior thesis [0] which was quite popular on HN when I posted it a few years ago.<p>We never moved beyond the research &#x2F; theory phase, which is admittedly frustrating, but we never intended to scam anyone.<p>That said, the idea of incentivizing routing is one I think about every day. In college I ran a successful business selling proxy servers, which opened my eyes to the unoptimized economics of small&#x2F;medium scale IP transit. Major cloud providers are making a huge racket by charging for transfer rather than capacity. This presents an opportunity for a marketplace.<p>My next product is going to be a global L3 routing-fabric-as-a service with developer pluggable routing and filtering rules. I&#x27;m going to bootstrap it by offering outbound http proxies with hourly charging and an API. Then I will develop the more generalized routing fabric, with the eventual goal of creating a marketplace for bandwidth and routing.<p>If that piques anyone&#x27;s interest, feel free to email me - address in profile.<p>[0] <a href=\"http:&#x2F;&#x2F;dedis.cs.yale.edu&#x2F;dissent&#x2F;papers&#x2F;hotpets14-torpath-abs\" rel=\"nofollow\">http:&#x2F;&#x2F;dedis.cs.yale.edu&#x2F;dissent&#x2F;papers&#x2F;hotpets14-torpath-ab...</a>","time":1493396497,"type":"comment"},{"by":"Analemma_","id":14220491,"kids":[{"by":"uncletammy","id":14220837,"kids":[{"by":"corysama","id":14221200,"parent":14220837,"text":"IMHO, Bitcoin is a more brilliant scam than GP gives it credit for.  It was a scam that was designed to end up not a scam.  IIRC, Bitcoin being a pyramid scheme was explicitly stated in the original design doc from Satoshi.  The problem was that even though bitcoin could work well once it was widely adopted, it had a chicken-egg problem in the beginning.  It had no value until it was widely adopted, but no rational person would adopt it until it had value.<p>The solution was to prime the pump with a pyramid scheme.  By structuring the system to highly reward risk-taking early adopters, Bitcoin motivated millions of dollars of high-risk early investment which is worth billions today.<p>But, return on investment was only a nice side effect on the way to the end game.  The end game was to get Bitcoin up and running as an exchange medium --only coincidentally as an investment vehicle.  As an exchange medium, Bitcoin is not yet 100% solid.  But, in general the plan has already worked.  Someone in Haiti can exchange value with someone in the Ukraine and for once there is little that the games of the politicians or the banks can do to stand in their way.  That was the real goal.  A bunch of nerds gambling was just a necessary bit of fun on the way to setting that up.","time":1493399549,"type":"comment"},{"by":"mmcwilliams","id":14221293,"parent":14220837,"text":"You understand that the figure you quote, &quot;$34 billion dollars&quot; might seem like it carries a lot of weight, but it&#x27;s also about $2B short of the amount invested in the largest Ponzi scheme uncovered in US history[0]. A lot of people seemed to think that investors in this scheme were too savvy to be duped, as well.<p>This doesn&#x27;t mean that crypto currencies are inherently scams, but it is a terrible way of defending them.<p>[0] <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Bernard_Madoff#Size_of_loss_to_investors\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Bernard_Madoff#Size_of_loss_to...</a>","time":1493400085,"type":"comment"},{"by":"shrimp_emoji","id":14221050,"kids":[{"by":"Bartweiss","id":14221300,"parent":14221050,"text":"&gt; But they could have.<p>This seems sort of unfair. I mean, one of the things that has helped stabilize Bitcoin is that it <i>wasn&#x27;t</i> controlled by a single entity, and many of the early blocks haven&#x27;t gone anywhere. Several other cryptos have done poorly because some early consortium got too much control and everyone else backed off.<p>One advantage of the public transaction log is that it helps people judge whether they&#x27;re being scammed this way. Nakamoto made a killing, certainly, but I also suspect that a sudden sell-off of the origin block would tank prices.","time":1493400195,"type":"comment"}],"parent":14220837,"text":"<a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Satoshi_Nakamoto#Development_of_bitcoin\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Satoshi_Nakamoto#Development_o...</a><p>&gt;Timestamps for subsequent blocks indicate that Nakamoto did not try to mine all the early blocks solely for themselves in an effort to benefit from a Ponzi scheme.<p>But they could have.<p>&gt;The public bitcoin transaction log shows that Nakamoto&#x27;s known addresses contain roughly one million bitcoins. As of 7 February 2017, this is the equivalent of over US$1 billion.<p>Starting your own cryptocurrency doesn&#x27;t seem like a bad way to make a buck (particularly provided it becomes as successful as bitcoin), all thanks (eventually) to &quot;the biggest names in finance and technology&quot;.<p>Granted, there&#x27;s a strong difference between &quot;potential scam&quot; and &quot;scam&quot; (hell, it&#x27;s the difference between Torcoin and every legitimate, well-regulated <i>non</i>-crypto currency).","time":1493398627,"type":"comment"},{"by":"cloakandswagger","id":14220968,"kids":[{"by":"csydas","id":14221283,"kids":[{"by":"Bartweiss","id":14221343,"parent":14221283,"text":"&gt; The idea of a decentralized currency isn&#x27;t bad in and of itself, but there is a lot to laugh at in the current history of cryptocurrencies.<p>Ethereum seems like a good reminder of this. It has an air of being less seedy and more &#x27;professional&#x27; than Bitcoin, with actually-pretty-cool &quot;smart contract&quot; tech. But... the first big project was the DAO, and we all know how that turned out. Robbery and a hard fork. And now the Gnosis auction just hit, and that went terribly and exactly counter to predictions about a &quot;rational market&quot;.<p>Despite any philosophical argument, the actual history of cryptocurrencies is pretty ludicrous so far.","time":1493400420,"type":"comment"},{"by":"cloakandswagger","id":14221310,"kids":[{"by":"csydas","id":14221402,"parent":14221310,"text":"Because I don&#x27; t take it as harping on the tech - it&#x27;s not the tech that&#x27;s the problem, it&#x27;s the hype and culture around it. There&#x27;s tons of hype, many outright scams and ponzi schemes within bitcoin to point to, it&#x27;s fraught with outright criminal activity just within trading, not to mention that it&#x27;s the payment of choice for Ransomware.<p>The distributed ledger isn&#x27;t what people are making fun of - it&#x27;s the frantic rush and chaos around using it that is ridiculed, and in many cases, rightfully so.<p>Edited additional thought: Come to think of it, I don&#x27;t think a lot of the new found SV culture is really as hackerish as it&#x27;s made out to be - it&#x27;s the same business stuff that cyberpunks in stories would snub their noses at and work to undermine, except it&#x27;s masquerading as hacker culture - there&#x27;s a very cool protocol underneath bit coin that probably will fundamentally change how we do &quot;something&quot; in the future. But what is everyone climbing over themselves about with Bitcoin? Get-rich-quick after get-rich-quick schemes and ridiculous business enterprises.<p>Silk road I got - buy whatever with crypto-currency, hard to trace, from hard to find sites on TOR, and a package arrives or a service is done. Cool! But that&#x27;s not what the clamoring is about now, and it hasn&#x27;t been for ages.<p>That&#x27;s not a hackerish interest, that&#x27;s business people playing with yet another asset to trade.","time":1493400966,"type":"comment"},{"by":"Bartweiss","id":14221413,"parent":14221310,"text":"&gt; I don&#x27;t know what is gained from harping on all the early failures.<p>Avoiding them in the future, perhaps? I wouldn&#x27;t mock a mature technology for historical teething issues, that&#x27;s pointless. But cryptocurrencies keep replaying the same errors and conflicts without seeming to learn a thing. I <i>like</i> the idea of cryptocurrency, but it&#x27;s not going to succeed unless we learn from the (myriad, severe) mistakes of the past.","time":1493401045,"type":"comment"}],"parent":14221283,"text":"Shitting on emergent tech is completely antithetical to the ethos of the &quot;hacker mindset&quot;.<p>A real hacker would recognize these are the early days of a new technology with incredible potential. Its tech is disruptive enough to already grow a marketcap measured in billions, I don&#x27;t know what is gained from harping on all the early failures.","time":1493400271,"type":"comment"}],"parent":14220968,"text":"There may be a faction that thrives on the pleasure in misery of others and specifically those who follow cryptocurrencies, but it&#x27;s not hard to have major doubts about Bitcoin given it&#x27;s tumultuous history up to the given point. The coin itself has had a rollercoaster of a valuation, pock-marked by fairly well trusted bit coin operations that just grabbed the money and ran with it.<p>The currency itself is beholden to a small group of dedicated miners and their whims, the fork has been looming over bitcoin for some time now, which is the only thing that seems to give any value to the other cryptocurrencies as if it forks it means a potential foothold for other services to get in.<p>Cryptocurrencies are a real mess, and for a awhile there, the fad was to attach a new cryptocurrency to whatever service you wanted to try and be &quot;the next big thing&quot;, and it&#x27;s always been ridiculous.<p>The idea of a decentralized currency isn&#x27;t bad in and of itself, but there is a lot to laugh at in the current history of cryptocurrencies.","time":1493400025,"type":"comment"},{"by":"microtherion","id":14221314,"kids":[{"by":"cloakandswagger","id":14221351,"parent":14221314,"text":"You&#x27;re right, it&#x27;s a vehicle for speculation now. And when the tech matures and the price steadies, it will be, at the very least, a new store of value for diversifying wealth with, akin to bullion.<p>That is valuable to me and a lot of other people. Until that time comes, I&#x27;m happy to embrace the risk of early adoption and the many thousands of dollars it&#x27;s made for me already.","time":1493400521,"type":"comment"}],"parent":14220968,"text":"&gt; crypto&#x27;s fantastic investment value<p>True, many crypto currencies are rapidly increasing in value (because of built in scarcity effects, and investor interest). But that very speculative attractiveness makes them quite unsuited as currency (because their value is unstable and generally deflationary). So you&#x27;re left with a &quot;commodity&quot; that is unsuitable for anything but speculation. Those kinds of stories usually don&#x27;t tend to end well.","time":1493400284,"type":"comment"},{"dead":true,"deleted":true,"id":14221284,"parent":14220968,"time":1493400026,"type":"comment"}],"parent":14220837,"text":"The original commenter belongs to a very persistent faction of people who openly mock and malign cryptocurrencies despite being <i>completely unaffected by them</i><p>My only theory to date is these are sour grapes type folks who are upset that they&#x27;ve missed the bus in terms of crypto&#x27;s fantastic investment value.<p>The only comfort these people get is jeering from the sidelines in hopes that an eventual collapse will prove them &quot;right&quot;","time":1493398133,"type":"comment"},{"by":"enraged_camel","id":14221315,"parent":14220837,"text":"&gt;&gt;$34 billion dollars and many of the biggest names in finance and technology seem to think there&#x27;s a little more to the story.<p>I&#x27;m sorry, but <i>so fucking what</i>? MLM was a $178 billion industry in 2013 and it has been growing. This doesn&#x27;t make it Not A Scam.","time":1493400293,"type":"comment"},{"by":"pikzen","id":14221102,"kids":[{"by":"esMazer","id":14221212,"parent":14221102,"text":"your comment doesn&#x27;t add anything of value","time":1493399579,"type":"comment"}],"parent":14220837,"text":"If that can make you happy, I used that power to downvote you, as your does not add anything of value either. I also upvoted him, for being right :&gt;<p>&quot;X billion dollars can&#x27;t be wrong&quot; is also a dead horse. Appeal to authority and wealth is a terrible argument.","time":1493398910,"type":"comment"},{"by":"throwaway6556","id":14221241,"parent":14220837,"text":"Is anything of what he said untrue?<p>Yeah, I didn&#x27;t think so either.","time":1493399764,"type":"comment"}],"parent":14220491,"text":"I can&#x27;t wait until I grow up and get the power to downvote comments like this which contribute nothing of value to the discussion. Your horse could not be more dead.<p>$34 billion dollars and many of the biggest names in finance and technology seem to think there&#x27;s a little more to the story.","time":1493397222,"type":"comment"},{"by":"hectorr","id":14221085,"parent":14220491,"text":"A lot of them are, for the reasons you point out. But they really are not that different than other financial instruments in kind, just in maturity.<p>What does it mean to own a share of Snapchat, Facebook, or Google? You can&#x27;t influence these companies, they don&#x27;t pay dividends, so the value of a share is just whatever the mob wants to pay for it. Goes up on good news, down on bad. Bonds are even worse, that&#x27;s just someone saying sure, I&#x27;ll pay you back later. These things have law developed around them now, but didn&#x27;t when they first emerged.<p>It all depends on your risk profile. If you have high risk tolerance, and think that you can mitigate some risk with being ahead of the market in technical and&#x2F;or business skills, there is no reason not to get involved in these.","time":1493398835,"type":"comment"},{"by":"pc86","id":14220728,"kids":[{"by":"Analemma_","id":14220886,"parent":14220728,"text":"geofft&#x27;s answer is funnier, but I think the more likely answer is this:<p>Realistically speaking, cryptocurrency-related crime is never going to stop being easy and profitable unless there is a massive increase in both a) government control over the internet and b) coordinated international law enforcement, since these crimes are usually international. Since libertarians typically oppose both, they are incentivized to make crypto-related crimes-- even when they&#x27;re the victim-- seem like no big deal to avoid helping to fuel an outcry that might cause politicians to take action and bring about a) and b).<p>Granted, that&#x27;s all quite speculative, but empirically, I have seen quite a few people get robbed blind of their cryptocoins and be remarkably sanguine about it, and I&#x27;m struggling to come up with another explanation.","time":1493397548,"type":"comment"},{"by":"geofft","id":14220821,"kids":[{"by":"Bartweiss","id":14221393,"kids":[{"by":"geofft","id":14221466,"parent":14221393,"text":"Sure, but is e.g. law enforcement <i>in America</i> a legitimate government power? People on all corners of the political spectrum believe that America&#x27;s police is entirely too powerful and too militarized and solving all the wrong problems. They believe that even if there exists some law enforcement that is a legitimate purpose of government, the thing America has is definitely not that. If I think there&#x27;s a good chance that <i>this specific law enforcement organization</i> respond to the cryptocoin spammer with a SWAT team and a CFAA prosecution, is it still legitimate for me to ask <i>that department</i> for help?<p>And if I&#x27;m trying to enforce laws against e.g. someone in another jurisdiction, I didn&#x27;t pay for that. The funding for that police department was taken from people in that jurisdiction. I can see it being consistent to make use of services that my own tax dollars paid for, but is it legitimate to make use of services that other people&#x27;s tax dollars paid for, without their consent?","time":1493401377,"type":"comment"}],"parent":14220821,"text":"That&#x27;s an anarcho-capitalist stance, sure. But very few programmers are an-caps, compared to the number of libertarians.<p>Most libertarians (and minarchists, and a lot of others) <i>specifically</i> accept basic law enforcement as a reasonable role of government. The whole &quot;night watchman state&quot; idea centers around defense, policing, and courts as legitimate government powers.<p>(Also, this is backwards even to an-caps. The taxation <i>was</i> theft, but availing yourself of services purchased is reasonable compensation since no one else is permitted to sell legal services.)","time":1493400897,"type":"comment"}],"parent":14220728,"text":"Law enforcement is funded by taxation, which is theft. If you avail yourself of law enforcement, you are benefiting yourself from the proceeds of crime for personal gain.","time":1493397134,"type":"comment"}],"parent":14220491,"text":"I take issue with your third point. Libertarianism does not in any way mean you won&#x27;t avail yourself of law enforcement if you&#x27;ve been the victim of a crime.<p>I&#x27;m not a cryptocurrency guy, but what exactly about them would someone involve law enforcement for?","time":1493396516,"type":"comment"},{"by":"celticninja","id":14220918,"parent":14220491,"text":"Generalising all cryptocurrencies​ as a scam kind of shows up your lack of knowledge.","time":1493397758,"type":"comment"},{"by":"nyolfen","id":14220843,"parent":14220491,"text":"&gt; It&#x27;s all so perfectly tuned to draw in an endless supply of suckers that I&#x27;m almost kicking myself for not thinking of it first.<p>well, clearly it&#x27;s not too late to get in on the game ;)","time":1493397251,"type":"comment"},{"by":"Kinnard","id":14220881,"parent":14220491,"text":"&gt; Cryptocurrencies are a brilliant scam.<p>Quite a bit too broad of a generalization.","time":1493397512,"type":"comment"},{"by":"max_","id":14221210,"parent":14220491,"text":"&gt;Cryptocurrencies are a brilliant scam. They are to the libertarian-ish programmer crowd what MLM pyramid schemes are to the working class: perfectly crafted to exploit the particular tendencies of its target.<p>How is this different from the way Twitter makes no profits but lists on the stock exchange?<p>Or are startups also a scam?","time":1493399570,"type":"comment"},{"by":"mmjaa","id":14221082,"parent":14220491,"text":"You may as well just be describing software, in general.<p>This isn&#x27;t a &quot;crypto thing&quot;, yo.<p>All software has such utility.<p>You either care or you don&#x27;t.","time":1493398808,"type":"comment"},{"dead":true,"deleted":true,"id":14220919,"parent":14220491,"time":1493397760,"type":"comment"}],"parent":14219563,"text":"Cryptocurrencies are a brilliant scam. They are to the libertarian-ish programmer crowd what MLM pyramid schemes are to the working class: perfectly crafted to exploit the particular tendencies of its target. I mean, just think about the properties of the typical software engineer who gets into these things:<p>1. They tend to have more disposable income, i.e., they&#x27;re fat marks<p>2. The Dunning-Kruger effect means they think they&#x27;re too smart to fall for a scam<p>3. Their libertarian attitude means they probably won&#x27;t make a fuss once they realize they&#x27;ve been scammed, and just passively accept it instead of involving law enforcement<p>4. Because every one uses different code, any anecdotes about past scams can always be waved off with &quot;This one is different&quot;<p>It&#x27;s all so perfectly tuned to draw in an endless supply of suckers that I&#x27;m almost kicking myself for not thinking of it first.","time":1493395206,"type":"comment"},{"by":"lisper","id":14220415,"kids":[{"by":"zanny","id":14220647,"parent":14220415,"text":"Except BTC has been &quot;teetering&quot; on the &quot;brink&quot; for 3+ years on the block size issue. When everyone&#x27;s value is in the consensus, nobody is going to break it, no matter how much they complain about it. You can&#x27;t rock the boat too much or you lose all your money.<p>That also means bitcoin is never going to get <i>better</i>, so it is pretty much destined to always be cryptogold. Which isn&#x27;t even a bad thing, it just isn&#x27;t competing to be a real money. But it has never been valued for any potential monetary use - it has <i>always</i> been valued as cryptogold.","time":1493396057,"type":"comment"},{"by":"esMazer","id":14221249,"parent":14220415,"text":"&quot;For years bitcoin has offered a reliable and inexpensive WAY TO TRANSFER value around the globe.&quot;<p>the quote is not referring to the intrinsic value of BTC, is referring to the cost of TRANSFERRING value which is low with bitcoin.","time":1493399785,"type":"comment"},{"by":"jstanley","id":14221045,"kids":[{"by":"fpgaminer","id":14221387,"kids":[{"by":"jstanley","id":14225821,"parent":14221387,"text":"I think we&#x27;re confusing 2 different costs here.<p>My parent was talking about Bitcoin costing a lot of money (overall) because of the amount &quot;wasted&quot; on mining. While this is true, it doesn&#x27;t affect the costs for sending transactions. Causality actually runs in the other direction here: as transaction fees increase, more mining revenue is available, so more is spent on mining.<p>High transaction cost leads to high mining cost, not the other way around.<p>You point out that much of the value that is given to miners comes through devaluing everybody else&#x27;s coins. That&#x27;s true too, but also doesn&#x27;t affect the cost of <i>sending</i> a transaction. This cost is borne in proportion to the amount of BTC you hold, rather than the amount of transactions you send.","time":1493460027,"type":"comment"}],"parent":14221045,"text":"It probably does.  I mean, we pay miners 12.5 BTC to verify ~1800 transactions.  It&#x27;s not like that BTC is free.  When new BTC are created, it devalues existing BTC.<p>Put another way, the miners will sell that 12.5 BTC on the market.  Selling on the market puts a downward pressure on the price.<p>Another way still:  If the market cap for Bitcoin remained constant, then it&#x27;s obvious to see that for every block reward generated, the price per bitcoin goes down.<p>I don&#x27;t think it&#x27;s unreasonable to think that that means we&#x27;re paying miners $16.5k USD per block, which would be about $9.22&#x2F;transaction.  Plus transaction fees.  It&#x27;s probably just hard to see that because the market cap for Bitcoin keeps increasing faster than Bitcoin&#x27;s natural inflation.  Basically, investors in Bitcoin are paying the transaction cost right now.","time":1493400861,"type":"comment"}],"parent":14220415,"text":"&gt; Bitcoin is not inexpensive. The cost of mining is actually quite substantial just in terms of the electricity bill.<p>As you point out, this is on purpose. And the cost of mining bears almost no relation whatsoever to the cost of <i>using</i> Bitcoin.","time":1493398593,"type":"comment"}],"parent":14219563,"text":"It is ironic that at the bottom of this post on cryptocurrency scams there is this teaser:<p>&quot;For years bitcoin has offered a reliable and inexpensive way to transfer value around the globe.&quot;<p>Bitcoin is not inexpensive.  The cost of mining is actually quite substantial just in terms of the electricity bill.  And this is <i>inherent</i> in the design: bitcoin&#x27;s security <i>depends</i> on mining being expensive.  If it were cheap, anyone could mount a 51% attack.<p>Also, Bitcoin is currently teetering on the brink of a community split which could lead to a hard-fork of the blockchain, though very few people outside the community seem to be aware of this.  As the old adage goes, past reliability is no guarantee of future reliability.","time":1493394696,"type":"comment"},{"by":"Taek","id":14219876,"kids":[{"by":"bhaak","id":14220002,"parent":14219876,"text":"A $500k market cap is really nothing to write about. Market cap is a broken metric anyway.<p>But the article is a nice how-to for your own crypto coin and there were lots of worse coins he could have forked off than shadowcoin. :-)","time":1493392310,"type":"comment"},{"by":"Kinnard","id":14219902,"parent":14219876,"text":"Perhaps the author bought her(his?)self some Torcoin before publishing?","time":1493391712,"type":"comment"}],"parent":14219563,"text":"Is a $500k market cap scam even worth discussing? What about all the ethereum projects raising 6-7 figures with little more than a whitepaper? And often even with heavy criticism about a broken security model.<p>There is no latest scam in cryptocurrency. By the time you&#x27;ve finished writing the article another has already popped up.<p>If anything you are helping these guys by giving them visibility.","time":1493391543,"type":"comment"},{"by":"al2o3cr","id":14219673,"kids":[{"by":"geogra4","id":14219905,"kids":[{"by":"davidgerard","id":14220290,"parent":14219905,"text":"Every one of them thinks &quot;man, so close, <i>next time for sure</i>&quot;","time":1493393954,"type":"comment"}],"parent":14219673,"text":"man, whoever is left holding the bag on these is going to be seriously screwed after the tulips run their course","time":1493391722,"type":"comment"},{"by":"coldtea","id":14220434,"parent":14219673,"text":"If only the second part was true...","time":1493394832,"type":"comment"}],"parent":14219563,"text":"The cryptocoin motto: &quot;From each according to his gullibility, to each according to his greed&quot;","time":1493390178,"type":"comment"},{"by":"brilliantcode","id":14220386,"kids":[{"by":"danmaz74","id":14221537,"parent":14220386,"text":"Just out of curiosity, why are you singling out Poloniex? AFAIK there are exchanges with way more alt coins.","time":1493401825,"type":"comment"}],"parent":14219563,"text":"It never ceases to amaze me how gullible people are with all these questionable &quot;crypto&quot; coins being traded on Poloniex.<p>Price is manipulated but because these don&#x27;t fall under SEC&#x27;s turf it&#x27;s being looked the other way...<p>but if anything should keep the Poloniex and Ethereum guys awake is that the SEC has traditionally <i>retroactively</i> applied a law however far back they need to.<p>This means that you should start treating cryptocoins under the assumption that the SEC would retroactively view it as equity therefore violation of trading laws.","time":1493394492,"type":"comment"},{"by":"nickik","dead":true,"id":14219938,"kids":[{"by":"dang","id":14222882,"parent":14219938,"text":"Please don&#x27;t take HN threads on generic ideological tangents.<p>We detached this subthread from <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=14219673\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=14219673</a> and marked it off-topic.","time":1493412034,"type":"comment"},{"by":"danbruc","id":14220080,"kids":[{"by":"beaconstudios","dead":true,"id":14220147,"kids":[{"deleted":true,"id":14220272,"kids":[{"deleted":true,"id":14220760,"parent":14220272,"time":1493396722,"type":"comment"}],"parent":14220147,"time":1493393869,"type":"comment"},{"by":"ue_","id":14220357,"kids":[{"by":"coldtea","id":14220448,"kids":[{"by":"beaconstudios","id":14220556,"kids":[{"by":"coldtea","id":14226111,"parent":14220556,"text":"&gt;<i>that&#x27;s a bit of shifting the goal-posts, isn&#x27;t it? Communism resulted in the deaths of ~100 million people due to famines from planned economy mismanagement, genocide, mass murder and so on but that&#x27;s fine because Nazis were horrific murderers too?</i><p>No, that&#x27;s just not a significant argument against communism in general, as similar things happened not just by the &quot;Nazis&quot; but by all major regime changes. Europe had power struggles, civil wars, executions, economy mismanagement etc for 2 centuries leading to the 20th century (which brought WWI and WWII and the colonial wars).<p>Heck, the modern democratic era started with hundreds of thousands executed in the French Revolution, and then the Napoleonic wars -- and countless other peripheral wars, power struggles, and bloody revolutions.<p>When Communism came about in Russia, non-communism Europe was torn by the bloodbath of WWI, pogroms, ethnic tensions, etc.<p>But when it&#x27;s up to communism we do a sleight of hand, and gather all deaths under communism, in all countries, under various reasons, and do a mass tally to prove how bad it is.<p>Maybe do a similar tally under non-communism? Let&#x27;s even constrain it to the 20th century.<p>Only then would a comparison make sense, whether communism is so worse than our cherished non-communism systems, or whether we&#x27;re just summing all kinds of 20th century wars, tensions and power struggles that happened to take place under communism in some countries, and forget the similar happenings in non communism countries.","time":1493466190,"type":"comment"},{"by":"ue_","id":14226059,"parent":14220556,"text":"What about those deaths caused today from planned society mismanagement? The poor and other workers who die from a mode of production which every government upholds religiously - capitalism. If you will make the argument that Stalin is responsible for the deaths of these hundred million, then you must also hold every country of the world accountable for a much larger number of deaths that&#x27;s still happening to this day.","time":1493465321,"type":"comment"},{"by":"danbruc","id":14220966,"kids":[{"by":"beaconstudios","id":14221271,"kids":[{"by":"danbruc","id":14221621,"parent":14221271,"text":"I will mostly ignore the first part of your response because I don&#x27;t think there are good arguments that these things are inherent to communism. Especially violence against the population seems a rather poor argument because this is what happen when a ruling class tries to force a system onto the people against their will and that is easily avoided if the people are those who want the system and it is of course also independent of the system the ruling class wants to implement.<p><i>To be explicit, the parts that are inherent include purging the &quot;capitalist class&quot; [...]</i><p>Yes, but »purging« has an unnecessary negative connotation, it sounds a bit like just killing everyone.<p><i>[...] the central planning of the economy [...]</i><p>No, communism and free markets would work together just fine.<p><i>[...] the complete rejection of alternative political beliefs [...]</i><p>No and yes. Whatever political beliefs you hold, you will usually hold that your believes are more true or better than all others. So this is no more true or false for communism than for any other set of political believes.<p><i>[...] the complete rejection of [...] democratic politics [...]</i><p>No, why would that be? There are as many things in a communist society as in any other society that require making decisions and that may have competing solutions. Why couldn&#x27;t you make them with a democratic process? Heck, you could democratically decide to become a communist society and democratically decide to stop being a communist society in case you are not happy with the result.<p>And even if you deemed communism untouchable and would insist that communism must not be subject to the democratic process, even then a huge number of things like health, foreign, or environmental policies are still independent from your economical system to varying degrees and could still be subject to the democratic process. But that is of course a silly idea.<p>By the way, note that communism is a heavily overloaded term especially if left unqualified. You can certainly find people that believe communism requires central planing, that communism requires a violent revolution, or any other combination of things. So you could certainly support some if not all of your points by just referring to specific groups with specific sets of believes.<p>When I refer to communism without qualification then I mean the very essence of it in the sense that it is [almost] universally accepted as an aspect of communism and not specific to some variant or interpretation of communism.","time":1493402318,"type":"comment"}],"parent":14220966,"text":"first you have to accept that there are 2 aspects to communism: communism in theory, and communism in practice. Communism in theory is supposed to be all rainbows and butterflies, but that doesn&#x27;t mean a thing unless it can be successfully implemented.<p>Now on to the ideological murders:<p>- Gulags<p>- Political executions and struggle sessions<p>- Economic-political executions (bourgeoisie, kulaks, petit-bourgeoisie)<p>- Ideological pseudoscience leading to famines (lysenkoism)<p>- Ideological drives leading to famines (the great leap forward)<p>- Military executions for betraying the cause<p>- The pervasive surveillance for &quot;counter-revolutionaries&quot; leading to people being imprisoned and tortured for curtain-twitchy neighbours<p>And that&#x27;s just focussing on the Soviet Union and China. I don&#x27;t think you could even attempt to argue that the Khymer Rouge were genocidal.<p>Need I go on? You might think communism sounds nice in theory (I don&#x27;t, I still think it sounds horrible in theory) but at some point (preferably before you&#x27;ve caused millions of deaths) you should be able to say &quot;actually, it&#x27;s a nice idea but doesn&#x27;t work in reality&quot;.<p>To be explicit, the parts that are inherent include purging the &quot;capitalist class&quot;, the central planning of the economy (because how else is distribution of goods going to happen? You can&#x27;t scale local markets to a whole nation that produces advanced goods with long supply chains), the complete rejection of alternative political beliefs and democratic politics, and that&#x27;s just off the top of my head.","time":1493399931,"type":"comment"}],"parent":14220556,"text":"No, that is not the point coldtea wanted to make. The point - or rather the question - is, what has communism to do with genocide or mass murder? A vegetarian serial killer does not make vegetarianism a violent practice. If you want to attack communism based on past events, then you can only make use of aspects that are inherent to communism. And if you think communism is inherently violent, then you will have to provide good arguments for that because this is at least not obvious and probably wrong. And while we are at it, communism does not require central planing either.","time":1493398127,"type":"comment"}],"parent":14220448,"text":"that&#x27;s a bit of shifting the goal-posts, isn&#x27;t it? Communism resulted in the deaths of ~100 million people due to famines from planned economy mismanagement, genocide, mass murder and so on but that&#x27;s fine because Nazis were horrific murderers too?<p>There&#x27;s also a difference between civil war and genocide. Lenin and Stalin explicitly murdered millions of their own people via execution or gulags.","time":1493395539,"type":"comment"},{"by":"girvo","id":14220579,"parent":14220448,"text":"6 million, not billion, no?","time":1493395650,"type":"comment"}],"parent":14220357,"text":"It&#x27;s the usual BS number that counts famines, civil wars, struggles for power etc as &quot;Communism&quot;. Because of course, those things (like tons of bloody wars, civil war, famines, and other stuff, like 6 billion jews in ovens) don&#x27;t happen under other regimes...","time":1493394931,"type":"comment"}],"parent":14220147,"text":"That&#x27;s an interesting figure, where&#x27;s that from? Not necessarily doubting you, but it&#x27;s a <i>huge</i> number. It&#x27;s not the first time I&#x27;ve seen this figure being posted. I don&#x27;t consider it an argument against Communism or Socialism.","time":1493394279,"type":"comment"}],"parent":14220080,"text":"&gt; Gullibility<p>100 million dead, but it&#x27;ll work this time!","time":1493393195,"type":"comment"}],"parent":14219938,"text":"I would say that does not describe communism at all. Gullibility and greed are two words that one would not usually associated with it, would you?","time":1493392824,"type":"comment"},{"by":"casiotone","id":14220306,"parent":14219938,"text":"You appear to have confused communism with capitalism. It&#x27;s ok, we all make mistakes - but please try harder in future!","time":1493394035,"type":"comment"}],"parent":14219563,"text":"Actually a better description of communism then the usual one.","time":1493391915,"type":"comment"},{"by":"Sami_Lehtinen","id":14220571,"kids":[{"by":"sireat","id":14221095,"parent":14220571,"text":"If you consider that most EU equivalents of SEC have issued warnings against OneCoin I would say that counts as a scam.<p>The amazing thing is that OneCoin does not even have a public blockchain or any chain.<p>Probably just an Excel spreadsheet with periodic applying of *2 formula.<p>It is just a regular pyramid which has nothing to do with cryptocurrencies besides the name.<p>I get regular questions from non-technical people who have been asked to &quot;invest&quot; in OneCoin.<p>It is hard to tell people to stay away.","time":1493398873,"type":"comment"},{"by":"martinko","id":14220827,"parent":14220571,"text":"Are you kidding me?","time":1493397161,"type":"comment"}],"parent":14219563,"text":"There are many rumors circulating around OneCoin being a scam. Afaik it hasn&#x27;t been (yet) proven to be a scam. <a href=\"https:&#x2F;&#x2F;www.onecoin.eu&#x2F;en&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.onecoin.eu&#x2F;en&#x2F;</a>","time":1493395616,"type":"comment"}],"id":14219563,"score":68,"url":"https://blog.toine.io/torcoin/","by":"toinetoine"},"14208227":{"time":1493252869,"type":"story","descendants":125,"title":"Symantec CA Response to Google Proposal and Community Feedback","kids":[{"by":"MichaelGG","id":14208357,"kids":[{"by":"clhodapp","id":14208562,"kids":[{"by":"duxup","id":14208917,"kids":[{"by":"hackcasual","id":14209006,"parent":14208917,"text":"I worked in telecoms at the time. It was a huge pain in the ass, but in the end it was fixable. The company I worked for actually made a nice chunk providing the HLR (home location register) updates needed to get it to work.","time":1493264074,"type":"comment"}],"parent":14208562,"text":"I recall a lot of horror stories from mobile telco providers when the US government proposed to users to take their phone number from one carrier to the next.   It was just one terrible prediction after another that involved so many risks and complications.... until they had to do it and then it just worked.","time":1493262758,"type":"comment"},{"by":"skuhn","id":14209316,"parent":14208562,"text":"It&#x27;s especially irksome to me in this case because Symantec (and maybe some of their actual customers) are acting like this is unheard of. Services did just recently have to update their certs to move away from SHA1 intermediate CA cert, didn&#x27;t they?<p>The current Symantec SHA1 intermediate CA cert is valid between Feb 2010 and Feb 2020, so it seems like there was probably a cert change ~7 years ago too. The horror!","time":1493269702,"type":"comment"},{"by":"borplk","id":14209619,"parent":14208562,"text":"Spot on. A variation of this happens about browsers as well.<p>How hard is it to run some version of Chrome or Firefox that is within the last 5 major releases?<p>I don&#x27;t care how big your organisation is, it&#x27;s not that hard.<p>Yet they want to off-load the costs to the rest of the world to keep sites compatible with their IE8.","time":1493274771,"type":"comment"}],"parent":14208357,"text":"For some reason, technical professionals associated with large organizations seem to actively enjoy pretending that basic upkeep is beyond the means of their organization (or has a poor value proposition). I suspect that it comes from a perverse enjoyment of being &quot;pragmatic&quot; in the face of &quot;idealism&quot; but really they&#x27;re just saying &quot;My org refuses to pay the costs associated with correctly operating the technologies it uses&quot;. If you&#x27;re going to take that attitude, you need to expect that your bluff is going to be called from time to time and you&#x27;ll have to do some large, unscheduled projects when it happens... <i>that&#x27;s</i> what being pragmatic actually means: recognizing the positive and negative effects of your options and owning the whole package.","time":1493257383,"type":"comment"},{"by":"dude01","id":14208408,"kids":[{"by":"walrus01","id":14208464,"parent":14208408,"text":"there are a number of similarities between symantec and some wall street dinosaurs.","time":1493256158,"type":"comment"}],"parent":14208357,"text":"Yeah, they&#x27;re using the argument: we&#x27;re too big to fail.","time":1493255339,"type":"comment"},{"by":"fooey","id":14209071,"parent":14208357,"text":"Symantec has got to be facing some very large and very serious lawsuits from those very same giant companies they&#x27;re try to leverage.<p>This is happening because Symantec was grossly negligent. They&#x27;re going to be held to account for that.<p>All those giant companies should be firing up their lawyers and starting emergency procedures to change to a different provider. Anyone still using Symantec at this point is absolutely playing with fire.","time":1493265421,"type":"comment"},{"by":"snomad","id":14208439,"kids":[{"by":"AceJohnny2","id":14208526,"kids":[{"by":"pcwalton","id":14208865,"kids":[{"by":"mentat","id":14209118,"parent":14208865,"text":"It does play those cards, for instance to mandate full disk encryption. They&#x27;re moving the standard forward, just not as fast as some may want.","time":1493266260,"type":"comment"},{"by":"sangnoir","id":14215473,"parent":14208865,"text":"The networks have to sign off too, or the phones won&#x27;t get the OTA updates or be allowed to connect to the network.<p>The SoC &#x2F; OEMs also have to sign off because they are the ones with access to the driver source code which needs to be updated and recompiled against a new release.<p>If Google plays hardball, these parties can always threaten Google with &quot;We&#x27;re leaving the OHA; we will be going with Amazon&#x27;s Android fork and bundle Kindle and Prime apps.&quot; I&#x27;m sure Bezos will throw in Amazon Maps for free.","time":1493333314,"type":"comment"}],"parent":14208526,"text":"Google holds all the cards. They have to sign off, or the phones will lose access to the Play Store and Google services like Maps. Google only needs to play the cards it already holds.","time":1493262169,"type":"comment"}],"parent":14208439,"text":"No, there&#x27;s a huge difference. The difference here is that the Manufacturers and the Carriers are gatekeepers to the customer&#x27;s phones.<p>The manufacturer made customizations to Android for their phone. Android isn&#x27;t a cleanly-separated stack where the manufacturer modifies only a certain part of the stack for their phone but Google could go and update another part without risk of breaking anything (is any software project?)<p>Then, the manufacturers sell the phones to carriers, who usually request extra customizations to (at best) add their logo, or replace default apps with the carrier&#x27;s own version. This means that any updates to Android likely require updates to this customization.<p>But even if that customization was free (from a development perspective), Carriers still have maintenance&#x2F;service contracts with the manufacturers such that any manufacturer&#x27;s updates must go through the carrier&#x27;s &quot;quality control&quot; procedure. You wouldn&#x27;t want an update to make the, say, LTE radio misbehave and break the carrier&#x27;s network would you? Oh no... (and you certainly wouldn&#x27;t want to &quot;forget&quot; to replace the good default app with the Carrier&#x27;s crappy one)<p>So there you go, a quick glimpse into the complex economic&#x2F;contractual obligations that delays or blocks Android updates. FWIW, Google has been working both technically and contractually to untangle this mess, and is one reason for the existence of their &quot;own&quot; line of Nexus and now Pixel phones.","time":1493256862,"type":"comment"},{"by":"bitmapbrother","id":14208643,"kids":[{"by":"tyingq","id":14208795,"kids":[{"by":"bitmapbrother","id":14209467,"kids":[{"by":"MichaelGG","id":14209622,"kids":[{"by":"bitmapbrother","id":14209778,"kids":[{"by":"pas","id":14210219,"kids":[{"by":"sangnoir","id":14215524,"parent":14210219,"text":"Carriers would just get more money: &quot;Your phone is too old for Google. Here&#x27;s a link to our special offers for new phones that play nice with Google&quot;","time":1493333699,"type":"comment"}],"parent":14209778,"text":"Google could selectively disable play services with a very scary warning. Simply, if you are on a very old version of Android, display an alert that tells the end user to complain at the carrier.","time":1493285020,"type":"comment"}],"parent":14209622,"text":"In the case of the carrier preventing the transmission of patches or OS upgrades you would be punishing the OEM for a problem created by the carrier and out of the control of the OEM. Tangentially, If I was a carrier I would use this to my advantage when negotiating. If you thought carriers were bad now, just wait until they have the power to withhold Google Play services and apps to an OEM&#x27;s future phones.","time":1493277294,"type":"comment"}],"parent":14209467,"text":"Easy, just apply the block to new devices -- the only thing the OEMs care about. They can easily write the contract to that effect.","time":1493274811,"type":"comment"}],"parent":14208795,"text":"So let&#x27;s say they put in a rule that said all OEM&#x27;s must update their devices every month or lose access to Google Play apps and services. What happens when the carriers start delaying or preventing the patches and updates from flowing to the devices? Does Google uphold the rule and revoke their access? Or do they start extending the time by 1 month? Or how about 2 months? Or what about 6 months? What&#x27;s the point of adding a rule you can&#x27;t enforce?","time":1493272454,"type":"comment"}],"parent":14208643,"text":"They set the terms for licensing Android, and have used leverage for other things they want or don&#x27;t want.<p>Edit: Yes, really. <a href=\"https:&#x2F;&#x2F;arstechnica.com&#x2F;gadgets&#x2F;2014&#x2F;02&#x2F;new-android-oem-licensing-terms-leak-open-comes-with-restrictions&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;arstechnica.com&#x2F;gadgets&#x2F;2014&#x2F;02&#x2F;new-android-oem-lice...</a>","time":1493260840,"type":"comment"}],"parent":14208439,"text":"I&#x27;m constantly amazed by how some people think Google has this magical ability to update an OS that was built by another OEM. That&#x27;s like asking Debian to update Ubuntu.","time":1493258502,"type":"comment"},{"by":"LeifCarrotson","id":14209935,"kids":[{"by":"pas","id":14210213,"parent":14209935,"text":"<a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=14208865\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=14208865</a>","time":1493284880,"type":"comment"}],"parent":14208439,"text":"Similar, but the system architecture is different.<p>The CA system is composed of alow-moving companies like Symantec dependent on, or more specifically, beholden to fast-moving companies like Google.<p>In the mobile space, the situation is inverted. Android can move quickly, but they have little to no leverage over the slow-moving carriers.","time":1493280035,"type":"comment"}],"parent":14208357,"text":"Isn&#x27;t that largely Google&#x27;s stance with regard to Android? They blame the carriers and point to how slow they are, meanwhile tons of smart phones go without patching, which is no good for the general internet or users&#x27;","time":1493255781,"type":"comment"},{"by":"eykanal","id":14208545,"kids":[{"by":"Aaron1011","id":14208603,"parent":14208545,"text":"&gt; The point of the first part of their post is not &quot;we&#x27;re too big&quot;, it&#x27;s &quot;a move like this would disrupt the lives of an awful lot of people.&quot;<p>The real question is, what effect would doing nothing have on all of those people? If Symantec continues to mis-issue certificates (as they have done repeatedly: <a href=\"https:&#x2F;&#x2F;wiki.mozilla.org&#x2F;CA:Symantec_Issues\" rel=\"nofollow\">https:&#x2F;&#x2F;wiki.mozilla.org&#x2F;CA:Symantec_Issues</a>), keeping their EV status intact could be much, much worse for them.<p>&gt; As the blog post states explicitly, there are a lot of use cases where updating a deployed app is very difficult, almost impossible, or cost prohibitive.<p>As others have pointed out, this change would actually have no effect on the &#x27;complex dependencies&#x27; Symantec identified:<p>* This has absolutely no effect on embedded devices, which are certainly not running Chrome.\n* Mobile applications that pin certificates shouldn&#x27;t be affected, since the very fact that they&#x27;re pinning certificates means they&#x27;re not using Chrome (there&#x27;s no way for an app to tell Chrome to pin a specific certificate).","time":1493258020,"type":"comment"},{"by":"tptacek","id":14208567,"kids":[{"by":"mentat","id":14209107,"parent":14208567,"text":"The &quot;survey&quot; that accompanied the original customer facing message was so biased as to be ridiculous. Like &quot;Will Google&#x27;s proposed change be disruptive, massively disruptive, or business ending for you?&quot;","time":1493266132,"type":"comment"}],"parent":14208545,"text":"Part of the premise of Google&#x27;s plan is that Symantec&#x27;s customers will experience disruption. If you poll Symantec&#x27;s customers, the overwhelming majority of them will day &quot;no, don&#x27;t punish our CA&quot;. We didn&#x27;t need Symantec to tell us that.<p>On the other hand, Symantec&#x27;s CA was caught mis-issuing certificates. That affects everyone, not just Symantec&#x27;s own customers.","time":1493257452,"type":"comment"},{"by":"fosco","id":14208560,"kids":[{"by":"mdip","id":14208750,"parent":14208560,"text":"&gt; not doing something is allowing the previous lack of security standards to put all of those people in danger.<p>So glad others are making this point.  Not to mention that the CA system is one who&#x27;s <i>sole feature</i> and <i>only purpose</i> is trust.  There is <i>zero</i> security if you can&#x27;t trust the root.  We&#x27;d love to live in a world where providing security didn&#x27;t require a trusted third-party, but that&#x27;s not the world the internet operates on, today.  Transparency is provided by establishing strict guidelines and expectations for CAs.  Maintaining this trust is enforcing those guidelines equally among the CAs regardless of size&#x2F;scope and punishing (preferably <i>severely</i>) any violations.  Otherwise the old saying of &quot;rules that are not enforced are just suggestions&quot; comes into play.<p>Because it&#x27;s a trust-based model, the consequences for violations of that trust have to be strong enough to make a compromised actor willing to refuse government intelligence divisions, corporate criminal actors or even organized crime that has the resources and could stoop to any level of blackmail&#x2F;bribery to squeeze out a certificate that would allow one to spoof a connection to a high-value target like Amazon, Google, Paypal or Microsoft.","time":1493260053,"type":"comment"}],"parent":14208545,"text":"&gt;) The point of the first part of their post is not &quot;we&#x27;re too big&quot;, it&#x27;s &quot;a move like this would disrupt the lives of an awful lot of people.&quot;<p>not doing something is allowing the previous lack of security standards to put all of those people in danger.  there is a tradeoff with every decision.<p>the entire PKI ecoysystem relies on self management and I think google is making a tough decision, but one that ultimately has already led to better decisions regarding security.","time":1493257357,"type":"comment"},{"by":"kevinburke","id":14208704,"parent":14208545,"text":"They&#x27;ve been playing the same game for literally 10 years<p><a href=\"https:&#x2F;&#x2F;medium.com&#x2F;@sleevi_&#x2F;a-history-of-hard-choices-c1e1cc9bb089\" rel=\"nofollow\">https:&#x2F;&#x2F;medium.com&#x2F;@sleevi_&#x2F;a-history-of-hard-choices-c1e1cc...</a>","time":1493259414,"type":"comment"},{"by":"ryandrake","id":14209011,"parent":14208545,"text":"Unless your software is running on a 30 year old embedded system, located in a submarine, 5KM below the ocean, guarded by tigers, and stuck there for the next decade, it&#x27;s hard to muster sympathy about how hard updating your software is. If the cost to a company to deploy an update their software is really greater than the cost to just allowing the software fail, then maybe they should just let the software fail and prepare a great story for their users--I&#x27;d love to hear it.","time":1493264266,"type":"comment"},{"by":"MichaelGG","id":14209606,"parent":14208545,"text":"Again, how is this anyone else&#x27;s problem? It&#x27;d be rewarding bad behaviour and poor technical solutions. These companies <i>will</i> find a way to workaround it.<p>A suitable compromise could be an override switch that can only be activated via Group Policy. That&#x27;d at least be a reasonable suggestion from Symantec. Not their current offer of nothing.<p>As far as &quot;updating&quot; my point was that they described a routine mobile app update as &quot;recoding&quot; as if it&#x27;d be lots of actual code to rewrite. And again, the fact a large company has no way to easily update in face of a security problem really is their problem, not ours.","time":1493274534,"type":"comment"},{"by":"dragonwriter","id":14211203,"parent":14208545,"text":"&gt; The point of the first part of their post is not &quot;we&#x27;re too big&quot;, it&#x27;s &quot;a move like this would disrupt the lives of an awful lot of people.&quot;<p>Those are precisely equivalent.<p>&gt; Again, remember that the person being punished here is not Symantec;<p>Yes, it is, though you make exactly the standard &quot;too big to fail&quot; argument. yes, customers who relied on the misbehaving CA will also incur some costs, but if misbehaving CAs don&#x27;t see reduced or eliminated trust at the level of browsers and similar trust stores, the entire ecosystem -- including the good actors and their customers -- pays the price as end-user trust in the ecosystem weakens because certificates do not guarantee what they are supposed to. And if any actor is recognized as too big to fail, that creates an unlimited license for bad behavior on the part of that actor at the price of the whole ecosystem.","time":1493299083,"type":"comment"},{"by":"bayfury","id":14208621,"parent":14208545,"text":"Not completely true. There&#x27;s nothing to prevent customers to obtain a new certificate from a reputable CA while keeping the old one around for the embedded devices to use.","time":1493258251,"type":"comment"},{"by":"fredsanford","id":14208901,"parent":14208545,"text":"Symantec should have thought about this before using half ass processes and half ass people in a business that will cost other people money because of their screw ups.","time":1493262577,"type":"comment"},{"by":"pas","id":14210197,"parent":14208545,"text":"&gt; These companies have done nothing wrong,<p>Sometimes doing nothing is the wrong thing. They did wrong by supporting Symantec (or whatever shitty CA they originally did business with that Symantec acquired) with their money.<p>Or if initially they did not know about how shitty Symantec is, now they ought to know, and yes, it&#x27;s a business risk (counterparty&#x2F;vendor risk basically).","time":1493284615,"type":"comment"},{"by":"kbar13","id":14209013,"kids":[{"by":"hdhzy","id":14209430,"kids":[{"by":"majewsky","id":14210041,"parent":14209430,"text":"But isn&#x27;t EV certs where the money is?","time":1493281911,"type":"comment"}],"parent":14209013,"text":"It&#x27;s not that simple as they can backdate the cert, like StartSSL&#x2F;WoSign:<p>&gt; It turns out WoSign has repeatedly been lying to Mozilla about backdating SHA-1 SSL Certificates<p>Source: <a href=\"https:&#x2F;&#x2F;www.riskiq.com&#x2F;blog&#x2F;labs&#x2F;wosign-and-startcom-caught-red-handed&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.riskiq.com&#x2F;blog&#x2F;labs&#x2F;wosign-and-startcom-caught-...</a><p>Certs could be checked via Certificate Transparency but currently this is not required for DV certs.","time":1493271681,"type":"comment"}],"parent":14208545,"text":"would simply refusing to recognize NEW symantec certificates issued after a certain date in the near future be a sufficient compromise? it won&#x27;t affect institutions that have pre-existing certificates, which will eventually expire by themselves.","time":1493264312,"type":"comment"}],"parent":14208357,"text":"This comment irritates me.<p>1) The point of the first part of their post is not &quot;we&#x27;re too big&quot;, it&#x27;s &quot;a move like this would disrupt the lives of an awful lot of people.&quot; Even more so, consider what would happen if Google were to update Chrome to not accept these certs. For internal applications, the IT departments of all these companies—which likely total a few hundreds of thousands of users in total—would simply mandate that Chrome is no longer an acceptable browser. For external applications, companies would have to engage in an enormous PR effort to communicate to customers that their product doesn&#x27;t work with Chrome. These companies have done nothing wrong, but they&#x27;re the one being punished, as customers don&#x27;t know and don&#x27;t care about cert issues.<p>2) &quot;Updating&quot; can be an enormous effort. As the blog post states explicitly, there are a lot of use cases where updating a deployed app is very difficult, almost impossible, or cost prohibitive. Again, remember that the person being punished here is not Symantec; you&#x27;re publishing some poor development company who happened to use Symantec—one of the most popular cert providers on the planet—for an SSL cert. Not good.<p>I&#x27;m not taking sides on the issue, because I honestly don&#x27;t know that much about it. But comments like the above really trivialize the huge impact that something like this will have.","time":1493257120,"type":"comment"},{"by":"geofft","id":14208476,"parent":14208357,"text":"There&#x27;s an argument that it&#x27;s <i>good</i> for end user security to force mobile apps to be updated, even if there weren&#x27;t a specific reason to distrust Symantec&#x27;s roots, because who knows when the next Heartbleed will come out.","time":1493256306,"type":"comment"},{"by":"tyingq","id":14208481,"kids":[{"by":"pas","id":14210222,"parent":14208481,"text":"Were Google really nice, they could scan their app store and notify the developers if their app contains embedded shitty certs.","time":1493285109,"type":"comment"}],"parent":14208357,"text":"&gt;recoded, recompiled and redistributed.<p>I suppose that&#x27;s true for mobile apps with embedded certs.  Bet there&#x27;s an app store &#x2F; play store approval logjam for Symantec customers that miss this news, and all come crashing in after the expiry.","time":1493256380,"type":"comment"},{"deleted":true,"id":14208452,"parent":14208357,"time":1493256019,"type":"comment"}],"parent":14208227,"text":"&gt;require these applications to be recoded, recompiled and redistributed.<p>Aka &quot;updated&quot;.<p>The entire post is basically &quot;ok how about we be really good from now on and suffer no consequences, cause it&#x27;d be really shitty for us if we had to be penalised&quot;.<p>They also posture a lot talking about how big their customers are, almost boasting about how inflexible and slow these big companies are, as if that&#x27;s somehow Google&#x27;s or general Internet users&#x27; problem.","time":1493254723,"type":"comment"},{"by":"ahmeni","id":14208360,"parent":14208227,"text":"There is a significant amount of &quot;we will&quot; language in here, rather than &quot;we have started&quot; or &quot;have already begun&quot;. The choice of language speaks volumes that they only appear to be willing to take necessary audit action if Google agrees to it, rather than something that needs to be done regardless.","time":1493254767,"type":"comment"},{"by":"durkie","id":14208499,"kids":[{"by":"ploxiln","id":14208623,"kids":[{"by":"X-Cubed","id":14208769,"kids":[{"by":"ploxiln","id":14209744,"parent":14208769,"text":"True, but you know how it is ... the management of these companies would <i>prefer</i> to do <i>nothing</i> if it is possible. They&#x27;ll put most of their efforts into that strategy.","time":1493276806,"type":"comment"},{"by":"toast0","id":14208972,"kids":[{"by":"majewsky","id":14210054,"parent":14208972,"text":"I know it&#x27;s not going to help companies which pinned Symantec, but that&#x27;s <i>exactly</i> why every serious guide to HPKP will have you pin two separate CAs.","time":1493282092,"type":"comment"}],"parent":14208769,"text":"You have to have planned for this (or be lucky) though. Some people just put their api on www.example.com; assuming you have clients in the field which have pinned BIG CA, and you&#x27;ve got HSTS preloaded (because you&#x27;re forward thinking). Unless you can detect Chrome N+1 from your existing clients during the TLS handshake, you have to pick between browsers or existing clients.<p>If Chrome ships this at the same time as re-enabling TLS 1.3 support, that would be a decent way to target, since presumably very few of your distributed clients are using TLS 1.3.","time":1493263663,"type":"comment"}],"parent":14208623,"text":"An easier way around this sort of issue is to change their web app to use a different domain, and only put the new certificate from a different CA on that domain. It&#x27;s not necessary to update every device.<p>Embedded devices =&gt; <a href=\"https:&#x2F;&#x2F;api.example.com\" rel=\"nofollow\">https:&#x2F;&#x2F;api.example.com</a> (Symantec cert)<p>Browsers =&gt; <a href=\"https:&#x2F;&#x2F;new-api.example.com\" rel=\"nofollow\">https:&#x2F;&#x2F;new-api.example.com</a> (New trusted cert)<p>Another approach is that if the devices are old enough they&#x27;re probably using a deprecated version of TLS, so the existing <a href=\"https:&#x2F;&#x2F;api.example.com\" rel=\"nofollow\">https:&#x2F;&#x2F;api.example.com</a> server could choose which certificate to issue based on the version of TLS offered by the client.","time":1493260387,"type":"comment"}],"parent":14208499,"text":"Imagine the embedded device or mobile app connects to a <a href=\"https:&#x2F;&#x2F;api.example.com&#x2F;..\" rel=\"nofollow\">https:&#x2F;&#x2F;api.example.com&#x2F;..</a>. and so does their web app. They need to use a new certificate for api.example.com, signed by a different CA root, because when Chrome tries to run the web app it won&#x27;t trust the old certificate, nor a new cert signed by the old root. So they get a new cert signed by a different root so Chrome works, but then the embedded or mobile apps stop working.<p>In this case the story is more complicated - I think new certificates signed by existing Symantec CA roots would be trusted if their duration is 90 days or less. Historically, most CAs offered one, two, or three year duration. Presumably, the &quot;big customers&quot; would not accept the need to rotate their certificates for this purpose in less than 90 days, they need their 3 years because it takes over 90 days to get something through their bureaucracy. And presumably there are other things they can&#x27;t do in 90 days, like update an embedded device configuration or firmware, or a mobile app.<p>Of course it depends on the particulars, but of course these &quot;big customers&quot; can&#x27;t figure any particulars out in 90 days. But that&#x27;s why Google proposed a slow sliding scale that would gradually reduce the max duration allowed over the course of a year, so random unknown stuff breaks more gradually throughout the year, not in one huge event like Symantec&#x27;s blog post suggests.","time":1493258285,"type":"comment"},{"by":"ademarre","id":14208573,"kids":[{"by":"Manishearth","id":14208787,"kids":[{"by":"wnoise","id":14208908,"kids":[{"by":"Manishearth","id":14209060,"parent":14208908,"text":"Huh, okay. Surprised that&#x27;s not possible. IIRC letsencrypt did something like this to bootstrap but I guess you can have a root sign a root, but not have two roots sign something and have both in the same cert.<p>I&#x27;ve always been of the opinion that the rogue&#x2F;careless CA problem can be solved by mandating N root sigs and recommending M&gt;N. In a system with multiple independent LetsEncrypt like entities this is doable. If a CA needs to be revoked you can do it in a much easier way here, since it&#x27;s still ok to transitively allow sites with N-1 certs and one now-disallowed cert signed by that CA. Doesn&#x27;t fix all the problems but it certainly removes the inertia behind kicking out bad CAs.<p>Looks like we&#x27;d need a x509 extension to do this then. :&#x2F;","time":1493265313,"type":"comment"}],"parent":14208787,"text":"Unfortunately, you can&#x27;t keep multiple chains in a single X.509 certificate.  While you can have a given key signed by multiple CAs, AIUI, this just lets you switch easily, not tell a client about both, and just work if they trust either CA.","time":1493262697,"type":"comment"}],"parent":14208573,"text":"Iirc you can have certs signed by multiple roots though, right? In which case these sites can just get their cert signed by the pinned symantec root and a real still-valid root. Nobody&#x27;s stopping symantec from signing new certs, they just won&#x27;t work in Chrome (and likely other browsers)<p>Or maybe I&#x27;ve misunderstood the situation.","time":1493260702,"type":"comment"}],"parent":14208499,"text":"I think the point there is that if Chrome doesn&#x27;t trust that CA, then the servers will need to be updated to use a different CA, which will break clients that pinned the old CA.","time":1493257549,"type":"comment"},{"by":"dragonwriter","id":14208622,"parent":14208499,"text":"If the embedded devices are accessed over the net by Chrome, or access services that also need to be accessed by Chrome, then there is an issue.<p>But I don&#x27;t think Google is going to be swayed by &quot;you can&#x27;t distrust us if we do wrong because too much depends on us&quot; because if they do, it encourages laxness at big CAs.","time":1493258274,"type":"comment"},{"by":"viraptor","id":14208565,"parent":14208499,"text":"It was either a bizarre misunderstanding on what will happen on Symantec&#x27;s side, or &quot;pinned&quot; was used not in the technical meaning.<p>I could see someone translating &quot;these devices use Symantec&#x27;s server certs and serve web traffic&quot; to &quot;these devices are pinned to certs issued by Symantec&quot;. But if that&#x27;s the case, they should pay more attention in announcements like this one...","time":1493257402,"type":"comment"}],"parent":14208227,"text":"&gt; Embedded devices that are pinned to certificates issued by a Symantec public root to communicate to resources over the Internet or Intranet. Replacing these certificates would result in immediate failures and the need to recode and reimage the firmware for these devices.<p>&gt; Mobile applications that have pinned certificates. Replacing server certificates would require these applications to be recoded, recompiled and redistributed.<p>Are either of these relevant? Isn&#x27;t google&#x27;s proposal to eventually have Chrome stop trusting the Symantec CA system? That change seems like it would have no effect on 1) embedded devices that aren&#x27;t running Chrome 2) things that already are in place that trust the CA.","time":1493256599,"type":"comment"},{"by":"Aaron1011","id":14208454,"kids":[{"by":"mdip","id":14208641,"kids":[{"by":"skuhn","id":14209300,"kids":[{"by":"mdip","id":14215123,"parent":14209300,"text":"... and here I thought comparing security to burning genitals might have been too much of a farce, but that takes the cake, there. :o)","time":1493330418,"type":"comment"}],"parent":14208641,"text":"As it happens, your hypothetical situation was exactly what did transpire: Samsung wanted to remotely deactivate the phones, but Verizon refused on those grounds. <a href=\"http:&#x2F;&#x2F;bgr.com&#x2F;2016&#x2F;12&#x2F;09&#x2F;galaxy-note-7-recall-verizon-samsung&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;bgr.com&#x2F;2016&#x2F;12&#x2F;09&#x2F;galaxy-note-7-recall-verizon-samsu...</a>","time":1493269436,"type":"comment"}],"parent":14208454,"text":"To me it was really bold of them to take the tone and stance that they did with regard to these large organizations.  They&#x27;re making the case as to <i>why</i> Google needed to do what it did ... all of these large organizations that will be severely impacted by having to replace all of these certificates are relying on a CA that has shown itself to not be worthy of the trust that CAs are relied upon to provide.<p>I&#x27;m at a loss for a good analogy so I&#x27;ll pick a lousy one: it&#x27;d be like if Samsung&#x27;s response to the exploding Note 7 recall mandate were &quot;Don&#x27;t do this -- you&#x27;re going to keep some of the biggest customers -- users of our phones -- from being able to make emergency calls&#x2F;check their e-mail&#x2F;respond to texts&quot; ...yeah, but I&#x27;m still not OK with the small possibility that carrying my phone in my front pocket <i>might</i> result in third-degree genital burns.","time":1493258491,"type":"comment"}],"parent":14208227,"text":"&gt; This cohort is an important constituency that we believe has been under-represented to date in the public commentary that has been posted to the Google and Mozilla boards since large organizations rarely authorize employees to engage in such public discussions, particularly in an area related to security.<p>Are these large organizations somehow incapable of putting out official statements regarding CAs? If they&#x27;re being &#x27;under-represented&#x27;, it&#x27;s their own fault for not speaking up.","time":1493256055,"type":"comment"},{"by":"tyingq","id":14208336,"kids":[{"by":"toomuchtodo","id":14208386,"kids":[{"by":"cjbprime","id":14208436,"kids":[{"by":"toomuchtodo","id":14208459,"kids":[{"by":"5ilv3r","id":14208626,"kids":[{"by":"toomuchtodo","id":14208655,"kids":[{"by":"joncampbelldev","id":14208900,"parent":14208655,"text":"i would say the relevant &quot;this is how it works&quot; is having a globally trusted CA system that isn&#x27;t abused by large CAs just because they think no one will dare punish them.\nWhat would any of these large Symantec customers says if in the future their security was compromised due to mis-issued certificates? I doubt they&#x27;d be thrilled they were saved some dev time getting their certificates signed by another root in exchange.\nit&#x27;s very clear from Symantec&#x27;s language here and elsewhere that they wouldn&#x27;t be doing shit about this is chrome weren&#x27;t taking it so seriously","time":1493262576,"type":"comment"}],"parent":14208626,"text":"Easy there Tex, I&#x27;m not arguing. I am simply describing the behaviors between large orgs in a dysfunctional ecosystem&#x2F;marketplace.<p>As you get older, you transition from &quot;this is how it should be!&quot; to &quot;this is how it works, what is a realistic amount of change that can occur?&quot;","time":1493258611,"type":"comment"}],"parent":14208459,"text":"You&#x27;re arguing &quot;Right&quot; vs. &quot;Easy&quot;.","time":1493258299,"type":"comment"}],"parent":14208436,"text":"It&#x27;s always a negotiation. He who has the least to lose wins.<p>&quot;Why isn&#x27;t my browser working??&quot; &quot;So sorry about that, those darn nerds made a change on us.&quot;<p>I have seen this exact scenario play out. Mozilla and Google might be respected in the tech community; to most people they&#x27;re an extremely tiny part of their life. &quot;Your the IT man, just make it work&quot;","time":1493256088,"type":"comment"},{"by":"fooey","id":14209050,"parent":14208436,"text":"And when Google and Moz both are &quot;blocking a security threat&quot; MS and Apple will have follow suit or they&#x27;ll get buried by by PR and advertising attacks.","time":1493265112,"type":"comment"}],"parent":14208386,"text":"Mozilla seems in total agreement with Chrome on this, and it also takes unilateral CA authority action. This is not a negotiation where the orgs have the right side of the power dynamic.","time":1493255697,"type":"comment"},{"by":"tyingq","id":14208396,"kids":[{"by":"eridius","id":14208478,"kids":[{"by":"tyingq","id":14208514,"kids":[{"by":"eridius","id":14208842,"parent":14208514,"text":"You can pin to the CA intermediate cert, which means revocation isn&#x27;t a problem as long as you keep the same CA.","time":1493261832,"type":"comment"}],"parent":14208478,"text":"Ah, yes. If you didn&#x27;t have a backup cert from another provider and missed your 60 day window.  But what was your plan for any other incident that required revocation?  I assume anyone turning on pinning hand wrings over it for a while first.","time":1493256754,"type":"comment"},{"by":"0x0","id":14208582,"kids":[{"by":"pas","id":14210267,"parent":14208582,"text":"That&#x27;s the problem, a lot of Big Corps thought Symantec is okay, because it&#x27;s (was?) expensive as fuck and it has a nice long history! (So reputation. They&#x27;re on NASDAQ, they must be okay!)<p>But that&#x27;s just business as usual. You never know when your vendor goes rouge. And really Big Corps should have plans for these events.","time":1493285738,"type":"comment"}],"parent":14208478,"text":"Finally, there&#x27;s some value in, and a reason to, picking a responsible CA instead of the cheapest or most convenient one!","time":1493257701,"type":"comment"}],"parent":14208396,"text":"Certificate pinning means it&#x27;s a hell of a lot more than just &quot;buying a new cert&quot;.","time":1493256337,"type":"comment"},{"by":"delinka","id":14208442,"kids":[{"by":"AceJohnny2","id":14208541,"kids":[{"by":"dragonwriter","id":14211264,"parent":14208541,"text":"&gt; If you think Let&#x27;s Encrypt is an acceptable solution for all the affected organizations,<p>I think the world is changing in ways which may cause the affected organizations to reconsider what they consider an acceptable CA solution.","time":1493299564,"type":"comment"},{"by":"5ilv3r","id":14208631,"kids":[{"by":"eropple","id":14208710,"parent":14208631,"text":"It really, really doesn&#x27;t matter if a Hacker News poster &quot;sees through it&quot;. It matters that the rest of the world cares.<p>Technically-correct well-actuallys lose to real-world perception ninety-nine percent of the time.","time":1493259467,"type":"comment"}],"parent":14208541,"text":"Or they see through it.","time":1493258348,"type":"comment"}],"parent":14208442,"text":"If you think Let&#x27;s Encrypt is an acceptable solution for all the affected organizations, you know very little about the state of browser certificates.","time":1493257077,"type":"comment"},{"by":"tyingq","id":14208465,"parent":14208442,"text":"In this context, I assume we&#x27;re talking about EV certs. Though LE might be an emergency temp option for the big customers that forgot to plan around this.","time":1493256164,"type":"comment"},{"by":"walrus01","id":14208456,"parent":14208442,"text":"well, for any organization that is doing serious ecommerce these days, you would want an EV SSL cert. Which is about $95&#x2F;year from namecheap or a competitor. The GUI advantages for ordinary totally ignorant end users of seeing the happy green bar at the top are enough to justify the less than $10 per month ongoing cost.","time":1493256069,"type":"comment"}],"parent":14208396,"text":"&quot;Buying&quot; as if Let&#x27;s Encrypt isn&#x27;t a thing. ;-)","time":1493255829,"type":"comment"}],"parent":14208386,"text":"Bold move though, when the fix is just buying a new cert.  And the browser you&#x27;re blocking has majority market share.","time":1493255205,"type":"comment"},{"by":"Animats","id":14208427,"kids":[{"by":"gwu78","id":14209137,"parent":14208427,"text":"<a href=\"https:&#x2F;&#x2F;www.symantec.com&#x2F;connect&#x2F;tr&#x2F;blogs&#x2F;symantec-ca-proposal\" rel=\"nofollow\">https:&#x2F;&#x2F;www.symantec.com&#x2F;connect&#x2F;tr&#x2F;blogs&#x2F;symantec-ca-propos...</a><p>Works for me without Javascript.","time":1493266676,"type":"comment"}],"parent":14208386,"text":"Symantec&#x27;s site won&#x27;t get past &quot;Loading Your Community Experience&quot; with tracking blocked.","time":1493255553,"type":"comment"},{"by":"Etheryte","id":14208579,"kids":[{"by":"andrewjw","id":14225522,"parent":14208579,"text":"Could you give me some info about different banks&#x27; security practices?","time":1493452242,"type":"comment"}],"parent":14208386,"text":"I disagree, a bank should especially be knowledgeable of security (and certificate) issues. I&#x27;ve switched banks because of bad security practices before, it&#x27;s a simple matter of voting with your feet.","time":1493257671,"type":"comment"},{"by":"ropiku","id":14208420,"parent":14208386,"text":"There is a risk but they would already lose all Android users. If Apple and Mozilla then join in they pretty much would lose all iOS and macOS users.<p>For a bank maybe a user would temporarily accommodate but it would affect online stores and SaaS business a lot.","time":1493255478,"type":"comment"},{"by":"mjevans","id":14208397,"kids":[{"by":"mdip","id":14208670,"kids":[{"by":"mjevans","id":14209365,"parent":14208670,"text":"It depends upon the CU in question.  There are typically &#x2F;many&#x2F; local (to a state&#x2F;region) credit unions, so you get multiple shots at this.  SECOND, the reason you&#x27;re better off is that you are literally part owner of that &#x27;union&#x27; as a member.  They inherently (typically) give you better rates and treat you better.","time":1493270742,"type":"comment"},{"deleted":true,"id":14208954,"parent":14208670,"time":1493263352,"type":"comment"}],"parent":14208397,"text":"Have local credit unions gotten better at this?  I left a local credit union a decade ago because they didn&#x27;t offer online banking at all and when they <i>finally</i> did, the security practices they used were <i>horrible</i>.  Memory may not serve perfectly here but I recall they had no EV cert (while common with banks, not everyone had them back then), the login form was provided in-the-clear POSTing to HTTPS and many of the banking functions were issued via GET requests, causing certain &quot;internet accelerator extensions&quot; that worked by requesting data before you clicked them to actually make changes to your accounts on certain pages (this is where memory doesn&#x27;t serve -- I think it was a &quot;theoretical&quot; problem because these extensions usually didn&#x27;t pre-request HTTPS pages for this very reason).","time":1493258915,"type":"comment"}],"parent":14208386,"text":"You&#x27;re better off moving your accounts to a local credit union that does security correctly.","time":1493255208,"type":"comment"}],"parent":14208336,"text":"&quot;This site does not support Chrome. Please use a browser that does not take unilateral CA authority action.&quot; might very well be the response of orgs married to Symantec.<p>As a user, you need your bank (or other large org) more than you need your preference of browser.","time":1493255068,"type":"comment"}],"parent":14208227,"text":"I don&#x27;t think Google was soliciting for a counter proposal from Symantec.  Will be interesting to see their reply, and whether it&#x27;s a literal reply or just a version push of chrome with their original plan.[1]<p>[1] \n<a href=\"https:&#x2F;&#x2F;groups.google.com&#x2F;a&#x2F;chromium.org&#x2F;forum&#x2F;m&#x2F;#!topic&#x2F;blink-dev&#x2F;eUAKwjihhBs\" rel=\"nofollow\">https:&#x2F;&#x2F;groups.google.com&#x2F;a&#x2F;chromium.org&#x2F;forum&#x2F;m&#x2F;#!topic&#x2F;bli...</a><p>Edit: They did ask for community feedback, comments on risk, etc.  But they do already have a timeline.  See link above.","time":1493254432,"type":"comment"},{"by":"bitmapbrother","id":14208474,"parent":14208227,"text":"Symantec is just going through the 5 stages of CA grief. First they were oblivious to it, then they were angry about it and called Google irresponsible. They&#x27;re now at the proposal stage. Next will be depression and finally acceptance for their incompetence.","time":1493256267,"type":"comment"},{"by":"geofft","id":14208472,"kids":[{"by":"mdip","id":14208585,"kids":[{"by":"geofft","id":14208687,"kids":[{"by":"mdip","id":14208828,"parent":14208687,"text":"I hadn&#x27;t read it that way and that&#x27;s a really good point.<p>If you have too many trusted-third parties in a trust model like this, you run into difficulties with enforcement due to scaling problems, but what we&#x27;re seeing is the converse of that.  Symantec went out and bought up other CAs (Verisign is the only one I can remember for some reason) and they&#x27;ve become so large that them losing CA status would be prohibitively damaging to the internet-at-large.  This affects not only enforcement (we don&#x27;t want to move on a bad actor because the consequences of enforcement would be more severe than the consequences of a rule violation), it also negatively affects the trust model -- now if I&#x27;m a bad actor, Symantec is my only target -- even though I <i>could</i> attack the others and yield some of the same benefits of attacking Symantec, if I breach Symantec, the rewards are larger by several orders of magnitude depending on what they store and how they store it.<p>To digress a little ... today ... I&#x27;m not all that surprised that Symantec has reached sort-of monopoly status in this area.  Not because Symantec is a well managed company (I&#x27;m making no statement for or against that despite my personal opinions), but just because so much of The Internet has turned out this way.  If you would have told me in 1998 that for the very vast majority of US Internet users, there&#x27;d be one search engine, one e-commerce company, one (expensive) ISP, one e-mail provider, all of it would be secured by services provided by one company&#x27;s CA and all of that wouldn&#x27;t matter much because the typical Internet experience would basically be a web-enabled, bluer version of AOL[0], I&#x27;d have called you some unfriendly things, but that&#x27;s where we are.  It&#x27;s a centralized system operating on decentralized technology.<p>[0] Oh, and that the &quot;one e-commerce company&quot; was that bookstore web-site and would be responsible for hosting such a large part of the <i>rest</i> of the Internet that when they had a major failure and people had that handful of rare clicks off of FAOLBook, they&#x27;d have about a 50% chance that whatever their target was wouldn&#x27;t load.","time":1493261570,"type":"comment"}],"parent":14208585,"text":"Yup. It&#x27;s very interesting that the argument from Symantec is  that their customers have to buy Symantec certs indefinitely - not that they can&#x27;t replace existing certs in servers, but they&#x27;ve hardcoded the Symantec <i>root</i> in enough clients, such that buying certs from a Symantec competitor will break their clients.<p>Among other things, if what Symantec is saying is true, this means there is zero financial incentive for Symantec to behave. The largest certificate customers in the world have all voluntarily made it infeasible to choose a Symantec competitor, so as long as Symantec has any product at all of any quality, the market will keep buying Symantec.<p>If what Symantec is saying is true, the mere fact that they went to their largest customers and said &quot;Suppose you had to buy certs from one of our competitors, what would you do&quot; and they replied &quot;We&#x27;ve never thought about that before&quot; is itself a major victory.","time":1493259148,"type":"comment"}],"parent":14208472,"text":"&gt; These are some of the most important organizations in the world and you&#x27;ll cause worldwide chaos<p>Thanks for that -- reading this comment connected a few thoughts I was struggling with.<p>Their response felt like &quot;if you don&#x27;t follow through with your plan to punish us we&#x27;ll do all of these nice things for you.&quot;  It reminds me of when my kids get caught doing something wrong and I get &quot;but I&#x27;ll do all of my chores and treat my siblings nice&quot; along with a handful of other promises of future deeds which I know will be partially or completely not-done.  How different the result would have been if they came to me with the chores done and some&#x2F;all of the promises fulfilled already.  It would have been much better for Symantec to have responded with these items in the &quot;completed&quot; category with a smaller number of &quot;we will&#x27;s&quot;.<p>But to the quote I highlighted: the issue at hand is the past failures indicate that &quot;some of the most important organizations in the world&quot; need to <i>not</i> be trusting Symantec in the first place.  They&#x27;ve had a big enough history of failures as a CA to get the attention of Google, who I&#x27;m sure isn&#x27;t terribly interested in degrading the browsing experience of their customers.  The choice becomes: (1) Banhammer Symantec, take the resulting pain all at once, visibly and obviously, and get the problem fixed painfully (but it&#x27;s fixed) or (2) Trust that things will be different <i>this time</i> and if they&#x27;re not, have another security failure of some kind that results in these critically important company&#x27;s customers&#x27; data being exposed, which is a circumstance that will almost certainly go unnoticed for a period of time, will be covered up if the exposure is minimal and covering up the exposure is possible or may not be discovered <i>at all</i>.  The CA system is centered around <i>trusting a handful of rather powerful bodies</i> with an <i>enormous responsibility</i> around the overall security of the Internet.  It&#x27;s not a great model to begin with, but it&#x27;s what we have and I haven&#x27;t read about any alternatives that are viable.  The <i>only</i> way to keep a model like this secure is to ensure that the CAs themselves are actually <i>trustworthy</i> and one of the more likely ways that will happen is to enforce violations of that trust in the manner Google is suggesting.","time":1493257751,"type":"comment"}],"parent":14208227,"text":"&gt; <i>These customers include many of the largest financial services, critical infrastructure, retail and healthcare organizations in the world, as well as many government agencies. This cohort is an important constituency that we believe has been under-represented to date in the public commentary that has been posted to the Google and Mozilla boards since large organizations rarely authorize employees to engage in such public discussions, particularly in an area related to security.</i><p>... well that&#x27;s their problem, right?<p>You can&#x27;t simultaneously say &quot;These are some of the most important organizations in the world and you&#x27;ll cause worldwide chaos&quot; and &quot;Won&#x27;t someone listen to these poor companies, I am the Symantorax, I speak for the cohort, for the cohort has no tongues.&quot;","time":1493256251,"type":"comment"},{"by":"lsh123","id":14208730,"parent":14208227,"text":"CA infrastructure business is built on trust. Symantec lost the trust and got thrown out by Chrome. I hope that as the result Symantec will lose significant amount of CA business thus making a show case for other CAs to demonstrate that good processes and trust are key for staying in this business.","time":1493259723,"type":"comment"},{"by":"jupp0r","id":14208595,"parent":14208227,"text":"Notably missing from their post:<p>This is how we make sure issuing certificates for gmail.com, etc will never happen again. An external audit every 3 months is not going to fix anything.","time":1493257845,"type":"comment"},{"by":"auditplan","id":14210840,"parent":14208227,"text":"Read the statement carefully. Symantec still does not offer a verifiable audit trail like Google&#x27;s Certificate Transparency requires. They just offer to have 3rd parties review the certificates sold to customers. Without a COMPLETE audit trail Symantec can still continue to secretly issue additional certificates not part of any audit trail. The whole announcement rather decreases my trust in Symantec even more.","time":1493294986,"type":"comment"},{"by":"kaishiro","id":14208504,"kids":[{"by":"joncampbelldev","id":14208916,"parent":14208504,"text":"I&#x27;ve heard elsewhere in this thread that blocking ads&#x2F;tracking breaks their site.","time":1493262741,"type":"comment"}],"parent":14208227,"text":"Does anyone else get a blocking &quot;Symantec Connect&quot; and &quot;Loading your community experience&quot; for a good 10 seconds before it loads? Could just be my mobile connection but man is that lame.","time":1493256645,"type":"comment"},{"by":"jwilk","id":14212070,"parent":14208227,"text":"Archived copy, which can be read with JS disabled:<p><a href=\"https:&#x2F;&#x2F;archive.fo&#x2F;FMemh\" rel=\"nofollow\">https:&#x2F;&#x2F;archive.fo&#x2F;FMemh</a>","time":1493305933,"type":"comment"},{"by":"chaz6","id":14209667,"parent":14208227,"text":"The irony is, for an industry based on trust, if this abuse is not penalized, then the industry as a whole is pointless.","time":1493275604,"type":"comment"},{"by":"dtemp","id":14208904,"parent":14208227,"text":"I&#x27;m still trying to figure out if my 36 month wildcard carts from RapidSSL are going to be distrusted. Their intermediate is signed by GeoTrust which is owned by Symantec, and a blog post says with Chrome 59, certs with a period over 33 months will be distrusted. Chrome Canary on v60 shows them still working.","time":1493262634,"type":"comment"},{"by":"unixhero","id":14209837,"parent":14208227,"text":"&quot;Community&quot; - as if we are downstream, something easily managed.<p>I see it as a polite way of saying &quot;You kids&quot;.","time":1493278384,"type":"comment"},{"by":"revelation","id":14208347,"kids":[{"by":"will_hughes","id":14208744,"kids":[{"by":"Pyxl101","id":14208862,"kids":[{"by":"peeters","id":14208999,"kids":[{"by":"Pyxl101","id":14209073,"parent":14208999,"text":"Sure. If api.mysite.com supports both web browsers and embedded devices, then you can issue a certificate for it your publicly-trusted CA of choice, and then can cross-sign that certificate with the Symantec CA.","time":1493265481,"type":"comment"}],"parent":14208862,"text":"You have api.mysite.com which serves both an embedded device as well as your site.  To allow the site to be viewed in Chrome, you need a new cert for your API, and so you now have to either update your site to point to a different endpoint, or update your devices to accept the new cert.  Sure it might be easier to do the former for some companies, but either way there&#x27;s certainly a cost.","time":1493264003,"type":"comment"},{"by":"will_hughes","id":14208978,"kids":[{"by":"Pyxl101","id":14213480,"parent":14208978,"text":"That certificate can be signed by whatever CAs you wish to use, including Symantec and others.","time":1493315985,"type":"comment"}],"parent":14208862,"text":"Clients have no way to indicate what CAs they trust, so my infrastructure has to just present a certificate and say &quot;Here I am&quot;<p>So now if Google go ahead and distrust Symantec CAs, I need to duplicate that infrstructure (or at least the configuration at load balancers, etc) - this leads to all sorts of complexity.","time":1493263762,"type":"comment"}],"parent":14208744,"text":"&gt; There&#x27;s millions of internet-connected set top boxes, tvs, and dvd&#x2F;bluray players deployed around the world that run with a limited set of supported CAs.<p>What exactly is the issue? If an embedded device trusts Symantec CA, then connections from the device to its central servers will continue working without interruption.<p>In this example, the device trusts the Symantec CA, and the server presents a certificate signed by the Symantec CA. Everything&#x27;s hunky-dory. What&#x27;s the problem?","time":1493262124,"type":"comment"},{"by":"revelation","id":14211541,"parent":14208744,"text":"If you control the client and you control the servers it needs to communicate with, then you should probably not be using the public CA system.<p>Well yes if your &quot;embedded&quot; device has a user-facing webbrowser you will need the public CA system, but then I&#x27;d wager if you shipped such a device and don&#x27;t have ongoing updates you have much much bigger problems than an outdated set of root CAs.<p>But there is zero reason for your mobile app communicating exclusively with your API endpoint to use the public CA system. You&#x27;re paying for a less secure system with all the same hassles.","time":1493302123,"type":"comment"}],"parent":14208347,"text":"I find it hard to believe you can&#x27;t imagine any valid scenario where at least one of those scenarios shouldn&#x27;t be using pubic CAs.<p>I&#x27;ve got personal experience with the first two (embedded devices and mobile apps) having pinned certificates (or limited sets of supported CAs)<p>There&#x27;s millions of internet-connected set top boxes, tvs, and dvd&#x2F;bluray players deployed around the world that run with a limited set of supported CAs. (e: Also, don&#x27;t forget the tons of &#x27;smart&#x27; phones out there running ancient versions of whatever)<p>If you&#x27;re someone who supports applications that run on those, then your choices for what CAs you offer on your API&#x2F;Media&#x2F;etc endpoints is extremely limited. Some of these decisions were made more than a decade ago, and migrating off those is going to take another decade (i.e as old hardware dies).","time":1493259948,"type":"comment"},{"by":"ahmeni","id":14208367,"kids":[{"by":"geofft","id":14208490,"parent":14208367,"text":"I&#x27;m curious if people other than LE have tried deploying Boulder in production, now that it exists. It seems like probably close to what a public CA wants.<p>Ideally you&#x27;d have some way of tying it into some internal authorization database instead of relying on HTTP challenges, but HTTP challenges would work too.<p><a href=\"https:&#x2F;&#x2F;github.com&#x2F;letsencrypt&#x2F;boulder\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;letsencrypt&#x2F;boulder</a>","time":1493256457,"type":"comment"},{"by":"viraptor","id":14208659,"parent":14208367,"text":"The are some very-not-enterprisey internal solutions. For example there&#x27;s Anchor from the OpenStack project with a minimalistic approach (as long as you&#x27;re cool with the idea of rotating certs daily)","time":1493258664,"type":"comment"},{"by":"revelation","id":14208394,"kids":[{"by":"ahmeni","id":14208479,"parent":14208394,"text":"There&#x27;s a massive logical leap between having an API and having certificates on public FTP servers.<p>An API is required for you to have proper infrastructure as code and leaving any bit to human input other than another validation step in the automated process is waiting for errors to happen (invalid or incorrectly spelled cert info, missing cert chains, wrong cert chains, etc.).<p>Symantec even calls out how much work these companies will have to do because so few of them have a proper certificate management system in place that&#x27;s come back to bite them.","time":1493256353,"type":"comment"},{"by":"viraptor","id":14208583,"kids":[{"by":"revelation","id":14208653,"kids":[{"by":"viraptor","id":14208721,"parent":14208653,"text":"The topic was internal CAs. Those have completely different requirements and possibilities than public ones. The authentication will look completely different as well. You just can&#x27;t compare those issues.<p>And you&#x27;re missing the point I raised as well - if you have hosts coming up automatically, you either need automatic certificates, or shared keys. As long as you rely on SSL, there&#x27;s no other way to go.<p>(For example of authentication: public CA verifies your domain, internal CA can ask the hypervisor to verify a token on your instance - not remotely in the same class)","time":1493259550,"type":"comment"}],"parent":14208583,"text":"If you&#x27;re going to automatically create certificates you are shifting the entire authentication burden to that automated system.<p>This is the exact issue with the public CA system, their automated processes have been found lacking and now what they certify can not be trusted.","time":1493258590,"type":"comment"},{"dead":true,"deleted":true,"id":14208654,"parent":14208583,"time":1493258593,"type":"comment"}],"parent":14208394,"text":"There&#x27;s more to it than you&#x27;ve seen so far. Think about environments with hosts starting on demand. You need to encrypt data in flight -&gt; how do you automatically assign a new certificate to an instance on startup? You can&#x27;t do it with an airgapped system.","time":1493257719,"type":"comment"},{"by":"hiddencost","id":14208424,"parent":14208394,"text":"Practically the answer is &quot;they pass it around via email&quot;...","time":1493255500,"type":"comment"},{"by":"Spooky23","id":14208414,"kids":[{"by":"revelation","id":14208589,"kids":[{"by":"Spooky23","id":14208745,"parent":14208589,"text":"They sure do! We have an offline root on an HSM for various reasons.<p>We looked at various systems to manage intermediate ca issuance and reminders for renewal and the cost was incredible... most were &gt;$200k!<p>Using scripts to automatically generate certificates and using the ugly but effective Windows CA web interface for &quot;vanity&quot; stuff does 90% of what those solutions do. I think we had an intern write a monitoring plugin to open tickets for soon to expire certificates and a few other things that covered the remaining 10%.","time":1493259965,"type":"comment"}],"parent":14208414,"text":"I&#x27;m sure people make plenty of money wrapping OpenSSL in ever more elaborate Enterprise schemes.<p>But if the net effect is that one bug in a frontend can cause the server to tell the cert server to tell the secure enclave to tell the wire mesh protected crypto coprocessor to sign a bogus certificate then what are we really doing here.","time":1493257803,"type":"comment"},{"by":"tyingq","id":14208724,"parent":14208414,"text":"I know several companies are using Amazon&#x27;s ACM and public domains that resolve to internal ip addresses.  It&#x27;s not 100% automated, as it requires a validation email, but better than most homegrown stuff.","time":1493259585,"type":"comment"}],"parent":14208394,"text":"Seriously. The fancy CA systems are wacky expensive.","time":1493255414,"type":"comment"}],"parent":14208367,"text":"What API do you need? The signing system should be airgapped or you end up with the same shit that is the public CA system such as roots sitting on public FTP servers.<p>It&#x27;s a bunch of command line scripts because if you are using it any different way you are probably doing it wrong.","time":1493255169,"type":"comment"}],"parent":14208347,"text":"Given some of the internal CA systems I&#x27;ve dealt within the past, I&#x27;d almost prefer a public CA in some cases. Sometimes your internal CA is just the group with manual access to the certificate provisioning and signing systems with either no API or some awful re-implemented API.","time":1493254855,"type":"comment"},{"by":"justinjlynn","id":14208519,"parent":14208347,"text":"They know exactly what they&#x27;ve done.","time":1493256803,"type":"comment"}],"parent":14208227,"text":"I love how none of the example &quot;dependencies&quot; they give should be using public CA in the first place.","time":1493254569,"type":"comment"},{"by":"varunvkrishnan","id":14210346,"parent":14208227,"text":"Incompetence​ needs to be penalized. Period. Symantec&#x27;s reasoning is pathetic and infact a veiled blackmail attempt.","time":1493287032,"type":"comment"}],"id":14208227,"score":125,"url":"https://www.symantec.com/connect/blogs/symantec-ca-proposal","by":"mentat"},"14194026":{"time":1493131921,"type":"story","descendants":46,"title":"Envoy: 7 months later","kids":[{"by":"tedd4u","id":14194573,"kids":[{"by":"aledbf","id":14197232,"parent":14194573,"text":"You can find the project here <a href=\"https:&#x2F;&#x2F;github.com&#x2F;istio&#x2F;manager\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;istio&#x2F;manager</a>","time":1493149164,"type":"comment"}],"parent":14194026,"text":"There was a very interesting talk at Google Next in March that described a way in which the Kubernetes open source team is bringing this sidecar architecture to Kub. In fact I think they are working with the Lyft team. The whole talk is interesting but I&#x27;ve added a time offset to skip to the bit where they talk about sidecar&#x2F;service mesh.<p><a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=3quCoi5YHz4#t=27m59s\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=3quCoi5YHz4#t=27m59s</a><p>Also, there is <a href=\"https:&#x2F;&#x2F;istio.io&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;istio.io&#x2F;</a> but it&#x27;s a placeholder site at the moment.","time":1493135289,"type":"comment"},{"by":"shawabawa3","id":14195577,"kids":[{"by":"sandGorgon","id":14200399,"parent":14195577,"text":"This is a battle that repeats itself ever so often. Same deal with kubernetes config files.<p>It&#x27;s the same opinionated positions of puppet vs chef&#x2F;ansible. Building the tooling in the form of an embedded programming language (lua for nginx, python for ansible) is so much better.<p>But that is a much more polarising position to take. It&#x27;s politically untenable. Ruby engineers will say no to python and vice versa... So you start arriving at Json or XML based configurations which are a programmatic neutral ground.<p>IMHO lua-jit occupies the same political neutrality as XML.","time":1493180296,"type":"comment"},{"by":"henrikschroder","id":14197198,"kids":[{"by":"stickfigure","id":14198742,"kids":[{"by":"shouldbworking","id":14199129,"parent":14198742,"text":"JSON Server Faces™","time":1493162535,"type":"comment"}],"parent":14197198,"text":"Seriously. How about we just call it EJB 4.0?","time":1493159424,"type":"comment"}],"parent":14195577,"text":"I love how history repeats itself.<p>I remember everyone complaining about Spring and similar having these massive XML configuration files, and then people said &quot;never again!&quot;, and moved to very simple JSON formats for their frameworks. And then everyone adds a little bit to the best practices, and over time we get this, again.","time":1493148943,"type":"comment"},{"by":"stock_toaster","id":14216202,"parent":14195577,"text":"I tried to give it a try, and gave up for now.<p>1. quite hard to &quot;give it a spin&quot; without using docker (vomit). I eventually found some random github repo that had centos7  compatible build scripts, and it took quite a while to compile it on a test vm since it had to build gcc and a ton of other stuff. Not sure why they can&#x27;t just supply a static binary &quot;release&quot;.<p>2. The config really is a mess. I managed to get something almost working (only &#x2F; requests went through the proxy, but nothing else for some reason, even though I was using a prefix config). There aren&#x27;t really any good example configs I could find either. There is a weird config builder script with json templates in the configs dir, but it just seemed to spew out some preconfigured madness.<p>I am sure it works great and has more tunables than you can shake a stick at, but for now it seems to be only usable by people who have <i>lots</i> of time to invest in trying it out.","time":1493342088,"type":"comment"},{"by":"mentat","id":14200226,"parent":14195577,"text":"That&#x27;s how they use it, that&#x27;s not how you have to choose to use it. It is one of the most tedious aspects of the tool but all the different aspects exist for a reason, there just needs to be an easy mode for people starting off.","time":1493177565,"type":"comment"},{"by":"bastawhiz","id":14196086,"kids":[{"by":"stock_toaster","id":14197284,"kids":[{"by":"user5994461","id":14198096,"kids":[{"by":"stock_toaster","id":14216437,"parent":14198096,"text":"That actually looks pretty nice. Thanks for the link!","time":1493345747,"type":"comment"}],"parent":14197284,"text":"You can use hjson for human editable json.<p><a href=\"http:&#x2F;&#x2F;hjson.org&#x2F;try.html\" rel=\"nofollow\">http:&#x2F;&#x2F;hjson.org&#x2F;try.html</a><p>Human editable json, with comments, and doesn&#x27;t kill you for a lack of trailing comma.<p>Available libraries in tons of languages.","time":1493154926,"type":"comment"},{"by":"wstrange","id":14198270,"kids":[{"by":"user5994461","id":14199034,"kids":[{"by":"wstrange","id":14199319,"kids":[{"by":"user5994461","id":14201335,"kids":[{"by":"Edmond","id":14205162,"parent":14201335,"text":"I would rather contact you directly but your profile is empty.<p>I would like to introduce you to HiveMind described here: <a href=\"http:&#x2F;&#x2F;blog.crudzilla.com&#x2F;2016&#x2F;10&#x2F;managing-configurations-with-object.html\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.crudzilla.com&#x2F;2016&#x2F;10&#x2F;managing-configurations-wi...</a><p>It addresses the issues that JSSONET does without inventing a new templating language.<p>I am happy to give a skype demo, email me if interested.","time":1493228238,"type":"comment"}],"parent":14199319,"text":"Too much indirection.<p>You get big files filled with variables, loaded from other big files also full of variables. It&#x27;s hard to know what you are setting after a while or where it comes from.<p>After a while playing with configuration systems, I&#x27;m starting to think that configuration should just be hardcoded once and for all.","time":1493194560,"type":"comment"}],"parent":14199034,"text":"Honest question: How so?<p>I have not used it in anger - just played around with it.","time":1493164189,"type":"comment"}],"parent":14198270,"text":"Hopefully, it was avoided on purpose because it&#x27;s a complete nightmare to use.","time":1493161617,"type":"comment"}],"parent":14197284,"text":"Given Google&#x27;s involvement, I am wondering why they did not choose jsonnet?","time":1493156026,"type":"comment"}],"parent":14196086,"text":"Seems like they could have used something a bit nicer to work with too (yaml, libucl, hocon, etc). I am honestly getting tired of editing fiddly json (no comments, last element in list can&#x27;t have a comma, etc) all over the place.","time":1493149460,"type":"comment"}],"parent":14195577,"text":"The example you linked isn&#x27;t so bad. Perhaps a bit verbose for a simple example. The formatting of the json is ugly though, and I think they would do better to not collapse the whitespace inside arrays.","time":1493142036,"type":"comment"}],"parent":14194026,"text":"Looks interesting except imo the configuration makes it basically unusable.<p>They use jinja2 templated json... and there are hundreds of lines for their &quot;simple&quot; examples.<p>Even the &quot;hello world&quot; type example of proxying to google is a mess <a href=\"https:&#x2F;&#x2F;github.com&#x2F;lyft&#x2F;envoy&#x2F;blob&#x2F;master&#x2F;configs&#x2F;google_com_proxy.json\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;lyft&#x2F;envoy&#x2F;blob&#x2F;master&#x2F;configs&#x2F;google_com...</a>","time":1493139638,"type":"comment"},{"by":"josephjacks","id":14194430,"parent":14194026,"text":"Envoy is an extremely exciting project. I&#x27;ve been following it closely since OSS inception and am thrilled to see the upcoming deep integration with the Kubernetes project. Such a natural and complimentary fit!<p>With flexibility as both a side car and host proxy network call fabric for polyglot distributed services, I see Envoy as a kind of modern ESB for the reincarnation of SOA we are seeing in the microservices movement. Congrats to the awesome contributors from Lyft&#x2F;IBM&#x2F;Google and others!","time":1493134402,"type":"comment"},{"by":"moondev","id":14195407,"kids":[{"by":"politician","id":14196881,"kids":[{"by":"Spiritus","id":14197521,"parent":14196881,"text":"I guess that&#x27;s one the reasons they created <a href=\"https:&#x2F;&#x2F;github.com&#x2F;linkerd&#x2F;linkerd-tcp\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;linkerd&#x2F;linkerd-tcp</a>","time":1493151010,"type":"comment"}],"parent":14195407,"text":"linkerd has a dependency on the JVM, k8s doesn&#x27;t, and not everyone wants to pull in the JVM if they&#x27;re not already using it.","time":1493146735,"type":"comment"},{"by":"lobster_johnson","id":14199856,"parent":14195407,"text":"One downside to using Linkerd is that unless you have very few apps — or an overabundance of RAM — you can&#x27;t realistically deploy it as a &quot;sidecar container&quot;. The JVM consumes about 100MB of RAM, by their account; it&#x27;s not lightweight.<p>The sidecar pattern (used by Envoy and by Google&#x27;s new project, istio) is desirable in that it compartmentalizes the rules and logic in the pod that uses them, as opposed to sharing all settings across all apps. Zero dependencies (between pods) is a great way to manage complexity. I haven&#x27;t thought much about it, but there might be latency benefits, too.","time":1493170920,"type":"comment"}],"parent":14194026,"text":"Interesting that it seems like there is a bunch of overlap with linkerd in the k8s space. With both k8s and linkerd being CNCF projects, I wonder why google is putting so many resources behind envoy rather than linkerd. I guess that&#x27;s the beauty of the k8s ecosystem though, freedom and choice to use what you see fit. K8s just provides the rock-solid primitives.","time":1493138968,"type":"comment"},{"by":"TheDong","id":14194456,"kids":[{"by":"moderation","id":14194568,"parent":14194456,"text":"The Lyft team cover the comparison in their docs [1].<p>1. <a href=\"https:&#x2F;&#x2F;lyft.github.io&#x2F;envoy&#x2F;docs&#x2F;intro&#x2F;comparison.html#id7\" rel=\"nofollow\">https:&#x2F;&#x2F;lyft.github.io&#x2F;envoy&#x2F;docs&#x2F;intro&#x2F;comparison.html#id7</a>","time":1493135258,"type":"comment"},{"by":"sandGorgon","id":14194663,"kids":[{"by":"gtirloni","id":14195093,"kids":[{"by":"politician","id":14195400,"parent":14195093,"text":"That&#x27;s correct.  linkerd&#x2F;namerd run on the JVM.","time":1493138912,"type":"comment"},{"by":"sandGorgon","id":14196226,"parent":14195093,"text":"that&#x27;s true - but i was hopeful !","time":1493142831,"type":"comment"}],"parent":14194663,"text":"Isn&#x27;t linkerd in Scala and linkerd-tcp a small subset of it?","time":1493137636,"type":"comment"}],"parent":14194456,"text":"This. Linkerd has been a pretty cool piece of tech. In fact, their rewrite linkerd-tcp is in Rust and is blazingly fast. Also, it works on L4 and can do more stuff than Envoy... though I think that advantage is going to be shortlived.<p>Linkerd guys have been focusing on building deep integration with k8s (as an ingress or sidecar), but this announcement of Envoy trumps it all.<p>&gt;<i>&quot;We are excited to announce that we are working in partnership with both Google and IBM to bring Envoy to Kubernetes. Fun fact: there are now more people working on Envoy at Google than there are at Lyft! We have a lot of other things planned with Google that we will be able to share more about in the coming months.&quot;</i><p>That&#x27;s a bummer for the amazing guys at Buoyant. I had hoped for linkerd to be the next generation of ingress in k8s.<p>Envoy is in C++, while linkerd-tcp is in Rust. I wonder how much role did the choice of tooling play in Google&#x27;s decision to adopt.","time":1493135648,"type":"comment"},{"by":"doublerebel","id":14195199,"parent":14194456,"text":"Also see: eBay&#x2F;fabio, Traefik.io .","time":1493138064,"type":"comment"}],"parent":14194026,"text":"Are envoy and linkerd comparable? They look like they fill similar niches, but I&#x27;m not familiar enough to know what I don&#x27;t know.","time":1493134588,"type":"comment"},{"by":"rdli","id":14195298,"kids":[{"by":"lunch","id":14195508,"kids":[{"by":"rdli","id":14195663,"parent":14195508,"text":"Sorry, I wasn&#x27;t clear. I was referring to using Envoy as an API gateway, not a specific API gateway product. We had to write some wrapper code on top of Envoy that lets you use a REST API to map URLs to services running in your Kube cluster and then dynamically update Envoy config, etc.","time":1493139954,"type":"comment"}],"parent":14195298,"text":"Any reason you chose to use API Gateway for your edge instead of another Envoy with an ELB in front?","time":1493139374,"type":"comment"}],"parent":14194026,"text":"We&#x27;ve been experimenting with Envoy for a few months and have been really impressed with the technology and the responsiveness of the community. We&#x27;re actually deploying an API Gateway built on Envoy so you can easily extend your service mesh all the way out to the edge. Planning on open sourcing it soon (if anyone wants to give it a try, my email is in my profile).","time":1493138507,"type":"comment"},{"by":"msoad","id":14194569,"kids":[{"by":"stellar678","id":14200443,"parent":14194569,"text":"I had no idea what GFE stands for and had to track down [<a href=\"https:&#x2F;&#x2F;medium.com&#x2F;@jerub&#x2F;the-production-environment-at-google-part-2-610884268aaa\" rel=\"nofollow\">https:&#x2F;&#x2F;medium.com&#x2F;@jerub&#x2F;the-production-environment-at-goog...</a>] in order to get a good answer.<p>Envoy bills itself primarily as a service mesh (seeming closest to GSLB &#x2F; Global Software Load Balancer), but also as an edge proxy (seeming closest to GFE &#x2F; Google Front End).<p>Is there any reason to think that it&#x27;s more like GFE than it is like GSLB?","time":1493181139,"type":"comment"},{"by":"curiousDog","id":14195148,"kids":[{"by":"msoad","id":14195299,"parent":14195148,"text":"Sorry mixed up. Yes, GFE is more accurate","time":1493138507,"type":"comment"},{"by":"msoad","dead":true,"id":14195300,"parent":14195148,"text":"Sorry mixed up. Yes, GFE is more accurate","time":1493138508,"type":"comment"}],"parent":14194569,"text":"Wut? More like Kubernetes is like Borg.","time":1493137860,"type":"comment"},{"by":"chuhnk","id":14194863,"parent":14194569,"text":"More like GFE","time":1493136560,"type":"comment"},{"by":"euyyn","id":14204853,"parent":14194569,"text":"Thanks for the translation! :)","time":1493226291,"type":"comment"}],"parent":14194026,"text":"For Googlers out there: Envoy is basically GFE","time":1493135266,"type":"comment"},{"by":"perfmode","id":14200054,"kids":[{"by":"olalonde","id":14200075,"parent":14200054,"text":"I presume because the author was more familiar and experienced with C++.","time":1493174805,"type":"comment"}],"parent":14194026,"text":"I wonder why they chose C++ and not Go.","time":1493174377,"type":"comment"},{"by":"searchfaster","id":14198329,"kids":[{"by":"searchfaster","id":14200672,"parent":14198329,"text":"Just tried it locally, latency is &lt; 1ms..","time":1493185027,"type":"comment"},{"by":"eggie5","id":14198590,"kids":[{"by":"searchfaster","id":14200659,"parent":14198590,"text":"Thanks.. just tried it out with my service, beats nginx for simple http proxying pretty easily by a nice margin.  Envoy supports way more features than nginx too !","time":1493184945,"type":"comment"}],"parent":14198329,"text":"according to the talk I just watched, latency&#x2F;performance was their concern coming out of the gate and was the impetus for writing it in C++...","time":1493158224,"type":"comment"}],"parent":14194026,"text":"Any numbers on latency Envoy adds for each request ?","time":1493156426,"type":"comment"},{"by":"rajesht","id":14199198,"parent":14194026,"text":"An engineering blog without any diagrams?","time":1493163088,"type":"comment"}],"id":14194026,"score":176,"url":"https://eng.lyft.com/envoy-7-months-later-41986c2fd443","by":"mattklein123"},"14220678":{"time":1493396220,"type":"story","descendants":7,"title":"Ask HN: Best tools to handle complex requirements writing?","kids":[{"by":"brudgers","id":14223274,"parent":14220678,"text":"There is an established discipline of Requirements Engineering:<p><a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Requirements_engineering\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Requirements_engineering</a><p>Resources include:<p>IEEE: <a href=\"https:&#x2F;&#x2F;www.ieee.org&#x2F;index.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.ieee.org&#x2F;index.html</a><p>And the Software Engineering Institute: <a href=\"https:&#x2F;&#x2F;www.sei.cmu.edu&#x2F;productlines&#x2F;frame_report&#x2F;req_eng.htm\" rel=\"nofollow\">https:&#x2F;&#x2F;www.sei.cmu.edu&#x2F;productlines&#x2F;frame_report&#x2F;req_eng.ht...</a>","time":1493415479,"type":"comment"},{"by":"itamarst","id":14221721,"kids":[{"by":"tmaly","id":14221966,"kids":[{"by":"itamarst","id":14222650,"parent":14221966,"text":"BDD tools might be useful here: I&#x27;ve heard of people getting good results from getting everyone in room and formally specifying the requirements that way. Don&#x27;t even need the tests to be executable, just well structured.","time":1493410050,"type":"comment"},{"by":"tjalfi","id":14227572,"parent":14221966,"text":"TL;DR - Gherkin end-to-end example<p>BDD has already been mentioned[0] but I thought a concrete example would be helpful.<p>The following excerpts are from a Gherkin specification for bowling[1]. These examples use SpecFlow, Xunit, and C# but the specific technology is not what is important.<p>Here is a Gherkin feature[2] for scoring a game of bowling.<p><pre><code>  Feature: Score Calculation \n    In order to know my performance\n    As a player\n    I want the system to calculate my total score\n</code></pre>\nFeatures consist of scenarios. Here is the scenario[3] for a game with a total score of zero.<p><pre><code>  Scenario: Gutter game\n    Given a new bowling game\n    When all of my balls are landing in the gutter\n    Then my total score should be 0\n</code></pre>\nScenarios are mapped to unit tests. Here is the code[4] that implements this scenario.<p><pre><code>        [Given(@&quot;a new bowling game&quot;)]\n        public void GivenANewBowlingGame()\n        {\n            _game = new Game();\n        }\n\n        [When(@&quot;all of my balls are landing in the gutter&quot;)]\n        public void WhenAllOfMyBallsAreLandingInTheGutter()\n        {\n            for (int i = 0; i &lt; 20; i++)\n            {\n                _game.Roll(0);\n            }\n        }\n\n        [Then(@&quot;my total score should be (\\d+)&quot;)]\n        public void ThenMyTotalScoreShouldBe(int score)\n        {\n            Assert.Equal(score, _game.Score);\n        }\n</code></pre>\nHopefully this is enough to give you a sense of whether Gherkin would work for you.<p>[0] <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=14222650\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=14222650</a><p>[1] <a href=\"https:&#x2F;&#x2F;github.com&#x2F;techtalk&#x2F;SpecFlow-Examples&#x2F;tree&#x2F;master&#x2F;BowlingKata&#x2F;BowlingKata-XUnit&#x2F;Bowling.Specflow\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;techtalk&#x2F;SpecFlow-Examples&#x2F;tree&#x2F;master&#x2F;Bo...</a><p>[2] <a href=\"https:&#x2F;&#x2F;github.com&#x2F;techtalk&#x2F;SpecFlow-Examples&#x2F;blob&#x2F;master&#x2F;BowlingKata&#x2F;BowlingKata-XUnit&#x2F;Bowling.Specflow&#x2F;ScoreCalculationFeature.feature#L1\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;techtalk&#x2F;SpecFlow-Examples&#x2F;blob&#x2F;master&#x2F;Bo...</a><p>[3] <a href=\"https:&#x2F;&#x2F;github.com&#x2F;techtalk&#x2F;SpecFlow-Examples&#x2F;blob&#x2F;master&#x2F;BowlingKata&#x2F;BowlingKata-XUnit&#x2F;Bowling.Specflow&#x2F;ScoreCalculationFeature.feature#L6\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;techtalk&#x2F;SpecFlow-Examples&#x2F;blob&#x2F;master&#x2F;Bo...</a><p>[4] <a href=\"https:&#x2F;&#x2F;github.com&#x2F;techtalk&#x2F;SpecFlow-Examples&#x2F;blob&#x2F;master&#x2F;BowlingKata&#x2F;BowlingKata-XUnit&#x2F;Bowling.Specflow&#x2F;BowlingSteps.cs\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;techtalk&#x2F;SpecFlow-Examples&#x2F;blob&#x2F;master&#x2F;Bo...</a><p>Edited to fix formatting of examples.","time":1493486174,"type":"comment"}],"parent":14221721,"text":"the situation I see quite often is someone from legal submitting a very long set of business requirements.  These requirements do not translate perfectly on the technical side, and if the programmer is not diligent enough, what gets implemented as a specification misses some critical aspect.<p>Without so detailed back and forth with say a business analyst of someone that knows the business and some of the technical domain, the end result is poor.<p>Right now a Twiki or Confluence work great for collaboration of some sense.  But there needs to be some finer level of workflow that could be incorporated into the process.  I was hoping to find a tool that does requirements just 20% better than a word processor or Twiki.","time":1493404977,"type":"comment"}],"parent":14220678,"text":"What scale of complexity? How long do you expect the thing to be? Below a certain threshold just plain old text will do fine.","time":1493403070,"type":"comment"},{"by":"SanjeevSharma","id":14224825,"parent":14220678,"text":"If you want a real industrial&#x2F;DoD grade complexity capable tool: <a href=\"https:&#x2F;&#x2F;www.ibm.com&#x2F;us-en&#x2F;marketplace&#x2F;cloud-requirements-management\" rel=\"nofollow\">https:&#x2F;&#x2F;www.ibm.com&#x2F;us-en&#x2F;marketplace&#x2F;cloud-requirements-man...</a>","time":1493435299,"type":"comment"},{"by":"guilhas","id":14222252,"parent":14220678,"text":"Never tried but...\n<a href=\"https:&#x2F;&#x2F;airtable.com\" rel=\"nofollow\">https:&#x2F;&#x2F;airtable.com</a>","time":1493407060,"type":"comment"}],"id":14220678,"score":14,"by":"tmaly","text":"Can anyone suggest free or paid tools that could handle complex business requirements creation.  I am looking for something that could handle a complex domain where there could be many questions that could arise from the business requirements document.  These questions would have to be reconciled before a proper specification could be created."},"14217701":{"time":1493366736,"type":"story","descendants":41,"title":"Ask HN: What is your company's policy regarding side-projects?","kids":[{"by":"CM30","id":14218647,"parent":14217701,"text":"The last two companies I worked for were pretty clear about it:<p>Everything you work on outside of work is your own property, and we have no real interest in it. Even on work computers, as long as it&#x27;s not part of a client project, then it&#x27;s your property.<p>Honestly, I&#x27;m kind of surprised how many companies seemingly don&#x27;t work like this. I mean, maybe I&#x27;m really lucky in that sense, but I never worked for or even interviewed at a company that cared what their employees were doing in their free time.","time":1493380267,"type":"comment"},{"by":"corobo","id":14218325,"kids":[{"by":"bsharitt","id":14218825,"kids":[{"by":"derekp7","id":14222300,"parent":14218825,"text":"If you really want the job, mention that you do community volunteer work and that you want to make sure that other worthy causes aren&#x27;t affected -- so you want to send the contract to your lawyer, and have it hashed out between lawyers.  Then make sure your lawyer really knows what your goals are so that they can get the wording changed.<p>Specifically, I&#x27;d accept wording that included &quot;excludes personal project work done 100% outside of a work context, unless such work is related to a direct work assignment&quot;.  But a lawyer would have to point out any loopholes in that wording.","time":1493407407,"type":"comment"},{"by":"corobo","id":14218865,"parent":14218825,"text":"Yeah it&#x27;s not something I&#x27;d ever allow in my contract either anymore. &quot;I&#x27;ve never seen it enforced&quot; just means you might be the first person to have a side project, not worth the risk if you can find a job elsewhere","time":1493382917,"type":"comment"}],"parent":14218325,"text":"I had a job offer from a company with that kind of &quot;Everything you create is ours&quot; clause in the contract(along with a pretty broad non-compete). I think a bit part of it was a that it was a remote work position. When I pushed back about it, the guy trying to hire me basically told me &quot;don&#x27;t worry about it, I&#x27;ve seen it enforced&quot;, and I&#x27;m not even sure how legally sound the clauses were, but I ended up not taking the job over it.","time":1493382429,"type":"comment"},{"by":"nolemurs","id":14219197,"kids":[{"by":"corobo","id":14219390,"parent":14219197,"text":"Oh I mean the &quot;we own your ideas&quot; bit. They did enforce the side project part, asking me to take down the site. There were other things going on at the time which meant I had a bit of leverage and we parted ways amicably with the rights to everything side-project being given to me as part of my exit.","time":1493387937,"type":"comment"}],"parent":14218325,"text":"&gt; I&#x27;m not sure how they&#x27;d have enforced it<p>In a lot of cases they probably couldn&#x27;t. The purpose of this sort of clause isn&#x27;t that they can actually use it to claim truly unrelated work you did on your own time. The main purpose of a clause like this is to ensure that if the work is defensibly related to your job you can&#x27;t make the argument that the contract left you a loophole.","time":1493386462,"type":"comment"}],"parent":14217701,"text":"Previous company was essentially &quot;We own everything you create whether during work or not&quot; I think my contract was worded in a way that meant technically speaking any <i>ideas</i> I had while under their employment belong to them too. I&#x27;m not sure how they&#x27;d have enforced it, but was unwilling to challenge it.<p>Major part of my reasoning to leave. I left with a fair bit of leverage due to an unrelated matter so managed to secure all the rights to my side project on the way out.<p>Current job - don&#x27;t compete directly with us and don&#x27;t let it get in the way of your work and we&#x27;re cool with whatever.","time":1493376410,"type":"comment"},{"by":"anandkulkarni","id":14219250,"kids":[{"by":"cableshaft","id":14221971,"parent":14219250,"text":"Some people might not like that, but I think that&#x27;s awesome. I wish more companies operated like that.","time":1493405008,"type":"comment"},{"by":"bbcbasic","id":14224845,"parent":14219250,"text":"Whats the minimum you can get away with. E.g. can you phone it in with a line of python a week.","time":1493435786,"type":"comment"}],"parent":14217701,"text":"At Crowdbotics you are required to be working on at least one side project, either for fun or for profit, at all times.  You own it.","time":1493386837,"type":"comment"},{"by":"mattbgates","id":14234508,"parent":14217701,"text":"When we have downtime at work, I&#x27;m working on side projects. I would hope the company would prefer me working on something than sitting there twittling my thumbs.<p>Any thing I work on is only improving my knowledge for the company itself. I don&#x27;t think they have any policy that it is theirs. Though most of my work is kept on the Internet and very rarely do I ever have the files I am working on on the computer, and if they are, they are just mock files that have no purpose other than UI.<p>I have heard of plenty of companies claiming to own your ideas, but unless you directly stole something from your company, like their core code -- in which case, a lot of Google&#x27;s stuff is open source anyway, so really, how can they claim to own your projects?  And if thats the case, than what share of your own idea do you get?<p>Anyways, unless the company wants to help you market and advertise and sell your product, than they really have no say. But companies will do as they please. They are certainly better off allowing people to be creative.  There are plenty of projects I work on that I&#x27;m sure my company has no interest in. Would they want to claim something I wrote that encourages swearing and cursing? Yeah.. probably not.","time":1493595049,"type":"comment"},{"by":"telebone_man","id":14217745,"kids":[{"by":"Swinx43","id":14218186,"kids":[{"by":"rosbrith","id":14218419,"kids":[{"by":"Swinx43","id":14218844,"kids":[{"by":"nmstoker","id":14218985,"parent":14218844,"text":"My UK contact has no IP terms but the employer added something into the employee handbook claiming to own everything which was a problem for me as I do a number of non-work projects outside work.<p>I had a discussion and got a clarification on the scope and we agreed that it covered specified things with work applicability, so I&#x27;m satisfied now (will start work on the best selling novel and string of number one hits right away!).<p>It was important it wasn&#x27;t just based on a vague ill-defined idea of &quot;outside work&quot; because typically a portion of what is clearly work related IP I generate doesn&#x27;t happen in a formal work situation, yet I understand it as work (and am fine with that) whilst equally there is plenty of non-work IP that is just as clearly in no way work (as it doesn&#x27;t relate to our line of business).","time":1493384327,"type":"comment"}],"parent":14218419,"text":"Yes that is true, I have never known anyone that was called out on this. However I am sure if an invention becomes popular and really valuable that some organisations, espcially big ones, would not hesitate to give it a try.","time":1493382614,"type":"comment"}],"parent":14218186,"text":"Mine (also UK) is similar to what you describe, minus your addendum. It makes reference to agreeing that inventions (new software, I imagine) developed during the course of my employment must be made available to the company for its use. I&#x27;ve never known the company to call anyone out on this.","time":1493377521,"type":"comment"}],"parent":14217745,"text":"That is fantastic to hear! I am also in the UK and every single contract I have signed was accompanied with clauses basically stating that the company owns anything I create while I am employed by them. This includes anything outside of work as well. I believe this is the standard terms for UK contracts. I was lucky in getting my current employer to add an addendum to my contract giving me certain exclusions to this clause, it was however a process to get it past their legal department.","time":1493374248,"type":"comment"}],"parent":14217701,"text":"I won&#x27;t copy paste the terms, but they say any employee can do what they like, as long as it doesn&#x27;t utilise the resources of the business (which are defined as equipment, offices, money, time etc.).<p>And if it does, then the business operates a &#x27;first-refusal&#x27; policy. In cases where the business has decided to utilise the side-project, this is normally combined with financial compensation in some form (a salary raise, a bonus, something like that).<p>FYI, I&#x27;m in the UK (midlands). I think this is quite a liberal approach compared to most. But it seems to motivate staff to think outside the box in the interests of the business.","time":1493367205,"type":"comment"},{"by":"martin_a","id":14218187,"kids":[{"by":"fredm-de","id":14226422,"parent":14218187,"text":"That&#x27;s actually wrong.<p>An employer can require you to inform him about side jobs but is legally not allowed to prohibit you from taking a side job unless you work against his interest (eg. negative impact on your performance or competing with your employer).","time":1493471678,"type":"comment"}],"parent":14217701,"text":"General rule for Germany is, that your employer must allow you to have a job besides your main job.<p>This does probably not really fit to what we understand as &quot;side projects&quot; but if you are making serious money and invest time in it, you´ll have to talk to your employer.<p>Employers will most likely do not allow it, if it´s very time consuming (you need to be fit your main job) or very related to your main job (say: freelancing graphic design while working for a design agency).<p>I found that it really depends on the employer and there is no general rule.","time":1493374261,"type":"comment"},{"by":"alberth","id":14218798,"kids":[{"by":"andy_ppp","id":14218875,"parent":14218798,"text":"The whole of that has been totally debunked and it&#x27;s also illegal in many states.<p>I&#x27;m a contractor and I&#x27;ve been asked to sign some work I did over to the company I work for; it&#x27;s very very clear what &quot;The Software&quot; is in the contract that my client was paying for, why make it so complicated?<p>&quot;Your game designer works for a year and invents 7 games. At the end of the year, she sues you, claiming that she owns 4 of them, because those particular games were invented between 5pm and 9am, when she wasn’t on duty.&quot;<p>You have the option to specify clearly and record what you paid the games developer for; it&#x27;s on you as an employer to show this and it&#x27;s a ridiculous, straw man example.  If you cannot prove that the developer did this work solely for you in exchange for salary then maybe you don&#x27;t deserve to own these games.","time":1493383067,"type":"comment"}],"parent":14217701,"text":"A must read in this topic. Give perspective on <i>why</i> companies want to own your side projects.<p><a href=\"https:&#x2F;&#x2F;www.joelonsoftware.com&#x2F;2016&#x2F;12&#x2F;09&#x2F;developers-side-projects&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.joelonsoftware.com&#x2F;2016&#x2F;12&#x2F;09&#x2F;developers-side-pr...</a><p>TL;DR - companies don&#x27;t want you to sue them in the future where you claim copyright on their product.","time":1493382174,"type":"comment"},{"by":"crypto5","id":14221478,"kids":[{"by":"alok-g","id":14223141,"parent":14221478,"text":"From the link you gave:<p>&gt;&gt; Relate at the time of conception or reduction to practice of the invention to the employer s business, or actual or demonstrably anticipated research or development of the employer; or<p>First of, this is not same as not competing with your employer.<p>&quot;Relate&quot; here is not well-specified.  I was told by a lawyer that if something is in the same trademark category (e.g., software), it can be considered &quot;related&quot;.  So if your work is in the line of the main business of the employer, you are unlikely to be coming up with anything that is not related.  Unless your employer makes software, and your side business is making, ahem, burgers or something.<p>Also from the link:<p>&gt;&gt; Inventions Made by an Employee<p>Note the word &quot;inventions&quot; there.  It is unclear if this is taken to mean just the things that are inventions (e.g., patentable ideas), or also works of copyright.  In other words, if you work for a software company, you create a software side project for image processing, all the source code you write may still be the property of your employer as that source code is a subject of copyright (even in California), though they may not get any inventions encompassed in that source code.<p>PS:  I am not a lawyer, though have read a book or two on this subject.","time":1493414354,"type":"comment"},{"by":"BillyOblivion","id":14222772,"kids":[{"by":"cidibe","id":14224404,"parent":14222772,"text":"Games, luckily for me","time":1493428188,"type":"comment"}],"parent":14221478,"text":"There&#x27;s very little space in the &quot;NOT competing with Google&quot; set.","time":1493411088,"type":"comment"}],"parent":14217701,"text":"&gt; Otherwise, Google owns any IP created while you&#x27;re at the company.<p>Not necessary in California: Any provision in an employment agreement which provides that an employee shall assign, or offer to assign, any of his or her rights in an invention to his or her employer shall not apply to an invention that the employee developed entirely on his or her own time without using the employer s equipment, supplies, facilities, or trade secret information.\n<a href=\"http:&#x2F;&#x2F;law.justia.com&#x2F;codes&#x2F;california&#x2F;2011&#x2F;lab&#x2F;division-3&#x2F;2870-2872&#x2F;2870\" rel=\"nofollow\">http:&#x2F;&#x2F;law.justia.com&#x2F;codes&#x2F;california&#x2F;2011&#x2F;lab&#x2F;division-3&#x2F;2...</a><p>There are exceptions of course, major one: you have not compete with your employer.","time":1493401453,"type":"comment"},{"by":"Artlav","id":14219742,"kids":[{"by":"BillyOblivion","id":14222830,"parent":14219742,"text":"It&#x27;s not really predatory, or at least not in intent (you always have exceptions).<p>The basic rule of thumb when seeing stupid clauses like this is &#x27;Someone did something shift, a lawsuit happened and the words &quot;I didn&#x27;t know I couldn&#x27;t&quot; came out of the defendant&#x27;s mouth and that cost&#x2F;almost cost the plaintiff the case. So now they make it overbroad so you can&#x27;t claim you didn&#x27;t know&#x27;.<p>There have been <i>several</i> cases over the years--one of which got several cow-orkers of mine fired--where the &quot;side project&quot; turned into a real company and it turned out to either be based on the companies source code, or created by looking at the companies source code (in one case a competing product, in another case a complementary product).<p>In some ways it&#x27;s an &quot;anti-predatory&quot; clause.<p>I&#x27;ve mostly been subject to it at much larger companies and defense contractors.<p>It&#x27;s also something that you can usually get a &#x27;waiver&#x27; (or whatever your company calls it) for. Go to your boss, or whomever and get them to put in writing that &quot;Yeah, we know about this, and it&#x27;s ok with us&quot;.","time":1493411586,"type":"comment"}],"parent":14217701,"text":"Huh. Everywhere i worked, the rules were along the lines of &quot;you can do whatever you want as long as the goals&#x2F;deadlines are met&quot;.<p>A company taking copyright of personal projects of it&#x27;s employees is unheard of around here (Russia).<p>I&#x27;ve actually encountered this kind of clause in a contract for working as a subcontractor for an american company (they own rights to everything i made during the contract), but when i pointed it out as unacceptable it was removed without any questions (before signing).<p>So this feels like USA-specific and predatory type of a clause, at least from my perspective.","time":1493390632,"type":"comment"},{"by":"rishabhd","id":14218653,"parent":14217701,"text":"Varies from organization to organization.<p>The current place I work has a policy that they own stuff which I create on my business machine and I am free to pursue interests which do not cause a potential conflict of interest or competition.<p>In my previous organization, it was a simple &quot;we own your ass, home or otherwise and don&#x27;t you dare engage in a side project without informing us&quot; .","time":1493380329,"type":"comment"},{"by":"kentt","id":14219020,"parent":14217701,"text":"At mine you can work on your own project on your company provided computer. You own the IP.  I think it has gone well for everyone.","time":1493384652,"type":"comment"},{"by":"justinhj","id":14219427,"kids":[{"by":"alok-g","id":14223201,"parent":14219427,"text":"1.  They would own everything by default from the point you join the company.  Even if you do not declare past projects in the form, they cannot own it if you can prove that those were past projects from before you joined.  Declaring just makes things easier.  One company asked me for proof of prior existence of these projects; their proposal was to keep my pre-existing source code in an immutable vault that both parties could access in case of a lawsuit, just before I join the company.<p>2.  &quot;New&quot; side projects may not be covered by such declarations, which are about the past.  So if you want to continue some side projects, you should read the language of the agreement carefully, and&#x2F;or, reach an agreement in writing with them that you are working on the said side projects and this is OK with them.","time":1493414912,"type":"comment"},{"by":"xiaoma","id":14219884,"parent":14219427,"text":"It&#x27;s pretty bad if you&#x27;re the kind of person who picks up a new side project each month.","time":1493391582,"type":"comment"}],"parent":14217701,"text":"The last few jobs I&#x27;ve worked have had the policy that they own everything by default but you can declare in writing past and new side projects and ideas to exclude. I think this is a reasonable balance between freedom for me and securing the company interests","time":1493388245,"type":"comment"},{"by":"derekp7","id":14222330,"kids":[{"by":"alok-g","id":14223158,"parent":14222330,"text":"You are usually made to sign those agreements within a few days of joining.  Sometimes you can get a copy ahead of the time, especially if you ask.  Offer letters generally state that the offer is subject to your acceptance of these agreements (that you would later sign).","time":1493414493,"type":"comment"}],"parent":14217701,"text":"A related question -- for companies that assert copyright over all your work done on personal time -- do you typically receive this prior to your start date (along with the job offer letter), or is it something that you have to sign after starting?","time":1493407637,"type":"comment"},{"by":"simon1573","id":14218235,"parent":14217701,"text":"I work at as an IT consultant (developer) and the general policy seems to be that everything that you develop using their hardware belongs to the company. There are no explicit rules regarding side-projects on your own time and hardware though.","time":1493375123,"type":"comment"},{"by":"ericclemmons","id":14225156,"parent":14217701,"text":"Outside of work hours, as long as it doesn&#x27;t compete it&#x27;s yours.","time":1493442804,"type":"comment"},{"by":"devops_monkey","id":14223741,"parent":14217701,"text":"When I left a previous employer, their legal department sent me a certified letter sternly stating that any &quot;thought&quot; or &quot;idea&quot; I had during my employment was their property.","time":1493419271,"type":"comment"},{"by":"Clownshoesms","id":14218609,"parent":14217701,"text":"Most of my contracts have been: everything to do is ours, if it&#x27;s on company computers. Some have snuck in clauses like &quot;Everything you do is ours&quot;, but 0% of them would work in a court of law.","time":1493379788,"type":"comment"},{"by":"bsvalley","id":14219774,"parent":14217701,"text":"Why are we seeing all these questions involving &quot;Google&quot; on &quot;Ask HN&quot; lately?<p>In most of the big companies is as you&#x27;ve described.","time":1493390836,"type":"comment"},{"by":"tmaly","id":14218585,"kids":[{"by":"Clownshoesms","id":14218616,"kids":[{"by":"BillyOblivion","id":14222898,"parent":14218616,"text":"Think about it from the Founder point of view. Very few startups are 8x5. Most expect you to put in a few extra hours, be on call, etc. By letting them know if you&#x27;ve got a side project you plan on <i>dedicating</i> yourself to you are taking those hours out of that pool.<p>If it&#x27;s just for an Open Source project, that that&#x27;s one thing, but if you&#x27;re also working 10 or 20 hours a week with another company then they (a) need to know that they have to account for that in scheduling and expectations and (b) want to know that you&#x27;re not working for a competitor and passing inside information.<p>I had one guy on my team who was working 16 to 24 hours a week at another job, which meant that needed to be careful how I scheduled him (because at the time we didn&#x27;t have enough work to schedule everyone full time. If we had, well then he&#x27;d have to sort that out).","time":1493412143,"type":"comment"}],"parent":14218585,"text":"That&#x27;s crazy town to me. Have you had a frank discussion about that with him? i.e. your own personal time, is your own.","time":1493379911,"type":"comment"}],"parent":14217701,"text":"I had to get permission from the founder for any outside business, even side projects.","time":1493379549,"type":"comment"},{"dead":true,"deleted":true,"id":14227951,"parent":14217701,"time":1493490633,"type":"comment"}],"id":14217701,"score":52,"by":"shubhamjain","text":"I realised today that Google has a separate committee [1] from which the employee needs permission if she wants to continue working on the personal project and also retain the copyright. Otherwise, Google owns any IP created while you&#x27;re at the company.<p>How liberal is your company regarding personal projects?<p>[1]: https:&#x2F;&#x2F;opensource.google.com&#x2F;docs&#x2F;iarc&#x2F;"},"14190937":{"time":1493097061,"type":"story","descendants":5,"title":"A Seven Dimensional Analysis of Hashing Methods [pdf]","kids":[{"by":"aappleby","id":14199744,"parent":14190937,"text":"Really interesting analysis, but constraining their keys to 64-bit integers and using &#x27;hash functions&#x27; that only accept 64-bit integers as input skews the results away from real-world use cases.<p>In practice I&#x27;ve found that a variant of Robin Hood hashing with cache-line-sized bins and a hard limit on how deep to search for movable keys when inserting new keys (max of 3 possible bin locations per key, max search depth of 3 moves per insert) gives very good performance even with high load factors.<p>-Austin, author of MurmurHash","time":1493169496,"type":"comment"},{"by":"tjalfi","id":14190946,"parent":14190937,"text":"The actual title is &quot;A Seven-Dimensional Analysis of Hashing Methods and its Implications on Query Processing&quot;.","time":1493097194,"type":"comment"},{"by":"nosefouratyou","id":14197114,"kids":[{"by":"rurban","id":14201684,"parent":14197114,"text":"This is only to counter worst-case attack scenarios which do not happen in a realistic scenario. Like &gt;100 collisions.<p>Robin Hood or its better cousin Hopscotch hashing, which was forgotten here, counter that scenario much better, with only ~1-3% performance loss on average in the best case, and much better perf. numbers in the average write-heavy case, where their &quot;move to front&quot; strategy pays off. And they have the worst case scenario also covered, unlike all others.","time":1493199132,"type":"comment"},{"by":"shouldbworking","id":14199046,"parent":14197114,"text":"The birthday problem directly relates to Bloom and Cuckoo filters as well. The false positive rate is how often two hashes collide.","time":1493161765,"type":"comment"}],"parent":14190937,"text":"Recently I was reading about hash tables on wikipedia and I was surprised to learn about how much the birthday problem influenced their design.<p>&quot;A real world example of a hash table that uses a self-balancing binary search tree for buckets is the HashMap class in Java version 8.&quot;<p><a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Hash_table#Separate_chaining_with_other_structures\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Hash_table#Separate_chaining_w...</a>","time":1493148260,"type":"comment"}],"id":14190937,"score":113,"url":"http://www.vldb.org/pvldb/vol9/p96-richter.pdf","by":"tjalfi"},"14215957":{"by":"Dim25","descendants":0,"id":14215957,"score":7,"time":1493338792,"title":"Twitter User Sample (Random sample of 400,000 Twitter accounts with metadata)","type":"story","url":"https://github.com/jonbruner/twitter-analysis"},"14202044":{"time":1493204550,"type":"story","descendants":9,"title":"Radboud University connects first click-on arm prosthesis to nerves","kids":[{"by":"thomyorkie","id":14205516,"kids":[{"by":"jessriedel","id":14211848,"parent":14205516,"text":"It&#x27;s a terrible article.  These may be better.<p>Economist: &quot;Artificial limbs that feel like the real thing are getting closer&quot;<p><a href=\"http:&#x2F;&#x2F;www.economist.com&#x2F;news&#x2F;science-and-technology&#x2F;21623580-artificial-limbs-feel-real-thing-are-getting-closer-once-more\" rel=\"nofollow\">http:&#x2F;&#x2F;www.economist.com&#x2F;news&#x2F;science-and-technology&#x2F;2162358...</a><p>Wikipedia: &quot;Osseointegration&quot;<p><a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Osseointegration\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Osseointegration</a><p>Videos of surgery (somewhat graphic) and use of the prosthetic.<p><a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=irtF-kGpaV4\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=irtF-kGpaV4</a>\n<a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=Hmt165ZTPmI\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=Hmt165ZTPmI</a>","time":1493304316,"type":"comment"},{"by":"vorotato","id":14206244,"parent":14205516,"text":"This article really failed in addressing transdermals and how this works without constant infections.","time":1493235390,"type":"comment"}],"parent":14202044,"text":"&gt; Through an opening in the skin, the patient “clicks” the prosthesis onto a metal rod in the bone.<p>So he has a flap of skin that just spreads apart and reveals  this metal rod?  How does he avoid infections?","time":1493230450,"type":"comment"},{"by":"rocqua","id":14205328,"kids":[{"by":"Retric","id":14205871,"parent":14205328,"text":"IMO, the next stop is going to be a drop in price.  Good enough and 2k generally beats awesome and 200k.","time":1493232795,"type":"comment"}],"parent":14202044,"text":"I wonder at what point these arms are going to get better. I suspect it&#x27;d be a lot easier to train a prosthetic arm when there is still a physical arm to be attached. Doing this before a replacement should really cut down on the &#x27;rehabilitation time&#x27;.<p>Perhaps, in the scenario, it is better to just leave to current arm attached and give a prospective cyborg a third arm rather than replacing the current arm.","time":1493229258,"type":"comment"},{"by":"jalk","id":14207303,"kids":[{"by":"bitwize","id":14208596,"kids":[{"by":"Jack000","id":14209472,"parent":14208596,"text":"I&#x27;ve always thought that was an air gap - if you lived in a world where your ghost could be hacked you wouldn&#x27;t want to risk being plugged in just for some text input.","time":1493272489,"type":"comment"}],"parent":14207303,"text":"For the longest time I wondered why that guy from <i>Ghost in the Shell</i> had the fingers that each split into several tiny, blade-like fingers just so he could type faster; if you already have robot hands couldn&#x27;t you send impulses directly to enter stuff into a computer?","time":1493257856,"type":"comment"}],"parent":14202044,"text":"I have been thinking for a long time that such prosthetic arms should also be able to act as USB HID. e.g. send keystokes &quot;directly&quot; from the nerves - optionally merging with the input from a regular keyboard. And once you have that USB cord from your new arm, you might as well pack some flash storage, 2FA device, etc in there.","time":1493242978,"type":"comment"},{"by":"awinter-py","id":14205367,"parent":14202044,"text":"the myoband approach to nerve control is fascinating. they&#x27;re not plugging into the user&#x27;s nervous system, they&#x27;re just measuring what the upper arm does when the user controls their phantom limb.<p>this is a much better ad for myo than the video on myo.com, which looks like a bad remake of the gesture controls from earth final conflict.","time":1493229577,"type":"comment"}],"id":14202044,"score":16,"url":"http://www.alphagalileo.org/ViewItem.aspx?ItemId=174734&CultureCode=en","by":"vezycash"},"14196935":{"by":"mxstbr","descendants":0,"id":14196935,"score":30,"time":1493147015,"title":"One GraphQL Client for JavaScript, iOS, and Android","type":"story","url":"https://dev-blog.apollodata.com/one-graphql-client-for-javascript-ios-and-android-64993c1b7991"},"14221746":{"time":1493403185,"type":"story","descendants":3,"title":"14.2M unemployed people: general strike and protests in Brazil today","kids":[{"by":"kpws","id":14221784,"parent":14221746,"text":"More info here:<p><a href=\"http:&#x2F;&#x2F;www.bbc.com&#x2F;news&#x2F;world-latin-america-39744030\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bbc.com&#x2F;news&#x2F;world-latin-america-39744030</a><p><a href=\"https:&#x2F;&#x2F;www.theguardian.com&#x2F;world&#x2F;2017&#x2F;apr&#x2F;28&#x2F;brazil-corruption-unions-strike-michel-temer-austerity\" rel=\"nofollow\">https:&#x2F;&#x2F;www.theguardian.com&#x2F;world&#x2F;2017&#x2F;apr&#x2F;28&#x2F;brazil-corrupt...</a><p><a href=\"http:&#x2F;&#x2F;www.reuters.com&#x2F;article&#x2F;us-brazil-politics-protests-idUSKBN17U0EX\" rel=\"nofollow\">http:&#x2F;&#x2F;www.reuters.com&#x2F;article&#x2F;us-brazil-politics-protests-i...</a><p><a href=\"http:&#x2F;&#x2F;www.nasdaq.com&#x2F;article&#x2F;brazils-jobless-rate-sets-record-for-5th-month-in-march-20170428-00706\" rel=\"nofollow\">http:&#x2F;&#x2F;www.nasdaq.com&#x2F;article&#x2F;brazils-jobless-rate-sets-reco...</a>","time":1493403588,"type":"comment"},{"by":"binarray2000","id":14222567,"kids":[{"by":"kesselvon","id":14222902,"parent":14222567,"text":"Shadow stats is also entirely bullshit.","time":1493412156,"type":"comment"}],"parent":14221746,"text":"&gt; The ShadowStats Alternate US Unemployment Rate for March  2017 is 22.5%.<p><a href=\"http:&#x2F;&#x2F;www.shadowstats.com&#x2F;alternate_data&#x2F;unemployment-charts\" rel=\"nofollow\">http:&#x2F;&#x2F;www.shadowstats.com&#x2F;alternate_data&#x2F;unemployment-chart...</a>","time":1493409330,"type":"comment"},{"deleted":true,"id":14221923,"parent":14221746,"time":1493404666,"type":"comment"}],"id":14221746,"score":19,"url":"http://imgur.com/a/tvXbS","by":"kpws"},"14222495":{"by":"JustSayNo","descendants":0,"id":14222495,"score":18,"time":1493408820,"title":"Huge Collection of Data Structure and Algorithm Problems","type":"story","url":"http://madhualgo.blogspot.com/"},"14195522":{"time":1493139414,"type":"story","descendants":36,"title":"Show HN: React Timekeeper – Time picker based on the style of Google Keep","kids":[{"by":"butz","id":14197167,"kids":[{"by":"Sujan","id":14201571,"kids":[{"by":"Shywim","id":14201678,"parent":14201571,"text":"You get two hours rings, outer is for 1-12, inner is for 13-00.","time":1493199020,"type":"comment"}],"parent":14197167,"text":"What does it look like for 24 hour format?","time":1493197720,"type":"comment"}],"parent":14195522,"text":"That&#x27;s actually a default time picker on Android, used in all native apps; Keep is just one of them.\n<a href=\"https:&#x2F;&#x2F;material.io&#x2F;guidelines&#x2F;components&#x2F;pickers.html#pickers-time-pickers\" rel=\"nofollow\">https:&#x2F;&#x2F;material.io&#x2F;guidelines&#x2F;components&#x2F;pickers.html#picke...</a>","time":1493148677,"type":"comment"},{"by":"liquidise","id":14199152,"kids":[{"by":"X-Cubed","id":14199547,"kids":[{"by":"r00fus","id":14200788,"kids":[{"by":"nurettin","id":14201774,"parent":14200788,"text":"Yet it is the first thing I tried and it worked. The color feedback on the currently selected number is a good hint.","time":1493200425,"type":"comment"}],"parent":14199547,"text":"Not intuitive at all.  Instead of the snazzy animation on the clock face after selecting hour, the animation should focus more on the hour vs. minute transition.","time":1493186396,"type":"comment"},{"by":"uiri","id":14200002,"parent":14199547,"text":"On Android, typically the dialog closes when one makes one&#x27;s minutes selection. If I make a mistake, I typically just start over since it is at most one or two extra taps.<p>On the Web, I would expect the dialog to go back to hours after selecting minutes. Or to change colour to indicate that it is inactive and allow re-activating it with another click (starting again from hours).","time":1493173508,"type":"comment"},{"by":"rukuu001","id":14199679,"parent":14199547,"text":"&gt; Just like on Android, you can change the hours from the minute screen by clicking the hour number in the top bar.<p>That took me a little while to figure out on Android, but I like the Android interface more than iOS&#x27;s &#x27;spinning wheels&#x27;.<p>Neither is as obvious and intuitive (for me) as picking a date out of a calendar. Has anyone seen a time picker as straight-forward as that?","time":1493168504,"type":"comment"}],"parent":14199152,"text":"Just like on Android, you can change the hours from the minute screen by clicking the hour number in the top bar.<p>You can also reopen the popup without refreshing the page by clicking the link that appears once the popup has closed, just under the selected time.","time":1493167097,"type":"comment"}],"parent":14195522,"text":"This is a nice start but i was confused how i should change my hour selection once i had made it. I was looking for an &quot;Undo&quot; button. Once i selected a minute value the component hid entirely, forcing me to refresh just to figure it out.<p>Rule of thumb: when designing components it is a good practice to ask, on every user click&#x2F;keypress, &quot;what happens if they made a mistake here?&quot;","time":1493162693,"type":"comment"},{"by":"TruthSHIFT","id":14197632,"kids":[{"by":"zuppy","id":14200339,"kids":[{"by":"tracker1","id":14201055,"parent":14200339,"text":"My first experience with mini laptops was similar... the vertical space was very limited, and can&#x27;t say how many times I had to zoom out to dismiss the takover popups on some sites.<p>Phone tends to be even worse, especially when zooming is disabled by a site, I get why, still bugs me though.","time":1493190549,"type":"comment"}],"parent":14197632,"text":"I think this should always be the first question: how does my code behave on mobile? Considering that most (or a huge percent of) people are accessing the web on mobile now and that thos is targeted towards them, this is a kind of a blocking issue that would prevent me for using it.","time":1493179180,"type":"comment"}],"parent":14195522,"text":"I&#x27;m having trouble using the demo on my phone. Is there a way to prevent the page from scrolling?","time":1493151843,"type":"comment"},{"by":"fishnchips","id":14197239,"kids":[{"by":"throwaway2016a","id":14197306,"kids":[{"by":"fishnchips","id":14197340,"parent":14197306,"text":"Oh wow, I haven&#x27;t noticed that. I somehow assumed that you wouldn&#x27;t be putting Google in your tagline if you were not associated with the company. Shame on me.","time":1493149928,"type":"comment"}],"parent":14197239,"text":"FYI. That is not a Google library. It&#x27;s some company called Call-Em-All","time":1493149627,"type":"comment"},{"by":"spoiler","id":14199672,"parent":14197239,"text":"I use Material UI for a few projects, and like it a lot. However, before you rely on it, you should be aware that certain components have pretty horrible performance pitfalls that aren&#x27;t immediately obvious until you have a lot of components on the page (or a lot of updates); they seem to be addressing some of them, though.","time":1493168405,"type":"comment"},{"by":"bsimpson","id":14203679,"parent":14197239,"text":"Oww - those transitions are painful.","time":1493219966,"type":"comment"}],"parent":14195522,"text":"This isn&#x27;t to take away from the awesome work of the OP, but Google has a library of React UI components based on material design, and a similar time picker is one of them - <a href=\"http:&#x2F;&#x2F;www.material-ui.com&#x2F;#&#x2F;components&#x2F;time-picker\" rel=\"nofollow\">http:&#x2F;&#x2F;www.material-ui.com&#x2F;#&#x2F;components&#x2F;time-picker</a>","time":1493149203,"type":"comment"},{"by":"spoiler","id":14197721,"parent":14195522,"text":"The thing I like about this the most is that is uses SVGs. This made me very happy! It&#x27;s a very cool project otherwise too, and I can definitely see myself using it.<p>EDIT: Alternative would be to use HTML and CSS transforms or similar hacky techniques. So, I am glad to see SVGs gaining more popularity.","time":1493152556,"type":"comment"},{"by":"Traubenfuchs","id":14202316,"parent":14195522,"text":"When opening the minute selection dropdown and the selecting time with the dial the dropdown disappears on mouseup instead of mousedown. The same happens when using the hour drop down. I think it should disappear once you mousedown on the dial.<p>Using the dial, you can sometimes start selecting or even drag&#x2F;dropping some parts of the page. Use the css property user-select to prevent users from selecting visual elements that should not be selected. No one is ever going to want to select the text on your AM &#x2F; PM buttons, so don&#x27;t make it selectable.<p>Do people really prefer this over two infinite spinning number selection dials (one for the minute, the other for the hour) like on iOS?","time":1493208902,"type":"comment"},{"by":"datashovel","id":14197403,"parent":14195522,"text":"I&#x27;ve designed and built a few of these.  I&#x27;ve heard both sides of the argument (digital&#x2F;analog).  I find analog better in every way, but in my experience those who prefer digital time pickers are definitely vocal.<p>I&#x27;ve typically created a user config option in any app I&#x27;ve designed so the user can choose whether time pickers are digital or analog.<p>EDIT:  I see that clicking on the numbers at the top pull up a dropdown, which I think is a nice touch.  Designs in the past I&#x27;ve opted for a double-click or double-tap to activate the keyboard so user can type in the number if they wish.","time":1493150274,"type":"comment"},{"by":"rorosaurus","id":14197219,"kids":[{"by":"GranPC","id":14199420,"parent":14197219,"text":"It actually used to be exactly like this in Android, but it got changed to have in-line AM&#x2F;PM pickers like you said.","time":1493165397,"type":"comment"}],"parent":14195522,"text":"I actually like the design of this much more than the default time picker on Android!<p>The AM&#x2F;PM selection in is selector very clear - this is something I choose incorrectly every time I set an alarm on Android.  On Android, the AM&#x2F;PM pickers are inline with the time preview at the top - and you have to guess which one - blue or white - is the currently selected one.<p>Sure, if you stop and think about it, you can figure it out.  This separate picker method in catc&#x27;s selector seems much clearer in every case - especially when a user is in a rush or sleepy!","time":1493149069,"type":"comment"},{"by":"jrfarina","id":14202278,"parent":14195522,"text":"You need to e.preventDefault(). On mobile it scrolls the phone when I drag the handle around.","time":1493208452,"type":"comment"},{"by":"paulddraper","id":14198296,"kids":[{"by":"catc","id":14198449,"parent":14198296,"text":"Open an issue and I&#x27;ll change it.","time":1493157179,"type":"comment"}],"parent":14195522,"text":"Awful contrast.<p>#6c6c6c on #00000<p>You need to bold your text if you really want that. <a href=\"https:&#x2F;&#x2F;www.w3.org&#x2F;TR&#x2F;WCAG&#x2F;#visual-audio-contrast\" rel=\"nofollow\">https:&#x2F;&#x2F;www.w3.org&#x2F;TR&#x2F;WCAG&#x2F;#visual-audio-contrast</a>","time":1493156183,"type":"comment"},{"by":"hello_there","id":14197245,"kids":[{"by":"TruthSHIFT","id":14197635,"kids":[{"by":"e12e","id":14198055,"parent":14197635,"text":"Personally I prefer a digit &quot;touchpad&quot; and 24h digital entry - just as for entering phone numbers. So &quot;why not let me type it (on my smart phone)?&quot; is a perfectly sensible question for me as well.<p>But see the comment above about pro-digital possibly being a vocal minority - we very well could be.<p>I suppose there&#x27;s a big difference with never really growing up with analog clocks, and being used to relate to analog clocks for time keeping. All my watches were casio digital clocks, set for 24h display - similar with alarm clocks. I readily think in terms of 24h, not 2x12.<p>[ed: I&#x27;m also used to be able to tell the time by the sun for 24h two months in summer - 0100 being due north with dst (ironic, but true) - just as 1300 is south, 0700 is East, 1900 is West.]","time":1493154606,"type":"comment"}],"parent":14197245,"text":"This is for a phone.","time":1493151867,"type":"comment"}],"parent":14195522,"text":"Why not just let me type it?","time":1493149247,"type":"comment"},{"by":"MrLeap","id":14197201,"parent":14195522,"text":"This is neat, it&#x27;d be cool if there were support for choosing a time range from the same clock. I have that use case right now and I&#x27;m using one of those two handled slider widgets.","time":1493148959,"type":"comment"},{"by":"cdicelico","id":14202357,"parent":14195522,"text":"Why this instead of <a href=\"https:&#x2F;&#x2F;github.com&#x2F;ecmadao&#x2F;react-times\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;ecmadao&#x2F;react-times</a>?","time":1493209537,"type":"comment"},{"by":"SeeDave","id":14198051,"parent":14195522,"text":"Great library, and great documentation! Thanks for sharing :)","time":1493154584,"type":"comment"},{"by":"d0vs","id":14196747,"kids":[{"by":"fishnchips","id":14197215,"kids":[{"by":"catc","id":14198174,"kids":[{"by":"fishnchips","id":14201007,"parent":14198174,"text":"I personally find a prop to be a perfectly acceptable solution - you can define styles in your JS and share between components if need be. But I reckon there are folks who&#x27;d prefer passing class names to define their styles in CSS.","time":1493189763,"type":"comment"}],"parent":14197215,"text":"Yeah, for now. I&#x27;ll eventually add some way to pass in custom classes or something.","time":1493155367,"type":"comment"},{"dead":true,"deleted":true,"id":14198178,"parent":14197215,"time":1493155395,"type":"comment"}],"parent":14196747,"text":"Having read the docs I&#x27;d assume you need to pass your styles using a `config` prop.","time":1493149025,"type":"comment"}],"parent":14195522,"text":"How would I go about using my own style?","time":1493145933,"type":"comment"},{"by":"amelius","id":14202077,"parent":14195522,"text":"Very cool.<p>Unfortunately I don&#x27;t use React :(","time":1493205147,"type":"comment"}],"id":14195522,"score":99,"url":"https://catc.github.io/react-timekeeper/","by":"catc"},"14216981":{"by":"ingve","descendants":0,"id":14216981,"score":5,"time":1493355955,"title":"Code Rot","type":"story","url":"https://henrikwarne.com/2017/04/28/code-rot/"},"14221273":{"time":1493399941,"type":"story","descendants":36,"title":"United Airlines Announces Changes to Improve Customer Experience","kids":[{"by":"11thEarlOfMar","id":14221422,"kids":[{"by":"gist","id":14222145,"parent":14221422,"text":"It&#x27;s a new broom. Let&#x27;s see how long that lasts.","time":1493406293,"type":"comment"},{"by":"maxxxxx","id":14221572,"parent":14221422,"text":"I love when I ask for sweetener and get a whole pile.","time":1493402038,"type":"comment"}],"parent":14221273,"text":"As experienced on United this week:<p>- Hand out warm chocolate chip cookies as passengers de-plane.<p>- If a passenger asks for a couple of decaf coffee pouches, give them 16","time":1493401100,"type":"comment"},{"by":"ghostly_s","id":14221639,"kids":[{"by":"gist","id":14222169,"kids":[{"by":"ghostly_s","id":14222286,"kids":[{"by":"PhantomGremlin","id":14225079,"parent":14222286,"text":"Yes they were, but not in the way you hypothesize.<p>What they&#x27;re now saying is they won&#x27;t make you prove to them that the bag they lost was worth $1500. Do you have receipts for the suitcase itself? Do you have receipts for each item you claim was in it?<p>And then they could and would say: &quot;Hmmm ... those shirts were purchased a few years ago, they&#x27;re currently not worth anywhere near what you paid for them new.&quot;<p>The only problem I see with the new policy is the potential for fraud. At many airports there is very very little supervision of the baggage claim area. So bags can easily be &quot;stolen&quot; from there by accomplices of the passenger. Then it would be easy for the passenger to demand $1500 for a &quot;lost&quot; bag that wasn&#x27;t even worth $150.","time":1493440886,"type":"comment"}],"parent":14222169,"text":"So they previously were asking <i>you</i> questions, when <i>they</i> failed to deliver <i>your</i> luggage?<p>&quot;Excuse me sir but we must ask, did you leave this item in the  care of any untrustworthy individuals since you last saw it?&quot;<p>&quot;Yes...your staff.&quot;","time":1493407317,"type":"comment"}],"parent":14221639,"text":"This means that just like insurance companies often do they put up roadblocks hoping that someone just peters out and decides it&#x27;s not worth their time to pursue. At the very least even if they don&#x27;t you buy time and can use the money (that you would have to pay) for cash flow purposes.<p>This is both in obvious and non obvious ways. One way can be by simply making it hard to communicate with someone who has the authority to solve your problem and keep bouncing you around or taking extra time to respond to claims and even questions.","time":1493406447,"type":"comment"},{"by":"rajathagasthya","id":14221661,"parent":14221639,"text":"&gt; will be eliminating the red tape on permanently lost bags with a new &quot;no-questions-asked&quot; $1,500 reimbursement policy<p>This is what the email for MileagePlus members says.","time":1493402587,"type":"comment"}],"parent":14221273,"text":"&gt; Eliminate the red tape on permanently lost bags by adopting a &quot;no questions asked&quot; policy on lost luggage.<p>What on earth does this mean?","time":1493402483,"type":"comment"},{"by":"draw_down","id":14221604,"kids":[{"by":"MrVitaliy","id":14221642,"parent":14221604,"text":"This time they&#x27;re &quot;committing&quot;","time":1493402491,"type":"comment"}],"parent":14221273,"text":"&gt; United commits to:<p>&gt; Limit use of law enforcement to safety and security issues only.<p>&gt; Not require customers seated on the plane to give up their seat involuntarily unless safety or security is at risk.<p>Isn&#x27;t that what they claimed the situation was in the first place? I get that they have to make announcements like this because they&#x27;re in damage-control mode, but, come on.","time":1493402209,"type":"comment"},{"by":"wfunction","id":14221666,"kids":[{"by":"ad_tech_ninja","id":14221734,"parent":14221666,"text":"to add - $800 is definitely not enough to merit screwing over a business meeting that may have taken weeks to schedule and coordinate people taking different flights to the same location. sometimes, 800 isn&#x27;t enough to cover hotel cost for losing a reservation then needing to rebook for a flight the following day.","time":1493403139,"type":"comment"}],"parent":14221273,"text":"Is the $10k still in vouchers?<p>The main problem they had IMO was that $800 was very useless for many people when it was in vouchers...","time":1493402616,"type":"comment"},{"deleted":true,"id":14221645,"parent":14221273,"time":1493402513,"type":"comment"},{"by":"drak0n1c","id":14223230,"parent":14221273,"text":"The greater lesson here is to ensure employees don&#x27;t make a habit of strictly following computerized procedures such as the random number generator that insisted on this particular passenger&#x27;s seat. Human dialogue and creativity can provide a better solution to problems like these.","time":1493415180,"type":"comment"},{"by":"Upvoter33","id":14222007,"parent":14221273,"text":"Rule 1: Never Talk About Fight Club","time":1493405276,"type":"comment"},{"by":"notyourwork","id":14221617,"kids":[{"by":"UnoriginalGuy","id":14221696,"kids":[{"by":"rl3","id":14221904,"kids":[{"by":"UnoriginalGuy","id":14222019,"kids":[{"by":"rl3","id":14222229,"kids":[{"by":"EliRivers","id":14222380,"kids":[{"by":"rl3","id":14222873,"kids":[{"by":"EliRivers","id":14226061,"kids":[{"by":"rl3","id":14248667,"parent":14226061,"text":"&gt;<i>...I do not subscribe to the axiom that the needs of the many inherently outweigh the needs of the few.</i><p>Generally speaking I&#x27;m in agreement with you there.<p>It&#x27;s just that I view giving up a paid seat due to rare but exigent circumstances analogous to motorists involved in a minor collision pulling off to the side of the road as a common courtesy.<p>&gt;<i>We can never make things right because we cannot change the past, so litigation is not a solution; it&#x27;s mitigation.</i><p>Litigation is somewhat of an imperfect solution when it acts as a deterrent.<p>&gt;<i>On a personal note, I suspect (but cannot prove) that the doctrine of letting people do bad things because we can litigate later is corrosive to society.</i><p>Agreed, but unfortunately there&#x27;s far from perfect oversight of corporate behavior. Even when you&#x27;re talking cases where people <i>die</i> due to gross negligence, criminal charges are extremely rare.<p>Litigation—when it has merit—acts as an imperfect second line of defense against misbehavior that would otherwise go unpunished. It&#x27;s capitalism&#x27;s way of keeping itself in check.<p>It is however far from perfect. Many companies will simply fight meritorious litigation on the basis that it&#x27;s the cheaper option, regardless if doing so is morally bankrupt. For example, a company may decide issuing a recall for an issue that kills people is more expensive than just dragging the existing litigation out as much as they can.","time":1493747144,"type":"comment"}],"parent":14222873,"text":"<i>it&#x27;s somehow OK in context of holding up a commercial aircraft</i><p>I do not agree that business must have priority, and while I recognise the practical nature of the universe in which we live, I do not subscribe to the axiom that the needs of the many inherently outweigh the needs of the few.<p>I suspect our differences are simply axiomatic.<p><i>They also tend to count in context of litigation</i><p>Litigation is all about trying to make things better after something bad happened. We can never make things right because we cannot change the past, so litigation is not a solution; it&#x27;s mitigation. I subscribe to the idea that it is better for that bad thing not to have happened. On a personal note, I suspect (but cannot prove) that the doctrine of letting people do bad things because we can litigate later is corrosive to society.","time":1493465335,"type":"comment"},{"by":"ingenuous2","id":14223558,"kids":[{"by":"rl3","id":14223674,"kids":[{"by":"Bahamut","id":14224051,"parent":14223674,"text":"Neither was the action of calling law enforcement...","time":1493422589,"type":"comment"}],"parent":14223558,"text":"On the contrary, I was saying exactly that: since the rights aren&#x27;t inalienable but contractual in nature, that holding up a flight to the point of refusing to comply with law enforcement is not the way to go about a contractual dispute.","time":1493418632,"type":"comment"}],"parent":14222873,"text":"You confuse inalienable rights with contractual rights.  The passenger had a contractual right to be on the plane.","time":1493417528,"type":"comment"}],"parent":14222380,"text":"&gt;<i>That&#x27;s the only time they really count.</i><p>They also tend to count in context of litigation and social media, all of which can be pursued after leaving the aircraft.<p>&gt;<i>It&#x27;s exactly the place for it.</i><p>I&#x27;m honestly baffled here. It&#x27;s basically the &quot;I want to speak to the manager!&quot; behavior that so many decry, and yet, it&#x27;s somehow OK in context of holding up a commercial aircraft to insist you settle your individual dispute right then and there.<p>&gt;<i>If you can&#x27;t assert your rights when you need them, they&#x27;re worthless.</i><p>There is no <i>right</i> to be on an aircraft, just as drivers have no explicit right to be on the road. Despite the fact one pays for their car, pays insurance, pays the state all manner of fees, driving remains a revocable <i>privilege</i> should that person not follow the rules. A flight is no different in this respect.<p>It&#x27;s like failing to pull over on the shoulder for emergency vehicles, insisting you have a right to remain in your lane. While that might sound proposterous on the face of it, what if the crew that&#x27;s positioning is operating a flight that&#x27;s transporting organs? Suddenly the person refusing to give up their seat for crew isn&#x27;t so righteously justified.","time":1493411997,"type":"comment"}],"parent":14222229,"text":"&quot;The aircraft you&#x27;re being told to leave isn&#x27;t the proper forum for legal and contractual disputes.&quot;<p>That&#x27;s the only time they really count. It&#x27;s exactly the place for it. If you can&#x27;t assert your rights when you need them, they&#x27;re worthless.","time":1493407994,"type":"comment"},{"by":"affinity","id":14223745,"kids":[{"by":"rl3","id":14223888,"parent":14223745,"text":"&gt;<i>As soon as United requested LEO intervention; use of force was by definition put on the table.</i><p>It was put on the table, but not with intent to harm him. That&#x27;s the hyperbole part.<p>It&#x27;s reasonable to presume that in the vast majority of cases, people tend to comply with LEO instructions without force coming into play. If it must come into play, it shouldn&#x27;t take the form of an utter disaster as with what happened to that gentleman. That&#x27;s precisely why this whole situation is an edge case.<p>&gt;<i>Is that really true? It insinuates that all flight crew instructions considered safety and security instructions.</i><p>Yes. Once a passenger demonstrates they&#x27;re not obeying the flight crew, chances are they&#x27;re not going to listen to safety or security instructions either.<p>&gt;<i>Commercial Aircraft of the type being discussed are flying buses, by definition.</i><p>We can argue semantics all day long, but I think it&#x27;s fairly obvious that operating a commercial aircraft is hardly analogous to the operation of a city bus once you move past the fact they both carry passengers.<p>&gt;<i>The assertion here being that a person should allow their contractual or legal rights to be violated for the convenience of others?</i><p>Yes, actually. That&#x27;s why other avenues exist to settle such matters beyond holding up a flight until an individual dispute is resolved. If there&#x27;s critical cargo such as organs on the flight the deadheading crew is slated to operate, it&#x27;s more than just a matter of <i>convenience</i>.","time":1493420681,"type":"comment"}],"parent":14222229,"text":"&gt;<i>Sorry, but that&#x27;s hyperbole.</i><p>I respectfully disagree. As soon as United requested LEO intervention; use of force was an implied outcome.<p>&gt;<i>the dispute became more than a civil dispute once he refused flight crew instructions to leave the aircraft.</i><p>The dispute became more than a civil dispute the moment that LEO intervention was requested, and not before.<p>&gt;<i>There was [a safety or security justification] once a passenger demonstrated they&#x27;re not willing to comply with the flight crew.</i><p>Is that really true? It insinuates that all flight crew instructions considered safety and security instructions.<p>&gt;<i>Contrary to popular belief, commercial aircraft are not glorified busses.</i><p>Commercial Aircraft of the type being discussed are flying buses, by definition. bus : a large motor vehicle designed to carry passengers usually along a fixed routed according to a schedule. <a href=\"https:&#x2F;&#x2F;www.merriam-webster.com&#x2F;dictionary&#x2F;bus\" rel=\"nofollow\">https:&#x2F;&#x2F;www.merriam-webster.com&#x2F;dictionary&#x2F;bus</a><p>&gt;<i>Then argue that to your heart&#x27;s content after deplaning. The aircraft you&#x27;re being told to leave isn&#x27;t the proper forum for legal and contractual disputes.</i><p>The assertion here being that a person should allow their contractual or legal rights to be violated for the convenience of others?","time":1493419295,"type":"comment"},{"by":"dingaling","id":14223434,"kids":[{"by":"rl3","id":14223593,"kids":[{"by":"UnoriginalGuy","id":14223661,"kids":[{"by":"rl3","id":14223752,"parent":14223661,"text":"&gt;<i>Stop trying to make this a safety or security issue, there&#x27;s no justification for it.</i><p>Wasn&#x27;t trying to make it about anything, just responding to a comment asking the difference between an aircraft and a bus.<p>That said,  if you have a passenger who&#x27;s repeatedly not complying with the flight crew on the ground, why then become airborne with that passenger on board? That <i>is</i> a safety issue.","time":1493419335,"type":"comment"}],"parent":14223593,"text":"Nothing can an aircraft sitting on the tarmac. Stop trying to make this a safety or security issue, there&#x27;s no justification for it.","time":1493418444,"type":"comment"}],"parent":14223434,"text":"A bus can&#x27;t modify the skyline of New York City as easily.","time":1493417791,"type":"comment"}],"parent":14222229,"text":"&gt; Contrary to popular belief, commercial aircraft are not glorified busses.<p>In what way are they not?","time":1493416570,"type":"comment"}],"parent":14222019,"text":"&gt;<i>United violated their own contract with the passenger. The passenger was attempting to escalate it within United themselves when they were violently assaulted at United&#x27;s request.</i><p>Sorry, but that&#x27;s hyperbole. I&#x27;m fairly confident the interaction didn&#x27;t go down as: &quot;Hello, we have an uncompliant passenger refusing to leave the aircraft at gate XYZ. Please come down and beat the shit out of him for us, thanks!&quot;<p><i>&gt;Law enforcement got involved in a civil dispute between a customer and company and then battered that customer on behalf of that company.</i><p>Ignoring the continued hyperbole, the dispute became more than a civil dispute once he refused flight crew instructions to leave the aircraft.<p><i>&gt;There was no safety or security justification for law enforcement to be involved at all.</i><p>There was once a passenger demonstrated they&#x27;re not willing to comply with the flight crew. Contrary to popular belief, commercial aircraft are not glorified busses.<p><i>&gt;The flight was delayed due to United&#x27;s actions (kicking passengers off to board crew, after the flight had already been seated).</i><p>Yes, but his actions then delayed the flight <i>much</i> more than it otherwise would have been. A minor delay due to crew positioning is a small price to pay if it means not having to cancel an entire flight of passengers down line.<p><i>&gt;The passenger was asserting their contractual and legal rights, ...</i><p>Then argue that to your heart&#x27;s content after deplaning. The aircraft you&#x27;re being told to leave isn&#x27;t the proper forum for legal and contractual disputes.","time":1493406864,"type":"comment"}],"parent":14221904,"text":"United violated their own contract with the passenger. The passenger was attempting to escalate it within United themselves when they were violently assaulted at United&#x27;s request.<p>Law enforcement got involved in a civil dispute between a customer and company and then battered that customer on behalf of that company. There was no safety or security justification for law enforcement to be involved at all.<p>The flight was delayed due to United&#x27;s actions (kicking passengers off to board crew, after the flight had already been seated). The passenger was asserting their contractual and legal rights, the company and law enforcement violated those rights and the other passengers were negatively impacted due to the company&#x27;s wish to save a small amount of money.","time":1493405388,"type":"comment"}],"parent":14221696,"text":"&gt;<i>Calling United&#x27;s call center to get a resolution isn&#x27;t a &quot;temper tantrum.&quot; It is the correct course of action in the circumstances.</i><p>So disobeying flight crew instructions, then law enforcement instructions, and finally insisting  on working your way through first-line support at the company&#x27;s call center while you <i>single-handedly continue to delay an entire flight</i> is the correct course of action in that situation?<p>The way cops handled the situation was absolutely awful, and in my opinion they should be footing his medical bills. However, it doesn&#x27;t mean he was justified in his actions.<p>Such actions could even be perfectly understandable in circumstances involving an underlying medical condition (dementia, mental illness, severe hypoglycemia, whatever).<p>How you can suggest it&#x27;s the correct course of action for someone of sound mind though is puzzling at best. I can&#x27;t even begin to comprehend the level of entitlement that delaying an entire flight would require.","time":1493404515,"type":"comment"}],"parent":14221617,"text":"He was literally on the phone to United&#x27;s call center when the cop pulled him forward while still belted, then sideways into the middle armrest, then mashed his head into the armrest across the aisle causing concussion, broken Nose, and lost teeth. The guy literally had to have reconstructive surgery.<p>Calling United&#x27;s call center to get a resolution isn&#x27;t a &quot;temper tantrum.&quot; It is the correct course of action in the circumstances. A United Manager should have resolved this situation, not an abusive cop. United should pay for it and the cop should be fired and charged with battery.<p>The passenger did nothing ignorant, and I&#x27;m not entirely sure you know what the word means.","time":1493402855,"type":"comment"},{"by":"AlexandrB","id":14221683,"parent":14221617,"text":"I agree. We should all kowtow to our corporate overlords, after all we are mere &quot;consumers&quot; not people and we don&#x27;t deserve any respect.","time":1493402752,"type":"comment"},{"by":"xyzzy4","id":14221681,"parent":14221617,"text":"&gt;I would be if I was asked to leave after getting on the plane but once the authorities get involved anyone beyond 10 years old should know it isn&#x27;t time for a temper tantrum.<p>So it&#x27;s fine for police to beat up non-threatening people when they don&#x27;t comply with a business manager&#x27;s decision?","time":1493402732,"type":"comment"},{"by":"yourapostasy","id":14229233,"parent":14221617,"text":"We do not know enough about the interaction between Dr. Dao and the Chicago Aviation Department security officers to tell if the escalation to violence was reasonably graduated or not. There are accepted general practices for such escalation, and a common one is the command voice, for example. There is no way now to discover if policy and common practice was applied by the officers on the scene, unfortunately.","time":1493506770,"type":"comment"},{"deleted":true,"id":14221672,"parent":14221617,"time":1493402668,"type":"comment"},{"by":"ArchReaper","id":14221679,"parent":14221617,"text":"How&#x27;s the Kool Aid taste?","time":1493402714,"type":"comment"},{"by":"draw_down","id":14221641,"parent":14221617,"text":"Uh, no.","time":1493402488,"type":"comment"}],"parent":14221273,"text":"Is anyone else disappointed with the PR turn around? Although unlikely, I was rooting for United to push back and tell the guy to piss off for acting so ignorant. I cannot imagine how mad I would be if I was asked to leave after getting on the plane but once the authorities get involved anyone beyond 10 years old should know it isn&#x27;t time for a temper tantrum.<p>Kudos for United for improving customer experience but I wish this improvement would come whole heartedly and not simply because of a PR nightmare due to an ignorant passenger.","time":1493402308,"type":"comment"}],"id":14221273,"score":27,"url":"http://newsroom.united.com/2017-04-27-United-Airlines-Announces-Changes-to-Improve-Customer-Experience","by":"rajathagasthya"},"14215408":{"time":1493332739,"type":"story","descendants":66,"title":"Jeff Bezos Is Just $5B Away from Being the World's Richest Person","kids":[{"by":"drenvuk","id":14215675,"kids":[{"by":"adventured","id":14215693,"kids":[{"by":"sytelus","id":14217495,"kids":[{"by":"lifeformed","id":14217596,"kids":[{"by":"puranjay","id":14218265,"parent":14217596,"text":"Dictators are dictators only as long as the military supports them. If you&#x27;re the dictator of say, Egypt, and you decide to &quot;sell&quot; the Great Pyramids, I&#x27;m sure some people in the military would have a problem with that.<p>The &quot;absolute&quot; power of dictators also comes with terms and conditions.","time":1493375455,"type":"comment"},{"by":"te_chris","id":14217614,"parent":14217596,"text":"Small countries, but there&#x27;s still quite a lot of corrupt bigger countries.  Russia, Thailand, Malaysia are the first that come to mind.","time":1493365459,"type":"comment"}],"parent":14217495,"text":"Billionaires would still be near the top of the list if you compare them with dictatorship GDPs.  ~80B puts you far above most small or poor countries.","time":1493365175,"type":"comment"}],"parent":14215693,"text":"&gt; They generally leave royalty, dictators, and similar abnormal situations off the lists<p>Did not knew that but makes sense... Dictators essentially own entire country and their income is whole GDP. That would dwarf business billionaire many times over.","time":1493363988,"type":"comment"},{"by":"ido","id":14217423,"kids":[{"by":"pcrh","id":14217493,"kids":[{"by":"ido","id":14217878,"kids":[{"by":"TheCoelacanth","id":14219584,"kids":[{"by":"ido","id":14221592,"parent":14219584,"text":"Nobody is saying you&#x27;d count all the country&#x27;s GDP, only that their own richness is already as high as the others.","time":1493402148,"type":"comment"}],"parent":14217878,"text":"Putin has a lot of assets (possibly even the most of anyone), but nothing close to the full assets of Russia. Dictators can definitely use their power to enrich themselves greatly, but they can&#x27;t capture the entire country&#x27;s assets; they need to use a lot of the assets just to keep the country running and to stay in power. The people that help them to stay in power will expect to get something out of it for themselves. It&#x27;s kind of like how you wouldn&#x27;t count the shares of Microsoft that Gates gave away to early employees as part of Gates&#x27;s assets even though Gates was effectively the dictator of Microsoft.","time":1493389449,"type":"comment"}],"parent":14217493,"text":"The Queen can&#x27;t because her role is purely symbolic and she has no real power, but could e.g. Sadaam or Gaddafi when they were in power?<p>IIRC Putin has a lot of actual liquid assets as do many other plutocrats.","time":1493369233,"type":"comment"},{"by":"sytelus","id":14217513,"kids":[{"by":"Noughmad","id":14217678,"parent":14217513,"text":"Because then they wouldn&#x27;t be royalty for long.","time":1493366382,"type":"comment"}],"parent":14217493,"text":"Ummm... I think they sure can if public access to property is not allowed and if they wanted to. For example, why can&#x27;t they lease out part of their property that only they have access for 1000 years lease which would be a &quot;sell&quot; for all intent and purposes.","time":1493364229,"type":"comment"}],"parent":14217423,"text":"Heads of state often don&#x27;t &quot;own&quot; their property the same way a private individual does in that they cannot liquidate their holdings. The Queen of England, for example, can&#x27;t simply sell Windsor castle. The &quot;personal&quot; property of dictators has the habit of becoming state property on their death or fall from power.","time":1493363939,"type":"comment"},{"by":"mkempe","id":14218776,"parent":14217423,"text":"There is a fundamental difference between a gun and a dollar.","time":1493381959,"type":"comment"}],"parent":14215693,"text":"Why are Gates, Bezos, et al less abnormal than royales and dictators?","time":1493362994,"type":"comment"}],"parent":14215675,"text":"Both Forbes and Bloomberg attempt to track private funds. If you look through their profiles for example, they list estimated private funds (non public stock holdings, such as cash, real estate, private business ownership, etc).<p>They generally leave royalty, dictators, and similar abnormal situations off the lists.","time":1493335351,"type":"comment"},{"deleted":true,"id":14215714,"parent":14215675,"time":1493335607,"type":"comment"},{"by":"treyfitty","id":14215711,"kids":[{"by":"hourislate","id":14219182,"parent":14215711,"text":"Putin and his family are worth well over 100 billion. He has been stealing the wealth of the Russian People for decades.","time":1493386300,"type":"comment"}],"parent":14215675,"text":"Some people speculate Vladimir Putin.<p><a href=\"http:&#x2F;&#x2F;time.com&#x2F;money&#x2F;4641093&#x2F;vladimir-putin-net-worth&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;time.com&#x2F;money&#x2F;4641093&#x2F;vladimir-putin-net-worth&#x2F;</a>","time":1493335577,"type":"comment"},{"by":"rapsey","id":14217627,"kids":[{"by":"charlesdm","id":14217809,"kids":[{"by":"rapsey","id":14217844,"kids":[{"by":"charlesdm","id":14218032,"kids":[{"by":"rapsey","id":14218508,"kids":[{"by":"charlesdm","id":14218590,"kids":[{"by":"rapsey","id":14218705,"kids":[{"by":"tunap","id":14219116,"parent":14218705,"text":"House of Saud seems to have a pretty good <i>grip</i> on retaining wealth. Did someone say &quot;trillions&quot;?<p><a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;House_of_Saud#Wealth\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;House_of_Saud#Wealth</a>","time":1493385673,"type":"comment"}],"parent":14218590,"text":"&gt; So are you?<p>What certainty am I speaking in? I&#x27;m making a clearly expressed assumption that they are using their family core competency of managing wealth and not pissing it away.<p>&gt; The things I brought up are relatively common sense.<p>If you mean common sense as in having no sense how to properly manage wealth. Which is what very few people on average understand.","time":1493381074,"type":"comment"}],"parent":14218508,"text":"So are you? The things I brought up are relatively common sense. Common sense aside, I also know several old money families (some 3rd generation entrepreneurial, some old 12th century EU aristocracy) and I&#x27;m partially basing my assumptions based on what I&#x27;ve noticed and what they&#x27;ve told me about similar families they know.<p>If you feel the need to prove the Rothschild family are trillionaires, go ahead + best of luck.","time":1493379580,"type":"comment"}],"parent":14218032,"text":"You are speaking in certainties and making baseless assumptions to come to your conclusion.","time":1493378703,"type":"comment"}],"parent":14217844,"text":"As a family, they&#x27;ll be worth a lot. But not that much. We&#x27;re probably talking 100-200+ descendants over the centuries. Some will have done well in life (e.g. doubled &#x2F; tripled &#x2F; quadrupled their inheritances), others will have wasted it all.","time":1493371788,"type":"comment"}],"parent":14217809,"text":"A family whose wealth was built by their knowledge of how to manage wealth let their fortune dwindle? If I&#x27;m a crazy conspiracy theorist for finding that hard to believe I guess I am.","time":1493368573,"type":"comment"}],"parent":14217627,"text":"Do you have your tin foil hat on? Intergenerational wealth breaks down relatively quickly when dealing with significant numbers of heirs to a family fortune. Most will probably still be UHNWIs, but that&#x27;s it.","time":1493368114,"type":"comment"},{"by":"matthewbauer","id":14217770,"kids":[{"by":"mehwoot","id":14217827,"parent":14217770,"text":"<a href=\"https:&#x2F;&#x2F;web.archive.org&#x2F;web&#x2F;20060115031554&#x2F;http:&#x2F;&#x2F;news.independent.co.uk&#x2F;uk&#x2F;this_britain&#x2F;article56239.ece\" rel=\"nofollow\">https:&#x2F;&#x2F;web.archive.org&#x2F;web&#x2F;20060115031554&#x2F;http:&#x2F;&#x2F;news.indep...</a><p>&quot;...to sustain their secretive fortune, which industry insiders count not in billions but in trillions, and keep it within the family.&quot;<p>Definitely unfair to count families though.  The rothschild family has hundreds (if not thousands??) of members now.","time":1493368274,"type":"comment"}],"parent":14217627,"text":"That seems hard to believe. I suppose if you start counting families you can get some pretty big numbers but trillions definitely is too high.","time":1493367529,"type":"comment"},{"by":"melling","id":14218359,"kids":[{"by":"rapsey","id":14218493,"parent":14218359,"text":"House of Saud way of managing wealth is not the only option.","time":1493378517,"type":"comment"}],"parent":14217627,"text":"Yes, but simple math comes into play again.  You&#x27;ve got to keep splitting the money among all those kids, and before you know it, each is only worth tens of millions.","time":1493376837,"type":"comment"}],"parent":14215675,"text":"I&#x27;m sure there are a number of <i></i>old<i></i> money families that control wealth of at least an order of magnitude higher. They are powerful enough to not make it visible and directly tied to them. Rothchilds are most likely effectively trillioners.","time":1493365623,"type":"comment"}],"parent":14215408,"text":"Has there ever been speculation as to who the richest person in the world is when taking into account private funds instead of just public?  Would the list be any different?","time":1493335143,"type":"comment"},{"by":"eutropia","id":14219239,"parent":14215408,"text":"Meanwhile, I&#x27;m &quot;just&quot; 5B away from becoming the word&#x27;s 324th richest person.","time":1493386772,"type":"comment"},{"by":"thaumasiotes","id":14215640,"kids":[{"by":"whack","id":14216245,"kids":[{"by":"tanderson92","id":14217386,"kids":[{"by":"thaumasiotes","id":14222484,"parent":14217386,"text":"I&#x27;m not even talking about &quot;the total amount of wealth he has accumulated&quot;. If he went spectacularly broke, that wouldn&#x27;t take away from his lifetime earnings, but it would take away from his current wealth.<p>The Bill and Melinda Gates Foundation is under his direct control and the money goes where he thinks it should go. It&#x27;s fundamentally identical to a personal entertainment fund. There is no reason to leave it out of estimates of his current worth.","time":1493408773,"type":"comment"}],"parent":14216245,"text":"thaumasiotes&#x27; point is not that Bill Gates is not a philanthropic individual, it is that most estimates of wealth are not accounting correctly for the total amount of wealth he has accumulated. He is simply using his wealth for more moral actions.","time":1493362489,"type":"comment"},{"by":"paganel","id":14217470,"kids":[{"by":"Scea91","id":14217688,"kids":[{"by":"paganel","id":14218331,"parent":14217688,"text":"Microsoft making computers not complicated (which is debatable) and them trying to kill off Linux in the aforementioned period are 2 different things, not sure when we stopped looking at how most of Gates&#x27; wealth  was built. Yeah, good for him that he&#x27;s saving children in Africa with a part of his huge wealth, but as recently as 2015 he was still actively investing his money in fossil fuels and was spreading FUD about solar energy (old habits die hard, I guess). Here&#x27;s one of the related  articles: <a href=\"https:&#x2F;&#x2F;www.theguardian.com&#x2F;environment&#x2F;2015&#x2F;oct&#x2F;14&#x2F;bill-gates-calls-fossil-fuel-divestment-a-false-solution\" rel=\"nofollow\">https:&#x2F;&#x2F;www.theguardian.com&#x2F;environment&#x2F;2015&#x2F;oct&#x2F;14&#x2F;bill-gat...</a> .","time":1493376504,"type":"comment"}],"parent":14217470,"text":"Or possibly they wouldn&#x27;t have seen computers at all, because they would have been too complicated for them.","time":1493366491,"type":"comment"}],"parent":14216245,"text":"We will never know the true opportunity costs of Windows being a closed-platform throughout the &#x27;90s and early 2000s, when they also actively tried to kill one of the only open alternatives.<p>This is especially true in this day and age when automation is about to kill a lot of jobs, and the people affected by this might have had a better chance at switching careers had they not seen computers mostly as black boxes when they were younger.","time":1493363545,"type":"comment"}],"parent":14215640,"text":"If only every billionaire had a &quot;tax shelter&quot; that saved millions of lives.<p><a href=\"http:&#x2F;&#x2F;www.businessinsider.com&#x2F;infographic-is-bill-gates-better-than-batman-2012-1\" rel=\"nofollow\">http:&#x2F;&#x2F;www.businessinsider.com&#x2F;infographic-is-bill-gates-bet...</a>","time":1493342705,"type":"comment"}],"parent":14215408,"text":"1. Bill Gates divides his money, half into his personal bank account[1], half into a tax shelter.<p>2. Various other people hover around the value in Bill Gates&#x27; unsheltered personal account.<p>3. &quot;Bill Gates is passed up as the richest person in the world!&quot;<p>Let me know when their net wealth exceeds the value of the wealth controlled by Bill Gates.<p>[1] metaphorically","time":1493334878,"type":"comment"},{"by":"Chris2048","id":14219133,"kids":[{"by":"earlyriser","id":14219325,"kids":[{"by":"Chris2048","id":14219656,"parent":14219325,"text":"&quot;money in the bank&quot; means assets that might only vary by inflation&#x2F;FX etc, not dependent on a specific stock price.","time":1493390057,"type":"comment"}],"parent":14219133,"text":"What would you call &quot;money in the bank&quot;? I mean when you have this kind of money you cannot just put it in the bank... probably even at the kind of money a tech worker has. To my knowledge, these estimations are based on the worth of assets.","time":1493387441,"type":"comment"},{"by":"loeg","id":14219377,"kids":[{"by":"Chris2048","id":14219636,"parent":14219377,"text":"I&#x27;m questioning the nature of different &#x27;value&#x27; across certain kinds of &#x27;assets&#x27;.","time":1493389898,"type":"comment"}],"parent":14219133,"text":"Based on value of assets, same as everyone else.","time":1493387843,"type":"comment"}],"parent":14215408,"text":"To be clear, are these estimations of wealth &quot;money in the bank&quot; wealth (minus liabilities), or &quot;worth of assets in the eyes of investors&quot;?<p>Things like stick price are, in my opinion, a fickle thing. Until you sell yours stocks&#x2F;shares for money, their value is still shifting.<p>In that sense &quot;wealth&quot; is similar to &quot;perception&quot;&#x2F;&quot;confidence&quot; - it&#x27;s not the same thing, because you have to figure in market&#x2F;investor hype&#x2F;rationality.","time":1493385824,"type":"comment"},{"by":"roryisok","id":14215654,"kids":[{"by":"andrewstuart2","id":14217289,"kids":[{"by":"roryisok","id":14218298,"kids":[{"by":"melling","id":14218341,"parent":14218298,"text":"Yes, it reads like a click-baity headline.  Read the HN comments.  It worked.","time":1493376626,"type":"comment"}],"parent":14217289,"text":"That little B makes it so easy.<p>&quot;Jeff Bezos Is Just $5,000,000,000 Away from Being the World&#x27;s Richest Person&quot; reads slightly differently","time":1493375946,"type":"comment"}],"parent":14215654,"text":"It&#x27;s closer to reality when you consider that this is a 6.3% increase over his current net worth.<p>But yes. It&#x27;s a ridiculous sum of money to be thrown around casually.","time":1493361258,"type":"comment"},{"by":"melling","id":14218338,"parent":14215654,"text":"Yes, he&#x27;s worth $80 billion. So, what percentage increase does Amazon&#x27;s stock need to increase before he&#x27;s worth $85 billion?  Wow, that could easily happen this year. In fact, in could happen in a few days.","time":1493376571,"type":"comment"}],"parent":14215408,"text":"&quot;just&quot; $5B.","time":1493335037,"type":"comment"},{"by":"amgin3","id":14217725,"kids":[{"by":"amorphid","id":14217783,"parent":14217725,"text":"You&#x27;re closer than I am.","time":1493367681,"type":"comment"}],"parent":14215408,"text":"Well, I&#x27;m just $1B away from being a billionaire.","time":1493366975,"type":"comment"},{"by":"Overtonwindow","id":14215790,"kids":[{"by":"rubyfan","id":14215816,"kids":[{"by":"buryat","id":14217071,"kids":[{"by":"vacri","id":14217092,"kids":[{"by":"dx034","id":14217322,"kids":[{"by":"dopamean","id":14218421,"parent":14217322,"text":"There&#x27;s a story that Ivanka Trump told to a documentarian about how her father told her once that a homeless man they passed on the street was richer than them because of how much debt they were in. IIRC she told that story because it was supposed to demonstrate something about her family&#x27;s humility. I always thought it was a pretty dumb thing to say.","time":1493377611,"type":"comment"}],"parent":14217092,"text":"That&#x27;s why in some statistics, 10% of the US population counts as the poorest people in the world. Starving people in developing countries usually have exactly $0, in the US most students finishing college are technically poorer than most of the world&#x27;s population.<p>Doesn&#x27;t reflect reality in any way though.","time":1493361779,"type":"comment"}],"parent":14217071,"text":"Louis CK has a great bit about going into negative dollars when his bank charged him a fee for not having enough money. &quot;Now I have negative ten dollars. I gotta raise ten dollars just to be broke. If something&#x27;s free, I can&#x27;t afford it!&quot;","time":1493358193,"type":"comment"}],"parent":14215816,"text":"that&#x27;s closer than some people","time":1493357743,"type":"comment"}],"parent":14215790,"text":"I&#x27;m just a billion dollars away from being a billionaire.","time":1493336900,"type":"comment"}],"parent":14215408,"text":"&quot;Just&quot;","time":1493336585,"type":"comment"},{"by":"coldcode","id":14215692,"kids":[{"by":"adventured","id":14215706,"kids":[{"by":"appleiigs","id":14216597,"kids":[{"by":"vacri","id":14217088,"kids":[{"by":"sbuttgereit","id":14217137,"kids":[{"by":"Naritai","id":14217360,"parent":14217137,"text":"I&#x27;ve read other market analyses that say basically the same thing - there&#x27;s no money to be made in being a &#x27;good brand&#x27;, you&#x27;ll do much better chasing either high-end market or competing on cost.  That&#x27;s why companies like Gap &amp; Macy&#x27;s are suffering, whereas each of Louis Vuitton &#x2F; Burberry and H&amp;M &#x2F; TJ Maxx have been expanding like crazy.","time":1493362277,"type":"comment"}],"parent":14217088,"text":"You&#x27;re either &quot;aspirational&quot;, meaning that you shoot for the expensive Apple products rather than a simple run of the mill PC for status reasons, or you&#x27;re &quot;thrifty&quot;, meaning that since you&#x27;ve blown most of your cash on a few aspirational products, you can only afford Walmart for anything else you want to buy.<p>Yes, I&#x27;m being a bit glib, but there&#x27;s some truth in that analysis.  People in the middle do try to buy some higher end goods in areas they want to signal status on... they do so selectively, but if they can afford it and its a product that makes a desired statement, they go for it.  An Apple product that a billionaire would typically buy is often the same model that a middle income earner can buy, yet everyone knows they aren&#x27;t the cheapest things around.  On the other hand, if you&#x27;re buying expensive in one area, you&#x27;re also probably buying cheap in other areas, so Walmart, Ross, etc. are on the table for the middle earner as well.<p>For middle of the road price&#x2F;products there&#x27;s less prestige so you don&#x27;t get that and there&#x27;s can be debatable quality difference... so... the appeal can be less for something middling.","time":1493359036,"type":"comment"}],"parent":14216597,"text":"&gt; <i>As a reference, Walmart is largest company in the world by revenue at $438B. Apple $233B.</i><p>Weird that the catchcry for one is selling the cheapest crap possible, and the catchcry for the other is premium blend, no discounts. What about us poor folks in the middle? :)","time":1493358086,"type":"comment"},{"by":"acro","id":14217405,"kids":[{"by":"simula67","id":14217468,"kids":[{"by":"acro","id":14217508,"parent":14217468,"text":"Revenue is the top line, net profit is the bottom line. There are many ways to get money out of a company which come before the net profit line in an income statement. Companies can also spin off parts of them in many different ways. The only thing I&#x27;m stating that P&#x2F;E is often the wrong number to look at in a company.","time":1493364192,"type":"comment"}],"parent":14217405,"text":"&gt; For instance share buybacks, dividends, mergers and acquisitions, companies can pay back capital<p>Where will the money for all of this come from ?<p>Why the comparison to real estate ? Is your argument that assets held by Amazon will appreciate somehow in the future ? If so which ones ?","time":1493363522,"type":"comment"}],"parent":14216597,"text":"An investor can get value from a company in other ways than net profit. For instance share buybacks, dividends, mergers and acquisitions, companies can pay back capital. P&#x2F;E ratio is just one very simple number which is not applicable to all situations. For example REITs have often very high P&#x2F;E because most of their profit is distributed as dividends. Using P&#x2F;E to try to value Amazon is in my opinion misguided.","time":1493362761,"type":"comment"},{"by":"nodesocket","id":14216973,"parent":14216597,"text":"Great analysis and breakdown.","time":1493355806,"type":"comment"}],"parent":14215706,"text":"Amazon has $136B in sales, which produces $2.4B in net income (1.7% margin).  How do you get $14B in net income from $280B in sales?<p>With a 1.7% net income margin, Amazon would need $824B in sales to get $14B, compared to the $135B now.<p>As a reference, Walmart is largest company in the world by revenue at $438B.  Apple $233B.<p>The P&#x2F;E ratio tells you how many years to recover the cost of your investment.  Amazon is at 187 years.","time":1493348557,"type":"comment"},{"by":"danderino","id":14217152,"parent":14215706,"text":"7% margin on online retail seems pretty high","time":1493359294,"type":"comment"}],"parent":14215692,"text":"That&#x27;s an extreme exaggeration.<p>Amazon&#x27;s market cap at close today was $438 billion.<p>To match Google&#x27;s earnings multiple, Amazon would need something in the ballpark of $14 billion in net income.<p>They&#x27;re chugging toward $200 billion in sales. $14b in net income off of that is very reachable. Even if we apply a much more conservative premise to it, they&#x27;re still growing above 20% - maybe it takes them $280b in sales to get to $14b in net income; they&#x27;re going to get to that sales level within six or seven years plausibly. AWS alone is all but guaranteed to generate $5+ billion in operating income within a few years. The issue isn&#x27;t whether Amazon will one day justify ~$400 billion, as that&#x27;s very likely, it&#x27;s how far from the future are the gains being pulled. 3 years? 5 years? 10 years?","time":1493335528,"type":"comment"},{"by":"mehwoot","id":14217834,"parent":14215692,"text":"<i>His company&#x27;s profits are minuscule by any historical valuation</i><p>Because he reinvests all the profit back into the company.  Which makes sense- what is he going to do taking money out of the company anyway?  Unless you want to buy sports teams or donate it to charity, the only thing you can do with the profits is invest them, and obviously you&#x27;d trust yourself as the CEO of a sprawling company to invest it the best.","time":1493368412,"type":"comment"}],"parent":14215408,"text":"His company&#x27;s profits are minuscule by any historical valuation but Amazon stock is at an insane valuation. For this value to be justified he would have to become the world&#x27;s only distributor of everything.","time":1493335350,"type":"comment"}],"id":14215408,"score":68,"url":"https://www.bloomberg.com/news/articles/2017-04-27/amazon-surge-places-bezos-within-5-billion-of-world-s-richest","by":"huangc10"},"14219347":{"time":1493387626,"type":"story","descendants":11,"title":"The Staggering Administrative Bloat of Universities","kids":[{"by":"refractal","id":14219694,"kids":[{"by":"magila","id":14220075,"kids":[{"by":"mljoe","id":14220449,"kids":[{"by":"WillyOnWheels","id":14220530,"kids":[{"by":"existencebox","id":14222218,"parent":14220530,"text":"I&#x27;ll throw in my anecdotes.  Used to be a sysadmin at a &quot;Rather shiny&quot; east coast university.<p>Mixed bag.  Some IT worked extremely hard, carried whole group, others did almost nothing.  I have stories about coworkers that make WoW look positively productive as a workplace activity.<p>Same went for admin staff.  A few of them clearly did 90% of the work, whereas a few did almost nothing. (and this was widely accepted and known)","time":1493406791,"type":"comment"}],"parent":14220449,"text":"I love anecdotes!  When I was an IT admin at a major UC Berkeley university, all of the admin staff that supported our group worked super hard from 9am to 6pm, then they went home.<p>There was an extremely old clerk who as far as I can tell had been sentenced to entering in data on a Mac SE.  No WoW.","time":1493395451,"type":"comment"}],"parent":14220075,"text":"Anecdotally, when I was IT student sysadmin at a major university, I don&#x27;t recall ever seeing admin staff doing actual work. Often times, you&#x27;d walk through the hallways and see rows and rows of offices of people screwing around on the Internet, or even playing video games. A good part of our job in IT itself was super slow as well except for the first two weeks of every semester, so we weren&#x27;t much better. My boss would play WoW on the clock.","time":1493394937,"type":"comment"}],"parent":14219694,"text":"It&#x27;s easy to make an impressive looking list of responsibilities for administrative offices. The thing is many of those bullet points include words like &quot;help&quot;, &quot;support&quot;, &quot;promote&quot;, and &quot;oversee&quot;. It&#x27;s very hard to judge just how much work is going into those things and how important it is. You can have endless rows of &quot;support&quot; staff doing important sounding things that are actually totally superfluous to getting actual productive work done.","time":1493392776,"type":"comment"},{"by":"cortesoft","id":14220135,"parent":14219694,"text":"This is why I hate these sorts of criticisms; they just talk about how much money is spent but never talk about what you are getting for the money. It still might be a waste of money, but we can&#x27;t know that until we really look at what we are getting for the money, what would happen if we didn&#x27;t spend it, and then decide if it is worth it.","time":1493393124,"type":"comment"},{"by":"noahjcz","id":14220205,"parent":14219694,"text":"The annual budget of $29B certainly puts the half billion in perspective.","time":1493393465,"type":"comment"}],"parent":14219347,"text":"If you look at what the UC Office of the president does, there&#x27;s a huge scope there that the other examples probably do not have <a href=\"http:&#x2F;&#x2F;www.ucop.edu&#x2F;about&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.ucop.edu&#x2F;about&#x2F;</a>","time":1493390300,"type":"comment"},{"by":"jbooth","id":14219625,"parent":14219347,"text":"This could have been an interesting article about a real problem, but it&#x27;s just 3 paragraphs of ranting about political straw men.","time":1493389802,"type":"comment"},{"by":"verylongname","id":14225507,"parent":14219347,"text":"I&#x27;m sure there is a lot of waste in the UC Office of the President.  But Universities have become huge, complicated behemoths with many functions besides education.<p>I recently saw a breakdown of where the money for one of the UC campuses comes from.  About 50% was from the associated Medical center, about 25% was from federal research grants (many of which had PIs in the medical school and medical center), about 15% from tuition, and 10% from other sources (not broken down further).   This wasn&#x27;t UCSF, either, where I would expect the medical center&#x27;s budget to dwarf everything else.<p>I don&#x27;t think it would be too far fetched to call it a medical center that happens to have school with 30K undergraduates attached.  I wonder how the cost of running the chancellor&#x27;s office there compares with the costs of  administration of a medical services company?<p>Of course, at this point aren&#x27;t Yale and Harvard basically hedge funds?","time":1493451912,"type":"comment"},{"by":"WillyOnWheels","id":14220619,"parent":14219347,"text":"I decided to explore what else this blogger blogs about, who I believe blogs from Arizona:<p>&quot;Take the Pledge: Let&#x27;s Take A Year Off From Giving To Our Universities&quot;\n<a href=\"http:&#x2F;&#x2F;www.coyoteblog.com&#x2F;coyote_blog&#x2F;2017&#x2F;04&#x2F;take-the-pledge-lets-take-a-year-off-from-giving-to-our-universities.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.coyoteblog.com&#x2F;coyote_blog&#x2F;2017&#x2F;04&#x2F;take-the-pledg...</a><p>&quot;How The Left Is Changing the Meaning of Words to Reduce Freedom -- The Phrase &quot;Incite Violence&quot;<p>Wealth Creation and the Zero-Sum Fallacy<p>Statism Comes Back to Bite Technocrats<p>He actually has a few views I can agree with, and links to plenty of things I read every week, but I don&#x27;t think his analysis is particularly technical or hard hitting.","time":1493395889,"type":"comment"},{"by":"callalex","id":14222107,"parent":14219347,"text":"Where&#x27;s the rest of the article? This is a great opening statement followed up by...nothing.","time":1493406051,"type":"comment"},{"by":"cowardlydragon","dead":true,"id":14220108,"parent":14219347,"text":"I would prefer this person direct their passion to the<p>$600,000,000,000<p>military budget rather than the<p>$600,000,000<p>UC education system","time":1493392931,"type":"comment"},{"by":"artana","dead":true,"id":14219371,"parent":14219347,"text":"<a href=\"http:&#x2F;&#x2F;www.webmhs.com&#x2F;2017&#x2F;04&#x2F;prediksi-southampton-vs-hull-city-29.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.webmhs.com&#x2F;2017&#x2F;04&#x2F;prediksi-southampton-vs-hull-c...</a>","time":1493387784,"type":"comment"}],"id":14219347,"score":45,"url":"http://www.coyoteblog.com/coyote_blog/2017/04/the-staggering-administrative-bloat-of-universities.html","by":"peterkshultz"},"14198261":{"time":1493155969,"type":"story","descendants":11,"title":"Prior Indigenous Technological Species","kids":[{"by":"oldmancoyote","id":14199447,"kids":[{"by":"impostervt","id":14199703,"kids":[{"by":"oldmancoyote","id":14200362,"parent":14199703,"text":"The oldest part of the continents are probably what you&#x27;re looking for.  South central Africa, corresponding parts of Brazil, Australia, and parts of eastern Canada are all very old, multiple billions of years old.  But really, these are VERY old areas.  Lots of things have happened to them in that much time.  Some of them were undoubtedly  wet.","time":1493179675,"type":"comment"}],"parent":14199447,"text":"Any idea what the oldest piece of land on earth is that has been continuously dry?","time":1493168934,"type":"comment"}],"parent":14198261,"text":"As a geologist I want to emphasize how scanty is the exposure of terrestrial(dry land) landscape within the geological record.  Assuming we are talking about a terrestrial species, the available geological record is mostly volcanic flows and sand seas (like the Sahara) of huge extent.  The surface of the Earth is mostly an erosional surface not a depositional one.  Ironically, the best place to find terrestrial fossils is within lake beds (not really terrestrial at all).<p>As metals do not last on the geological time scale, I think that the most likely evidence would be ceramic fragments or stone structures, but I believe there is too little exposure of suitable habitat and the likelihood of noticing any evidence as might be exposed too slight to say anything about the lack of geological evidence.","time":1493165725,"type":"comment"},{"by":"stcredzero","id":14199610,"kids":[{"by":"fao_","id":14201743,"parent":14199610,"text":"Thank you for the video. I haven&#x27;t seen this video series before, but it seems interesting!","time":1493200103,"type":"comment"}],"parent":14198261,"text":"I really like Issac Arthur&#x27;s treatment of this topic:<p><a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=k7fLNvpl0c8\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=k7fLNvpl0c8</a><p>The easiest technological species to detect for the longest time would be space-faring species that leave behind structures on airless moons. Note that even these traces aren&#x27;t eternal. Micro-meteoroids and meteoroids will eventually erode even those.","time":1493167688,"type":"comment"},{"by":"genpfault","id":14199862,"parent":14198261,"text":"Ah yes, PRIOR TENANT[1].  With apologies to Stross[2] :)<p>[1]: <a href=\"https:&#x2F;&#x2F;everything2.com&#x2F;title&#x2F;PRIOR+TENANT\" rel=\"nofollow\">https:&#x2F;&#x2F;everything2.com&#x2F;title&#x2F;PRIOR+TENANT</a><p>[2]: <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;The_Laundry_Files\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;The_Laundry_Files</a>","time":1493171061,"type":"comment"},{"by":"oldmancoyote","id":14208457,"parent":14198261,"text":"How hard would it be to detect evidence of previous earth-based intelligent species?  The people of Chaco canyon lived about 1000 years ago.  They build an extensive system of stone paved roads.  From personal experience I can say that the wind-blown sand and desert vegetation make it impossible to recognize these roads on the surface.  These roads were first recognized from aerial photographs.  BUT, they were first discovered many years before by a researcher who saw the profile of a road in an excavation.  He published a photo in a paper that included the wry note that they looked just like a road.","time":1493256072,"type":"comment"},{"by":"JoeDaDude","id":14204442,"parent":14198261,"text":"I&#x27;ve often considered that I should consign my mortal remains to become a fossil, but I would carry with me some object that proved I was a member of a technological society, something like a wooden abacus that would fossilize along with the rest of my corpse.","time":1493223899,"type":"comment"},{"by":"shshhdhs","id":14199068,"kids":[{"by":"grzm","id":14199113,"parent":14199068,"text":"They&#x27;re two separate journals:<p>* <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Astrobiology_(journal)\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Astrobiology_(journal)</a><p>* <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;International_Journal_of_Astrobiology\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;International_Journal_of_Astro...</a><p>You&#x27;re not the first to be confused :) The first line of each Wikipedia article is &quot;Not to be confused with [the other journal].&quot;","time":1493162347,"type":"comment"}],"parent":14198261,"text":"What does the journal comment mean?<p>&quot;&quot;Accepted for publication in the International Journal of Astrobiology. Manuscript refused by Astriobology without review as &quot;outside of the purview&quot; the journal&quot;&quot;<p>Accepted but refused confuses me. Anyone know?","time":1493161965,"type":"comment"},{"by":"jlebrech","id":14201753,"parent":14198261,"text":"maybe we could detect space &quot;chemtrails&quot; to know if other species have developed faster than light travel.","time":1493200166,"type":"comment"}],"id":14198261,"score":39,"url":"https://arxiv.org/abs/1704.07263","by":"miobrien"},"14180034":{"time":1492976450,"type":"story","descendants":83,"title":"VK9: Direct3D 9 compatibility layer using Vulkan","kids":[{"by":"AldousHaxley","id":14180533,"kids":[{"by":"badsectoracula","id":14182528,"kids":[{"by":"robbies","id":14184118,"kids":[{"by":"badsectoracula","id":14184664,"kids":[{"by":"robbies","id":14189903,"kids":[{"by":"badsectoracula","id":14236649,"parent":14189903,"text":"That is all nice but i don&#x27;t see what is the point of trying to convince me that i shouldn&#x27;t like something i like :-P. Regardless of how good OpenGL is in representing how GPUs work or why it is still around, it doesn&#x27;t change the fact that it is still around and i like using it.","time":1493635456,"type":"comment"}],"parent":14184664,"text":"I would actually argue that it is _bad_ for graphics.  The GPU abstraction that OpenGL represents is now 30+ years old, and not at all representative of how modern GPUs (desktop or mobile) work.  I&#x27;d even argue that OGL obfuscate the GPU machinery to all the budding graphics programmers who use OGL.  OGL was never meant to be a graphics toolkit&#x2F;middleware, but that&#x27;s what it&#x27;s become (at least the compat profile).<p>As far as the value to you, to be perfectly frank, you would not have compatibility profile if it wasn&#x27;t for workstation ISVs demanding OpenGL 1.1 still be supported for their legacy applications (and shelling out the big bucks to maintain that support).  There isn&#x27;t a singly IHV who is keeping these legacy features on for any hobbyist or learning programmer.  Not one.  The IHVs know it&#x27;s bad, but there&#x27;s a lot of money in keeping it around.<p>I don&#x27;t even know if there&#x27;s value in mentioning this, but I used to be an OpenGL driver engineer, and then when I worked on it, I realized &quot;Hey, wtf, this has nothing to do with how the GPU works!&quot;  I&#x27;m still happy&#x2F;proud about the work I did, but I don&#x27;t think it advanced the graphics state-of-the-art (for the most part, there are some cool things that showed up first in OpenGL).  And then as far as the cruft I mentioned...it&#x27;s just a psychotic maintenance nightmare.","time":1493081766,"type":"comment"}],"parent":14184118,"text":"&gt; I know we have the &quot;but mah immediate mode&quot; crowd<p>I&#x27;m in the &quot;but mah immediate mode&quot; crowd, so thanks for the condescending tone. I like immediate mode and matrix stacks and all the nice stuff compatibility mode provides because they are convenient even if they aren&#x27;t fast. Quite often what you want is convenience, not performance and adding a usually badly documented 3rd party library that might be dropped next year (or whatever) or break its API is not a desirable solution. Especially when the entire point is moot since OpenGL 1.x&#x2F;2.x and 3.x&#x2F;4.x compatibility isn&#x27;t going anywhere any time the next couple of decades - at least.<p>Besides the parent post is about what someone&#x27;s favorite API was so i also added what my favorite API is. D3D9 isn&#x27;t any more deserving to be someone&#x27;s favorite API than OpenGL.","time":1493044974,"type":"comment"}],"parent":14182528,"text":"Sure, ATI&#x2F;AMD (and Windows Intel) lagged behind NV in the full OpenGL implementation. But the &quot;compatability&quot; profile is full of a lot of cruft that had nothing to do with modern GPUs, and whose primary value was to passing workstation test suites,  not actual modern GPU programming.<p>I know we have the &quot;but mah immediate mode&quot; crowd, but those folks have to just get off it. Write your own immediate mode recorder if you&#x27;re so desperate.  I&#x27;m also looking at you, matrix stack abusers. Your programs are bad, and you should feel bad.","time":1493040575,"type":"comment"},{"by":"microcolonel","id":14182688,"parent":14182528,"text":"I find that OpenGL ES 3.0 hits the GL 2.x sweet spot for me. Main reason I prefer it over desktop 3.0 is that it doesn&#x27;t require the use of vbos, which always seem to complicate simple programs (even though I keep being told that I can just set one up and bind it, then forget about it).<p>I especially like that it&#x27;s hands-off wrt a lot of things like matrix manipulation and geometry optimization. It gives you an opportunity to think about these things clearly and get an optimal solution without having to port all of your matrix code out of somebody else&#x27;s library.","time":1493022012,"type":"comment"},{"by":"vedranm","id":14183092,"kids":[{"by":"badsectoracula","id":14184712,"parent":14183092,"text":"Yeah i am considering at some point to try and see what would take to add support for the compatibility profile. I do not see a reason to not have it considering that the functionality is mostly there (and AFAIK there is even an environment variable that sort-of allows the creation of compatibility profiles, it just doesn&#x27;t fully work). If nothing else, not having it makes the Mesa implementation inferior to the proprietary ones.","time":1493045281,"type":"comment"}],"parent":14182528,"text":"If you are talking about OpenGL compat profile, Mesa will not go beyond 3.0. You might or might not be able to convince the project to change that with patches, I am not sure what&#x27;s the attitude on that.<p>If you are talking about D3D9, for Gallium driver (relevant ones are r600, radeonsi, nouveau), there is Gallium Nine: <a href=\"https:&#x2F;&#x2F;wiki.ixit.cz&#x2F;d3d9\" rel=\"nofollow\">https:&#x2F;&#x2F;wiki.ixit.cz&#x2F;d3d9</a>","time":1493028604,"type":"comment"}],"parent":14180533,"text":"Same here, but replace D3D9 with OpenGL 2.x or &quot;compatibility profile&quot; as kids call it these days. Basically the entire OpenGL instead of the crippled &quot;core profile&quot; that was originally made to give a chance to troubled implementors (<i>cough</i>ATI<i>cough</i>) make something that works (and failed, while we still ended up with the schism).<p>Fortunately this is still supported in its entirety by all sane desktop implementations and at least Nvidia has said that they will always continue supporting it. The only sad marks are Apple and Mesa, but Apple seems to have abandoned the OpenGL ship and Mesa (or a fork) will hopefully implement it at some point. And in the meanwhile there is Regal, although i&#x27;m not sure how complete that is.","time":1493019430,"type":"comment"},{"by":"pandaman","id":14181917,"parent":14180533,"text":"D3D has always been a low-level API and D3D9 is no exception. The D3D9 just supported really simple hardware where pixels were pushed through a rigid pipeline one primitive at a time.<p>Interestingly, Xbox 360 was already beyond DX9, it had real shader units and shader stages (i.e. the same unit could execute both pixel and vertex shader instructions) and even ability to write data back from a shader (if you wanted to use shader to process non-pixel data on the DX9-level hardware you still had to write the output as pixels because the color&#x2F;depth buffer was the only output of a shader). So X360&#x27;s graphics library extended DX9 a lot to support that hardware.","time":1493006771,"type":"comment"},{"by":"yuhong","id":14181903,"parent":14180533,"text":"Which also reminds me of <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=9193521\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=9193521</a>","time":1493006508,"type":"comment"},{"by":"nonsince","id":14183576,"parent":14180533,"text":"Vulcan blows open the doors for anyone to create a library with the power and ease-of-use of DX9, rather than it being tied to OS vendors.","time":1493035829,"type":"comment"},{"by":"garaetjjte","id":14180722,"kids":[{"by":"MaulingMonkey","id":14181490,"kids":[{"by":"jhasse","id":14182661,"kids":[{"by":"MaulingMonkey","id":14182882,"kids":[{"by":"pjmlp","id":14184332,"parent":14182882,"text":"Yes, calling OpenGL ES &quot;OpenGL&quot; compatible is only true to the ears of those that never had the &quot;fun&quot; to write portable code across multiple GPUs.<p>At the end of the day, the code paths, extension support and driver workarounds are so many that one could just be coding against multiple APIs anyway.","time":1493042310,"type":"comment"},{"by":"jhasse","id":14184155,"parent":14182882,"text":"I guess you&#x27;re right, as I was only using rather basic stuff (e.g. no lightning, no shaders), just framebuffers, VBOs, etc.<p>(replied to my own comment by accident first)","time":1493040888,"type":"comment"}],"parent":14182661,"text":"Not even our shaders went unscathed - no rectangular matrix support (mat4x3? nope!), mandatory precision specifiers (lowp-highp), no Uniform Buffer Objects.  Can&#x27;t even call glTexImage2D on ES 2 without perfectly fine OpenGL code failing - because format !== internalFormat is forbidden (read: documented &quot;must be the same&quot;), and you were a good explicit OpenGL citizen and asked for something as horrifically complicated as format=GL_RGBA and internalFormat==GL_RGBA8.  Multiple render targets?  Are you out of your mind?  We can&#x27;t have that - goodbye deferred rendering, hello old school forward rendering!<p>Even your bread and butter - functions like glUniformMatrix3fv do things like just outright ignore the transpose parameter.  This is extremely well documented:  &quot;Specifies whether to transpose the matrix as the values are loaded into the uniform variable. Must be GL_FALSE.&quot;  ( <a href=\"https:&#x2F;&#x2F;www.khronos.org&#x2F;registry&#x2F;OpenGL-Refpages&#x2F;es2.0&#x2F;xhtml&#x2F;glUniform.xml\" rel=\"nofollow\">https:&#x2F;&#x2F;www.khronos.org&#x2F;registry&#x2F;OpenGL-Refpages&#x2F;es2.0&#x2F;xhtml...</a> )<p>I swear I&#x27;ve reused more code between D3D11 and PS4 codepaths than between OpenGL ES and OpenGL codepaths, and the d3d11 and ps4 APIs don&#x27;t share a single common function name betwixt them!<p>I must assume going from OpenGL ES 2 to real OpenGL a bit easier - even if you&#x27;re probably giving all the fast paths in the latter a wide berth in doing so.  Or maybe OpenGL ES 3 is a bit closer to real OpenGL.  But OpenGL ES 2 vs desktop OpenGL?  They both render triangles, but beyond that, it&#x27;s a crap-shot, and a <i>lot</i> of #ifdefs in my experience.  Separate files, even.  Not just a few.<p>EDIT: s&#x2F;codepaths&#x2F;apis&#x2F;, finish summarizing my thoughts.","time":1493025195,"type":"comment"},{"by":"jhasse","id":14183339,"parent":14182661,"text":"I guess you&#x27;re right, as I was only using rather basic stuff (e.g. no lightning, no shaders), just framebuffers, VBOs, etc.","time":1493032486,"type":"comment"}],"parent":14181490,"text":"I&#x27;ve written an iOS app and the OpenGL code was (except very few ifdefs) identical to the desktop code. So I wouldn&#x27;t say that ES is a completely different API, you can certainly reuse a lot.","time":1493021655,"type":"comment"}],"parent":14180722,"text":"Console developers don&#x27;t get much choice:  You pretty much <i>must</i> use D3D9, D3D11, GNM(X), etc.<p>Mobile&#x27;s not much better:  OpenGL ES for Android (which is a far cry from real desktop OpenGL - to the point that I consider it a completely different graphics API that just happens to confusingly reuse the names of some functions.)  Maybe Metal for iOS.<p>Real desktop OpenGL is one of the few graphics APIs I&#x27;ve never been forced to use - so why spend even a single dev-month porting to it?  Even games with OpenGL render paths may work better using their Direct3D renderers on Linux via Wine!<p>Even counting Linux&#x2F;OS X, at this point I&#x27;m not even convinced OpenGL is actually the more portable API...","time":1492999505,"type":"comment"},{"by":"pjmlp","id":14180919,"kids":[{"by":"shmerl","id":14180948,"kids":[{"by":"nl","id":14180975,"kids":[{"by":"shmerl","id":14180978,"kids":[{"by":"euos","id":14181252,"kids":[{"by":"klodolph","id":14181405,"kids":[{"by":"MaulingMonkey","id":14183130,"kids":[{"by":"shmerl","id":14184063,"parent":14183130,"text":"For uniform bytecode and standard validation there is Vulkan now.","time":1493040203,"type":"comment"}],"parent":14181405,"text":"&gt; That&#x27;s some impressive graphics fetishism on display there.<p>More like compatibility and stability fetishism.  nVidia and AMD can&#x27;t even agree on how to compile the same GLSL shader - I&#x27;m much more confident about my ability to ship working D3D9 or D3D11 than OpenGL without a QA team with a wide range of hardware and driver revisions.  D3D?  Uniform bytecode.  Uniform debug layers.  Nice.  Being indie just makes it easier - simpler rendering pipelines, easier to port.<p>For Android dev, where I have no choice about using e.g. OpenGL ES 2, the compatability mess is so bad that even for solo dev, I&#x27;ve been eyeing AWS Device Farm and Xamarin Test Cloud.  Maybe AAA studios can afford the QA time - but I can&#x27;t even afford enough phones to test to my satisfaction.  And in my heart of hearts, I blame OpenGL, even if it&#x27;s really the fault of mobile GPU vendors.  I have a much weaker urge for a PC device farm, where D3D <i>mostly</i> just works.  It&#x27;d be a much stronger urge if you threatened me with the prospect of supporting desktop OpenGL.<p>Biggest company I&#x27;ve worked for had about 50 people, usually on a much smaller team.  I don&#x27;t think that&#x27;s AAA.  Wasting milliseconds left and right, we didn&#x27;t need much per-platform tuning - still lower hanging fruit around.  Still almost agree with euos.  Aside from compat - getting OpenGL working on a console or in the WinRT sandbox is probably more work <i>and</i> worse results than just doing a straight up port.  Worst of all worlds.<p>&gt; The idea that somebody who chooses to do this is therefore not &quot;competent&quot; just boggles the mind. No point in deriding engineers who decide not to use the latest bells and whistles in the graphics pipeline. Maybe they just have other priorities.<p>Agreed - competent engineers and managers may decide that competent 3d support not worth their time.  I welcome this restraint when it comes to Excel&#x27;s pie charts and the good fight against scope creep.  If you&#x27;re targeting the holy trifecta of Windows, Linux, OS X, and little else - OpenGL might be right for your MVP and your launch window.<p>Yet I&#x27;d still be eyeing that OpenGL on Windows as possible technical debt.  Hell, I basically look at OpenGL ES on Android as <i>unsolvable</i> technical debt.  I&#x27;d have a hard time labeling it &quot;competent 3d&quot;.  And I&#x27;d be wondering if it was really better than D3D9 + Wine.<p>Metal <i>might</i> be a little flavor-of-the minute.  I need to give it a shot sometime...","time":1493029061,"type":"comment"},{"by":"Const-me","id":14181886,"kids":[{"by":"inDigiNeous","id":14182602,"kids":[{"by":"pjmlp","id":14183381,"kids":[{"by":"shmerl","id":14184017,"parent":14183381,"text":"Clearly some do. That&#x27;s why Wine is working on it (FOSS) and there are closed translation layers too, like from Feral and VP.<p>I obviously mean DX11 on Linux for running Windows games, not DX11 on Sandy Bridge.","time":1493039752,"type":"comment"}],"parent":14182602,"text":"You are assuming one wants to do it.","time":1493033156,"type":"comment"}],"parent":14181886,"text":"Good luck getting that Direct3D to run on Os X or Linux. Without some hack solution like Wine.","time":1493020733,"type":"comment"},{"by":"shmerl","id":14181897,"kids":[{"by":"Const-me","id":14182021,"kids":[{"by":"shmerl","id":14182047,"kids":[{"by":"Const-me","id":14184248,"kids":[{"by":"shmerl","id":14186370,"kids":[{"by":"Const-me","id":14189545,"parent":14186370,"text":"Maybe they will, maybe not.<p>Before it happened, software developers need to choose whichever GPU API works best for their particular project.<p>Personally, I have not developed games for several years.<p>For the last 1.5 years, I’ve been working on a CAD&#x2F;CAM software. Traditionally people use OpenGL for this area. I have picked D3D 11 instead. The renderer is reasonably sophisticated; there are many complex shaders in there. The software is now used by thousands customers worldwide, and yet there were very few rendering-related bugs so far.","time":1493077762,"type":"comment"}],"parent":14184248,"text":"Modern engines will use Vulkan anyway.","time":1493056272,"type":"comment"}],"parent":14182047,"text":"Choose OpenGL 3.3, you’ll loose gamers running Windows on Sandy Bridge GPU.<p>Choose Direct3D 11, you’ll loose Linux gamers.<p>Are you sure in absolute numbers, there’re more people in the second group?","time":1493041691,"type":"comment"}],"parent":14182021,"text":"<i>&gt; That’s correct for AAA titles. Casual gamers however often play on PCs without a dedicated GPU.</i><p>Even in such case, they wouldn&#x27;t commonly use Sandy Bridge generation GPU. And those who use it, aren&#x27;t expecting recent games to support it (whether they are demanding or not). Increasing number of games already require OpenGL 4.x, even if they are not very demanding in practice. And now with Vulkan, older Intel GPUs simply won&#x27;t cut it anymore.","time":1493009433,"type":"comment"}],"parent":14181897,"text":"Yep, on Linux and OSX it supports OpenGL 3.3.<p>The hardware fully supports DX 10.1. DX 11 API works fine on that, with feature level 10.1.<p>&gt; I don&#x27;t think you need to worry about that when gaming is concerned though<p>That’s correct for AAA titles. Casual gamers however often play on PCs without a dedicated GPU.","time":1493008685,"type":"comment"}],"parent":14181886,"text":"Intel HD 3000 has better OpenGL support on Linux (thanks to Mesa). It&#x27;s at 4.0 with software implementation of ARB_gpu_shader_fp64. And I doubt it supports all of DX11 properly as well.<p>I don&#x27;t think you need to worry about that when gaming is concerned though. It&#x27;s too old and below minimum requirements of huge amount of games already.","time":1493006415,"type":"comment"}],"parent":14181405,"text":"&gt; OpenGL 3.3 is a pretty nice target<p>Intel HD 3000 (6 years old, much newer then Windows XP) only supports OpenGL 3.1 on Windows.<p>VmWare workstation only supports OpenGL 3.0 for Win7 guests.<p>Direct3D 11 works flawlessly on both of them.","time":1493006283,"type":"comment"}],"parent":14181252,"text":"That&#x27;s some impressive graphics fetishism on display there.  It&#x27;s hard not to take offense at the comment that anything less is not &quot;worthy&quot;.  Not everyone is a AAA studio with an engine development team, nor should everyone hold themselves to those standards of engine performance.<p>OpenGL 3.3 is a pretty nice target.  It&#x27;s easy to port an OpenGL 3.3 game to a lot of systems, including mobile, since OpenGL ES 2.1 is pretty similar, and Windows XP, which cannot run DirectX 10.  (This matters less as time goes on, but it&#x27;s been an important point in certain markets in Asia.)  So you can write the graphics code once, more or less, and run it everywhere, more or less.<p>The idea that somebody who chooses to do this is therefore not &quot;competent&quot; just boggles the mind.  No point in deriding engineers who decide not to use the latest bells and whistles in the graphics pipeline.  Maybe they just have other priorities.<p>(To clarify: the recommendation that everyone should just use OpenGL regardless of situation is, in fact, stupid.  So I agree with that part.  But it&#x27;s equally stupid to say that everyone should use D3D12 &#x2F; Metal regardless of circumstance.)","time":1492997759,"type":"comment"},{"by":"shmerl","id":14181395,"kids":[{"by":"cwyers","id":14181432,"kids":[{"by":"shmerl","id":14181446,"kids":[{"by":"klodolph","id":14181476,"kids":[{"by":"Qwertious","id":14183493,"kids":[{"by":"pjmlp","id":14183530,"kids":[{"by":"shmerl","id":14184040,"kids":[{"by":"pjmlp","id":14184279,"kids":[{"by":"shmerl","id":14186381,"parent":14184279,"text":"My point was, adoption in engines is relatively slow, but once it happens, things become easier. So current usage lists aren&#x27;t a reflection of general progress. Unity for example gained Vulkan support in the latest version which came out recently, and Unreal is still not there (but already close). Same goes for Lumberyard.<p>Of course the tax on development imposed by lock-in freaks translates into that slowness. I.e. as you said, need for engines to support many balkanized APIs means slower releases to the market.","time":1493056346,"type":"comment"}],"parent":14184040,"text":"A good gaming engine supports multiple graphics APIs, making specific ones irrelevant.","time":1493041916,"type":"comment"}],"parent":14183530,"text":"This is irrelevant. With all major engines gaining Vulkan support this list will baloon fast.","time":1493039940,"type":"comment"}],"parent":14183493,"text":"That is not what the lists of released AAA titles show.<p><a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;List_of_games_with_Vulkan_support\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;List_of_games_with_Vulkan_supp...</a><p><a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;List_of_games_with_DirectX_12_support\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;List_of_games_with_DirectX_12_...</a>","time":1493035369,"type":"comment"}],"parent":14181476,"text":"Vulkan has better performance than DX11, and it has literally twice the audience of DX12 - DX12 only supports Windows 10, so any W7&#x2F;W8&#x2F;etc users are SOL unless you use DX11 or Vulkan.","time":1493034949,"type":"comment"},{"by":"shmerl","id":14181480,"kids":[{"by":"klodolph","id":14181526,"parent":14181480,"text":"The cost of porting between DX12 and Vulkan is not so high, not anything like the cost of porting between OpenGL and DX11.","time":1493000401,"type":"comment"}],"parent":14181476,"text":"Isn&#x27;t it what MS is saying for DX12? Except Vulkan is not locked into MS only stuff.","time":1492999339,"type":"comment"}],"parent":14181446,"text":"So, &quot;Here, use a different API with worse developer support, and in return you get access to a market that&#x27;s ~1-2% the size of the Windows gaming market?&quot;<p>I mean, I&#x27;m all for OpenGL.  I use OpenGL.  Hell, I develop OpenGL games on Linux and then port them to Windows afterwards (released ~10 made that way so far).  But the choice to use it depends on what market you&#x27;re going after.","time":1492999285,"type":"comment"},{"by":"cwyers","id":14182196,"parent":14181446,"text":"In the abstract, performance may be unrelated to portability. But if tooling, drivers and expertise are all focused on DirectX, and if getting OpenGL to do everything DirectX can do requires using vendor-specific additions to the spec that are non-portable, then in practice, it may be harder to make OpenGL performant across multiple vendor&#x27;s GPUs.","time":1493013090,"type":"comment"}],"parent":14181432,"text":"Performance is orthogonal issue to portability. You can make it portable, and perform well too (using something like Vulkan and proper engine design).<p>Linux gaming market is growing. Not sure about other commercial software in this context, but I&#x27;d guess it can indirectly be affected too, since bigger gaming market makes Linux desktop usage grow in general.","time":1492998751,"type":"comment"},{"by":"douche","id":14181689,"kids":[{"by":"shmerl","id":14181851,"parent":14181689,"text":"Not everyone, but probably quite many.","time":1493005799,"type":"comment"}],"parent":14181432,"text":"Seriously, anyone who cares about cross-platform compatibility is already using Unity or Unreal.","time":1493003505,"type":"comment"}],"parent":14181395,"text":"The article you linked to is advice from people who port games to Linux on how to make games more portable. It&#x27;s not advice on how to ship them on time, how to make them performant, how to minimize the amount of developer labor required to build them. Given what a small share of the market Linux is for games, developers have other priorities than what makes games easy to port to Linux. And it&#x27;s not a chicken-and-egg problem; the Linux market for games isn&#x27;t much smaller than the Linux market for any other commercial software.","time":1492998404,"type":"comment"},{"by":"klodolph","id":14181455,"kids":[{"by":"shmerl","id":14181486,"kids":[{"by":"klodolph","id":14181516,"kids":[{"by":"shmerl","id":14181523,"kids":[{"by":"klodolph","id":14181578,"kids":[{"by":"shmerl","id":14181865,"parent":14181578,"text":"<i>&gt; Balkanized APIs are a historical fact.</i><p>Dark ages were long and historic too, which doesn&#x27;t mean they didn&#x27;t have a lot of problems :) So I find it a proper comparison. Those who insist on keeping things balkanized today (MS, Sony and Co), are slowing down the progress.<p><i>&gt; maybe everyone will switch from Direct3D to Vulkan for the same reason.</i><p>I definitely hope so. Current messed up state shouldn&#x27;t exist forever.","time":1493006014,"type":"comment"}],"parent":14181523,"text":"&quot;I&#x27;m calling it what it is,&quot; is a poor excuse for poor rhetoric.  Balkanized APIs are a historical fact.  Khronos wasn&#x27;t exactly quick to support modern hardware in the 2000s, everyone paid the price for it, Microsoft picked up the slack, and here we are with developers entrenched in the Direct3D ecosystem.  Vulkan arrived about a year ago and that&#x27;s not exactly a lot of time to sweep away all the inferior APIs before it.  These things take time.  The engine developers are figuring out how to use Vulkan, and Vulkan support is spreading.  It&#x27;s going to take more than a couple years.<p>Meanwhile, Microsoft is managing their profitable Windows business by supporting key app developers, including game studios, who are already happily using Direct3D.  Are they going to axe it and piss off a valuable segment of developers?  No.<p>The analogy with Flash is a pretty good one.  Flash was used everywhere on the web for years and years.  Then the iPhone sucked all the oxygen out of the room and Flash died.<p>Just like everyone switched from Flash to JavaScript so they could get their websites to run on the iPhone, maybe everyone will switch from Direct3D to Vulkan for the same reason.  Flash took a long time to die.  After Apple announced the iPhone would not support flash, it was five years later that YouTube stopped using it for video.  And yes, there were a lot of good reasons to require Flash in the meantime, until the open web caught up.","time":1493001489,"type":"comment"}],"parent":14181516,"text":"<i>&gt; That rhetoric about &quot;the dark ages&quot; is doing nobody any favors</i><p>I&#x27;m calling it what it is. Their refusal to support Vulkan shows they intend to remain in the dark ages, and continue forcing developers to operate with balkanized non portable APIs. It&#x27;s like some browser maker would refuse to support HTML and would require you to use ActiveX, Flash or whatever.","time":1493000369,"type":"comment"}],"parent":14181486,"text":"That rhetoric about &quot;the dark ages&quot; is doing nobody any favors, it almost makes it sounds like Sony uses tabs in their source code or something even worse.  Is this some kind of holy war, OpenGL versus the forces of darkness?<p>To clarify, yes, I was talking about PS4 and Xbox One.  Those two systems, plus Windows, are the primary market for most AAA games.  Just do a search for &quot;2017 video games&quot; and you&#x27;ll see a big chunk of games that only run on those three systems.  OpenGL isn&#x27;t a very compelling choice there.","time":1493000211,"type":"comment"},{"by":"douche","id":14181706,"parent":14181486,"text":"So a brand-new console from a company that has an abysmal record at working with third-party developers?<p>I kind of wish consoles would just go away, so we could focus on PCs.","time":1493003804,"type":"comment"},{"by":"pjmlp","id":14183395,"parent":14181486,"text":"Actually as second class citizens to help porting titles to it.<p>Switch first class citizen is called NVN.<p><a href=\"https:&#x2F;&#x2F;blogs.nvidia.com&#x2F;blog&#x2F;2016&#x2F;10&#x2F;20&#x2F;nintendo-switch\" rel=\"nofollow\">https:&#x2F;&#x2F;blogs.nvidia.com&#x2F;blog&#x2F;2016&#x2F;10&#x2F;20&#x2F;nintendo-switch</a><p>Also, MonoGame, Unreal and Unity are official supported middleware.","time":1493033358,"type":"comment"}],"parent":14181455,"text":"<i>&gt; Those consoles don&#x27;t really support OpenGL, at least not as a first-class citizen</i><p>Switch supports it now as first class citizen, and Vulkan as well. Nintendo were first to straighten this up. MS and Sony are still in the dark ages.","time":1492999448,"type":"comment"}],"parent":14181395,"text":"I&#x27;m going to agree with cwyers here.  The choice of which graphics API to use is not automatic, and &quot;just use OpenGL, dummy!&quot; just glosses over the fact that different developers have different priorities.<p>OpenGL gets you desktop and mobile all in one fell swoop (well, with a lot of tinkering and hard work).  If that&#x27;s your market, sure, go ahead.  If you&#x27;re writing a higher-end game targeting consoles and PC, then you&#x27;ll end up doing a lot of extra work porting your engine to consoles and in return have access to a much larger market.  Those consoles don&#x27;t really support OpenGL, at least not as a first-class citizen, but one of them does support Direct3D.  Direct3D also has excellent developer support.<p>Given the good support, good tool integration, and the fact that Direct3D runs on, say, two of your three most important platforms, it&#x27;s a good choice.","time":1492998972,"type":"comment"}],"parent":14181252,"text":"That&#x27;s smart. Those who don&#x27;t think about it in advance, are bitten by this later. Read the article above.<p>Metal is Apple&#x27;s lame attempt to tax cross platform graphics developers. That&#x27;s exactly what is emphasized there.","time":1492997413,"type":"comment"}],"parent":14180978,"text":"That&#x27;s stupid. Competent 3d on Windows is DirectX. Competent 3d on Mac&#x2F;ios is Metal. Competent 3d on consoles uses their propriatary API. So, what is the point of OpenGL portability? Between Linux and Android? You _will_ have to switch API if you are making anything worthy.","time":1492994571,"type":"comment"}],"parent":14180975,"text":"Well, it&#x27;s a counter point really, since all of that is unportable (without such kind of translation).<p>As developers put it here[1]: &quot;Don&#x27;t make a game that depends on Direct3D. All the hard hard work is getting the thing to run with OpenGL&quot;.<p>1. <a href=\"https:&#x2F;&#x2F;www.gamingonlinux.com&#x2F;articles&#x2F;about-linux-games-being-delayed-a-chat-with-several-game-developers-and-porters.9491\" rel=\"nofollow\">https:&#x2F;&#x2F;www.gamingonlinux.com&#x2F;articles&#x2F;about-linux-games-bei...</a>","time":1492989590,"type":"comment"}],"parent":14180948,"text":"I think that is kind of the point.","time":1492989492,"type":"comment"}],"parent":14180919,"text":"All of that is outside of the spec. That has nothing to do with 3D graphics. MS just lumped it all together and called it DX.","time":1492988918,"type":"comment"}],"parent":14180722,"text":"Because for fonts, textures, windowing, effects, materials, requires the use of third party libraries outside the spec.<p>Also it is stuck in a C world API, with each binding being a third party library with different degrees of coverage.","time":1492988434,"type":"comment"},{"by":"Const-me","id":14181287,"parent":14180722,"text":"Also on Windows, Direct3D is better supported.<p>If you write an app based on Direct3D 9 or 11, it usually just works on any supported version of Windows.<p>I once wrote an app that uses OpenGL 4.0 (this one: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;Const-me&#x2F;GL3Windows\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;Const-me&#x2F;GL3Windows</a>), and it only worked on half of my PCs. To make it work everywhere, I had to downgrade to OpenGL 3.0, and also implement S3 texture decompression on the CPU.","time":1492995475,"type":"comment"},{"by":"AldousHaxley","id":14181521,"parent":14180722,"text":"GL 3.x <i>is</i> my current go to for the case of needing simple immediate mode 3D rendering. But it&#x27;s still Bring Your Own Matrices&#x2F;Texture Loading&#x2F;Text Rendering&#x2F;Model Loading, and D3D9 + D3DX had that all in a nice package. Like I said, stitching this stuff together isn&#x27;t the hardest thing ever, but it&#x27;s nice to have a basic set of boilerplate that&#x27;s idiomatically consistent and works out of the box.","time":1493000328,"type":"comment"},{"by":"douche","id":14181677,"parent":14180722,"text":"Because OpenGL is a dumpster fire of conflicting information for a beginner. I&#x27;ve been looking for a decent opengl book for years, in vain. DirectX 9 was sort of the sweet spot, where the technology stabilized for a few years at something decent. Nonetheless, aside from dumping the useful parts of d3dx, DirectX 11 is a lot friendlier to work with.","time":1493003275,"type":"comment"}],"parent":14180533,"text":"Why not OpenGL 3.2+? It is capable of modern effects and pretty easy to use.","time":1492985807,"type":"comment"},{"by":"Merad","id":14180906,"kids":[{"by":"Jare","id":14181079,"kids":[{"by":"AldousHaxley","id":14181530,"parent":14181079,"text":"bgfx looks really cool, thanks for letting me know about it!","time":1493000427,"type":"comment"}],"parent":14180906,"text":"I&#x27;m thinking more like bgfx, which is a cross platform API to access vertex and index buffers, textures, rendertargets, shaders and render states. Primitives like models, sprites, fonts, etc are up to you but the repo contains examples with extra utilities for those things.","time":1492991217,"type":"comment"},{"by":"AldousHaxley","id":14181112,"parent":14180906,"text":"Those are higher level scene graphs. D3D9 was an immediate mode API with some helper libraries, so you still were in control of your app&#x27;s rendering architecture.","time":1492992019,"type":"comment"}],"parent":14180533,"text":"Doesn&#x27;t a 3D graphics (not game) engine like OGRE or Irrlicht fill this void?  I don&#x27;t know if either one supports DX12&#x2F;Vulkan yet, but I imagine they will in the not too distant future.","time":1492988281,"type":"comment"},{"by":"breakingcups","id":14182610,"parent":14180533,"text":"The original Xbox also ran D3D9.\nAfter getting my hands on the XDK for that box I had a lot of fun with it, I see your point regarding the sweet spot.","time":1493020848,"type":"comment"}],"parent":14180034,"text":"D3D9 is my all-time favorite 3D API. It was at that sweet spot of being powerful enough that you could do stunning things with it (the Xbox 360 generation is effectively D3D9-level hardware), and it was simple enough that amateurs and hobbyists (and high school kids, as I was at the time) could dive in and get stuff on the screen relatively quickly. D3DX had some handy helper libraries for loading models, doing transforms, and loading textures. I get the benefits afforded by subsequent iterations, and nowadays Vulkan and D3D12, but their interfaces are so optimized toward specialists, and it would be nice if more was in place to cover that middle ground use case between &quot;I don&#x27;t need a full-on 3D game engine, but I don&#x27;t need to worry about low level GPU stuff either.&quot; Of the new APIs out there, I feel like Metal is the only one approaching layperson usability, and it&#x27;s trapped in the world of Mac and iOS. Of course you can stitch together something that looks like an open source equivalent of the old D3D9 SDK yourself from things like glm and AssImp, but it&#x27;s nice to have all that in one package.","time":1492982531,"type":"comment"},{"by":"partycoder","id":14182948,"kids":[{"by":"AldousHaxley","id":14183435,"kids":[{"by":"yuhong","id":14190993,"parent":14183435,"text":"My favorite is how I was able to guess from Intel&#x27;s claims that the 915 chipset can&#x27;t support WDDM because it don&#x27;t have a &quot;hardware scheduler&quot; that it is probably referring to the &quot;lost devices&quot; in old DirectX that many programmers likely remember.<p>Edit: Old Slashdot thread: <a href=\"https:&#x2F;&#x2F;slashdot.org&#x2F;comments.pl?sid=4123465&amp;cid=44660047\" rel=\"nofollow\">https:&#x2F;&#x2F;slashdot.org&#x2F;comments.pl?sid=4123465&amp;cid=44660047</a>","time":1493097779,"type":"comment"}],"parent":14182948,"text":"I remember those anxious days before Longhorn&#x27;s release. MS was making a lot of weird threats back then. All the &quot;trusted computing&quot; stuff, as well as the thinly veiled attempts at killing OpenGL on Windows. Despite my above waxing nostalgic about the API, I haven&#x27;t built anything with D3D in years, for precisely the issues you mentioned. API design quality and performance are important, but they are far from the only factors that go into making such a decision.","time":1493034295,"type":"comment"},{"by":"pjmlp","id":14183895,"parent":14182948,"text":"Game consoles also don&#x27;t do any OpenGL, despite urban legends.","time":1493038453,"type":"comment"}],"parent":14180034,"text":"Direct3D can be a good API, but Microsoft played dirty to make it succeed, and that matters.<p>If you were around those days, Microsoft said that OpenGL on Windows was going to be put behind a backward compatibility layer, with a performance penalty. All developers got scared and switched to Direct3D.<p>For this reason, I don&#x27;t care if Direct3D is a good API. Direct3D is the reason of why most games cannot be ported into other operating systems or are forced to run on WINE (with issues and performance penalty), and is also the reason of why Windows has a larger market share than it should.<p>I really hope Vulkan takes off and replaces Direct3D for most uses.","time":1493026500,"type":"comment"},{"by":"shmerl","id":14180941,"kids":[{"by":"coldpie","id":14184007,"parent":14180941,"text":"Yeah. Open any source file and you&#x27;ll see dozens of &quot;not implemented yet&quot; FIXMEs. This needs a few more years of maturity before it&#x27;s worth looking at.","time":1493039689,"type":"comment"}],"parent":14180034,"text":"It seems very far from completion in comparison with D3D9 implementation in Wine. So for now it&#x27;s just a interesting project, rather than something practical.","time":1492988792,"type":"comment"},{"by":"oneplane","id":14180164,"kids":[{"by":"mixedCase","id":14180613,"parent":14180164,"text":"It would translate D3D9 to Vulkan like Wine currently translates D3D9 to OpenGL.<p>It&#x27;s different from Gallium Nine.","time":1492983948,"type":"comment"},{"by":"TazeTSchnitzel","id":14180369,"parent":14180164,"text":"Well, this <i>is</i> translating it to something else, no? Just Vulkan is more low-level than Direct3D.","time":1492980614,"type":"comment"},{"by":"cyphar","id":14180200,"parent":14180164,"text":"I believe so too, from the repo:<p>&gt; Runs Direct3D 9 applications on Windows or Linux (&#x2F;w Wine) over Vulkan.","time":1492978264,"type":"comment"},{"by":"helb","id":14180223,"parent":14180164,"text":"I think it does. There is another project called Gallium Nine, too. Never got it to work on my system though. The first paragraph in VK9&#x27;s FAQ actually compares the two: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;disks86&#x2F;VK9&#x2F;wiki&#x2F;F.A.Q\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;disks86&#x2F;VK9&#x2F;wiki&#x2F;F.A.Q</a>.","time":1492978507,"type":"comment"}],"parent":14180034,"text":"I&#x27;m not sure if this means what I think this means, but does this mean that we can used Direct3D 9 on WINE now with no need to translate it to something else first?","time":1492977906,"type":"comment"},{"by":"red023","id":14181555,"kids":[{"by":"zamalek","id":14182638,"parent":14181555,"text":"&gt; Wine already can do DX9 pretty good.<p>I would assume that performance would be low-hanging fruit. OpenGL and DirectX work quite differently, so translating the calls of one to the other <i>should</i> involve quite a bit of work&#x2F;CPU cycles. Vulkan, being closer to metal, should be a more straightforward translation target.<p>Example: HLSL-to-GLSL is likely a difficult problem, where HLSL-to-SPIR-V is probably much simpler.<p>&gt; Who cares about DX9 nowadays?<p>Lots of games still support it. In addition this layer could be used for future work in DX11&#x2F;DX12, instead of the (per my above argument) more complex OpenGL translator.","time":1493021205,"type":"comment"},{"by":"cwyers","id":14181876,"kids":[{"by":"shmerl","id":14182076,"parent":14181876,"text":"<i>&gt; What good would open-sourcing DirectX be without the Windows Display Driver Model? And how easy would it be to get that working without the NT kernel?</i><p>Shouldn&#x27;t be harder than what Wine is already doing. Open sourcing can surely help in some ways. MS for example already open sourced HLSL parser, so translation tools can benefit from it.<p>DX11 support in Wine is progressing quite well.","time":1493010290,"type":"comment"}],"parent":14181555,"text":"What good would open-sourcing DirectX be without the Windows Display Driver Model? And how easy would it be to get that working without the NT kernel? And how interested would the Linux kernel be in supporting this?","time":1493006132,"type":"comment"},{"by":"Arwill","id":14182754,"parent":14181555,"text":"What about older games? I think this would make it possible to improve graphics of those games by going trough Vulcan and adding new features to the pipeline. With Steam and GOG there is a big market for older games and for older games with renewed graphics and up to date compatibility.","time":1493023064,"type":"comment"}],"parent":14180034,"text":"Why should this excite me? Wine already can do DX9 pretty good. And according to one comment this does not even compare. Who cares about DX9 nowadays? DX10&#x2F;11&#x2F;12 would be very different story. Something like this bringing modern windows games to linux would be great.<p>Even greater would be M$ open sourcing DX but that will not happen in the next few years.","time":1493001008,"type":"comment"},{"by":"edwin_frc","dead":true,"id":14180487,"parent":14180034,"text":"The compatibility of this products with vulkan","time":1492982012,"type":"comment"},{"by":"artana","dead":true,"id":14184357,"parent":14180034,"text":"<a href=\"http:&#x2F;&#x2F;www.webmhs.com&#x2F;2017&#x2F;04&#x2F;prediksi-skor-juventus-vs-genoa.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.webmhs.com&#x2F;2017&#x2F;04&#x2F;prediksi-skor-juventus-vs-geno...</a>","time":1493042512,"type":"comment"}],"id":14180034,"score":205,"url":"https://github.com/disks86/VK9","by":"desdiv"},"14199125":{"time":1493162517,"type":"story","descendants":50,"title":"Best Linux Distros for Gaming in 2017","kids":[{"by":"Fletch137","id":14201634,"kids":[{"by":"onli","id":14201921,"kids":[{"by":"Fletch137","id":14202306,"kids":[{"by":"onli","id":14202647,"parent":14202306,"text":"&gt; <i>When I installed Solus around 4 months ago, steam was noticably faster on the same hardware than it was when installed on Ubuntu</i><p>That&#x27;s not impossible, but are you sure that did not come from moving to newer driver versions? Especially if you use the Mesa driver each new version in the last year or so brought very big performance improvements.","time":1493212515,"type":"comment"}],"parent":14201921,"text":"For what it&#x27;s worth, using the solus steam runtime (SLI) I see noticable improvements over steam-native.<p>When I installed Solus around 4 months ago, steam was noticably faster on the same hardware than it was when installed on Ubuntu.<p>There are probably ways to get the same experience on Ubuntu, but if I were a non-technical user I think I&#x27;d only really care about which gave me the best experience out of the box.","time":1493208775,"type":"comment"}],"parent":14201634,"text":"Oh, that looks very nice. Thanks for the hint.<p>The article does got not really go into the real issues with Linux gaming and instead just mainly presents some gaming targeting distros. There are only two things that are important:<p>1. Can you get Steam running?<p>2. Do you get modern versions of your gpu driver?<p>Ubuntu is good for both, though you need a PPA to get the current Mesa driver, which is the only choice for AMD gpus (and that driver works great!). Otherwise a rolling release distro like gentoo is actually great for gaming, since you get the current driver, but it takes some effort to get Steam to work (also because of 64-bit vs 32-bit). I needed to delete old steam libs[0], set the LIBGL_DRIVERS_PATH for Steam[1] and then, depending on the game, need to re-set the game-specific LIBGL_DRIVERS_PATH[2] again.<p>If Solus integrates Steam automatically and also has current drivers(?), that would make it a good alternative.<p>[0]: <a href=\"http:&#x2F;&#x2F;www.funtoo.org&#x2F;Steam#OpenGL_GLX_context_is_not_using_direct_rendering\" rel=\"nofollow\">http:&#x2F;&#x2F;www.funtoo.org&#x2F;Steam#OpenGL_GLX_context_is_not_using_...</a><p>[1]: LIBGL_DRIVERS_PATH=&quot;&#x2F;usr&#x2F;lib32&#x2F;dri&quot; LIBGL_DEBUG=&quot;verbose&quot; &#x2F;usr&#x2F;bin&#x2F;steam<p>[2]: Set `LIBGL_DRIVERS_PATH=&#x2F;usr&#x2F;lib&#x2F;dri %command%` in the Launch options of the games Steam Properties.","time":1493202678,"type":"comment"},{"by":"darklajid","id":14202064,"kids":[{"by":"Fletch137","id":14202276,"parent":14202064,"text":"It&#x27;s not something I&#x27;ve used to any great extent, just that I use the steam runtime developed for it on my arch system and the lead developer has been a guest on a few podcasts I&#x27;ve listened to. That said, this is my impression of it so far:<p>Solus is a distribution built from scratch. I believe the main target is non-technical end users, rather than, say, servers or power users. What that quite equates to, I don&#x27;t really know beyond missing certain development or server software from the base install and in some cases the repositories. I currently can&#x27;t see a way to install external packages (like the AUR or PPAs). I&#x27;ve had a play with it for a couple of hours and it&#x27;s pretty slick, with really fast start up times. It&#x27;s probably not ready for you to hand to your Grandmother just yet, but it seems very user-friendly to me. I have it currently running on a laptop I gave to a friend around 4 months ago, and so far it&#x27;s the only distribution I&#x27;ve been able to hand over to a non-technical user and not get called to fix&#x2F;change&#x2F;etc. every couple of weeks.","time":1493208431,"type":"comment"},{"by":"onli","id":14202128,"parent":14202064,"text":"Till OP answers have a look at <a href=\"https:&#x2F;&#x2F;distrowatch.com&#x2F;table.php?distribution=solus\" rel=\"nofollow\">https:&#x2F;&#x2F;distrowatch.com&#x2F;table.php?distribution=solus</a>.","time":1493206120,"type":"comment"}],"parent":14201634,"text":"Can you explain what that (Solus) is? The website is rather light on details. Maybe a distribution. With three different DE editions, one being &#x27;home-grown&#x27;.<p>I haven&#x27;t found any information about the history of the project, if it&#x27;s built from scratch or based on another distribution&#x27;s work. Can&#x27;t even figure that out by looking at the &#x27;how to install software&#x27; documentation - it just gives a screenshot of a GUI package installer, no clue what the package manager is.<p>Searching Google for Solus (or Solus Project) comes up empty or with a survival game based on the Unreal 4 engine.<p>What is Solus?<p>Edit: While their website answered none of my questions, distrowatch and wikipedia did. Started as Debian based distribution, seems to be something completely new&#x2F;different now.","time":1493204877,"type":"comment"}],"parent":14199125,"text":"It&#x27;s quite surprising that he doesn&#x27;t mention Solus - quite a lot of effort has gone into making Steam run as well as possible. The readme at the following URL goes into detail about the problems with the steam-native-runtime, and how Solus tries to rectify the issues.<p><a href=\"https:&#x2F;&#x2F;github.com&#x2F;solus-project&#x2F;linux-steam-integration\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;solus-project&#x2F;linux-steam-integration</a>","time":1493198517,"type":"comment"},{"by":"hd4","id":14201200,"kids":[{"by":"tehmaco","id":14201663,"kids":[{"by":"loudmax","id":14202369,"parent":14201663,"text":"Same here, I have a Linux Mint desktop set up for my kids and overall I&#x27;m happy with the performance.  It hasn&#x27;t been 100% smooth though.  In particular updating from Mint 17 to Mint 18 took some effort to get things working properly.  Maybe proprietary Nvidia drivers were to blame, but it didn&#x27;t Just Work until I sat down with it and sorted things out.","time":1493209675,"type":"comment"},{"by":"apexalpha","id":14201703,"kids":[{"by":"wideem","id":14202218,"kids":[{"by":"pjmlp","id":14202320,"kids":[{"by":"YSFEJ4SWJUVU6","id":14202336,"parent":14202320,"text":"Except it doesn&#x27;t... (See for example perhaps the single most relevant example: <a href=\"https:&#x2F;&#x2F;packages.debian.org&#x2F;jessie&#x2F;nvidia-driver\" rel=\"nofollow\">https:&#x2F;&#x2F;packages.debian.org&#x2F;jessie&#x2F;nvidia-driver</a>)<p>Not that I&#x27;m saying that Debian is a better choice than Ubuntu here – Debian stable is Debian stable, and Ubuntu often contains stuff still considered experimental on Debian side – but unlike with, say, Fedora, many non-free drivers are included in the official repositories.","time":1493209114,"type":"comment"}],"parent":14202218,"text":"Except that Debian lacks those precious closed source drivers.","time":1493208926,"type":"comment"}],"parent":14201703,"text":"Ubuntu 16.04 LTS is based on Debian gnu&#x2F;linux","time":1493207730,"type":"comment"}],"parent":14201663,"text":"Mint, in turn, is based on Ubuntu 16.04 LTS.","time":1493199398,"type":"comment"}],"parent":14201200,"text":"I&#x27;ve been using Steam on Linux Mint for a few years, and generally everything Just Works(tm).","time":1493198886,"type":"comment"},{"by":"Jedd","id":14201251,"kids":[{"by":"izacus","id":14201508,"parent":14201251,"text":"Installing proprietary drivers is harder and pretty much all game devs test only with Ubuntu so you might get issues due to slightly different versions of some libraries.<p>Ubuntu is the distro everyone is targeting so for seamless experience you kinda need to stick with it.<p>(That doesn&#x27;t mean other distros won&#x27;t work tho.)","time":1493196775,"type":"comment"},{"by":"flukus","id":14201310,"parent":14201251,"text":"Debian is ideologically opposed to things like closed source drivers that ubuntu makes easy. Not that there&#x27;s anything wrong with that, it just makes it not a good choice for casual users and especially gamers.","time":1493194083,"type":"comment"},{"by":"hd4","id":14201305,"parent":14201251,"text":"I haven&#x27;t tried installing it in Debian, I only have it installed as a GUI-less server, but in theory it should be fine.<p>The reason I mention Ubuntu is that the community is just much larger than that of Debian and there is more of a chance of someone already having solved any issues you may run into.","time":1493194058,"type":"comment"},{"by":"bblough","id":14203484,"parent":14201251,"text":"In my experience, steam works just fine under Debian.  I previously ran it under Jessie with no problems, and currently run it under the pre-release version of Stretch also with no problems.","time":1493218570,"type":"comment"},{"by":"basemi","id":14201284,"parent":14201251,"text":"It works just fine!","time":1493193747,"type":"comment"}],"parent":14201200,"text":"Would Debian be a smarter choice?   Ubuntu&#x27;s based on Debian GNU&#x2F;Linux, and hardware support tends to come downstream from there.  Steam based their OS on Debian, not Ubuntu.   Do you know of any issues installing the .deb onto Debian?","time":1493193397,"type":"comment"},{"by":"aquabib","id":14202570,"parent":14201200,"text":"You can install Steam and NVIDIA proprietary drivers just fine on Arch Linux or any other distro, as well.<p>Ubuntu is the only officially supported distro, as in mentioned in system requirements, just because it&#x27;s the most ubiquitous distro. It doesn&#x27;t actually mean you will have any less problems with the problematic Linux games on Ubuntu, than on any other distro.<p>On Arch, with an NVIDIA card, getting this &quot;all&quot; up and running boils down to: sudo pacman -S steam nvidia<p>This gives you the most recent NVIDIA driver, 378.13-5.","time":1493211853,"type":"comment"}],"parent":14199125,"text":"Ubuntu would be the smartest choice. It&#x27;s got the best support of any Linux distro, and you can install Steam on it just fine with the deb.","time":1493192458,"type":"comment"},{"by":"em3rgent0rdr","id":14201157,"kids":[{"by":"tacticalgoose","id":14201208,"kids":[{"by":"anc84","id":14201590,"parent":14201208,"text":"Well, I would be surprised if people install Linux just for gaming. OP basically said that Steam works just fine on the distro they are already using.","time":1493197924,"type":"comment"}],"parent":14201157,"text":"I could imagine this article caters to the less experienced on the linux gaming subject. Haven&#x27;t used Arch linux my self, but I&#x27;ve heard that it requires tinkering to get it to run like a shelf OS. Which is something that can be daunting for someone with no experience in linux","time":1493192656,"type":"comment"}],"parent":14199125,"text":"I just install steam on my arch linux machine, seems to work fine, with only the occasional issue for the lastest game.","time":1493191978,"type":"comment"},{"by":"JamesMcMinn","id":14201215,"kids":[{"by":"bromonkey","id":14201280,"kids":[{"by":"jug","id":14201480,"parent":14201280,"text":"Hm, I use an nVidia 970 GTX and all I had to do on Fedora to install those was (following enabling RPM Fusion):<p><pre><code>    dnf install xorg-x11-drv-nvidia akmod-nvidia &quot;kernel-devel-uname-r == $(uname -r)&quot;\n    dnf update -y</code></pre>","time":1493196334,"type":"comment"},{"by":"bubblethink","id":14201862,"parent":14201280,"text":"Give negativo17 a try for fedora. It does a very good job of packaging drivers, cuda etc. I also think that the situation is improving significantly in fedora 26.","time":1493201788,"type":"comment"}],"parent":14201215,"text":"For sure man, installing Nvidia drivers on Solus is a breeze compared to some other distros (I&#x27;m looking at you Fedora). Unfortunately I find Solus package repos to be rather lacking, but it works well enough that I use it on my desktop.","time":1493193726,"type":"comment"}],"parent":14199125,"text":"Solus[1] has a good reputation for gaming in my experience.<p>[1] <a href=\"https:&#x2F;&#x2F;solus-project.com\" rel=\"nofollow\">https:&#x2F;&#x2F;solus-project.com</a>","time":1493192742,"type":"comment"},{"by":"tjpnz","id":14202332,"kids":[{"by":"loudmax","id":14202510,"kids":[{"by":"aquabib","id":14202612,"parent":14202510,"text":"Many missing, sure, but at least we have started getting titles from the more known publishers and developers: Dirt Rally, Alien Isolation, Pillars of Eternity, Sid Meier&#x27;s Civilization VI, Total War: WARHAMMER, Hitman, BioShock Infinite, XCOM 2, Deus Ex: Mankind Divided, Mad Max, Dying Light, Torment: Tides of Numenera, and Valve&#x27;s own games.<p>As for numbers, there are 1950 Linux games on GOG and 6000+ on Steam.","time":1493212231,"type":"comment"}],"parent":14202332,"text":"We&#x27;re still missing big AAA titles.  But there are hundreds (thousands?) of independent titles and fantastic games to choose from now.  A lot of the change is surely due to the Unity game engine.","time":1493211075,"type":"comment"},{"by":"Al-Khwarizmi","id":14202514,"kids":[{"by":"tjpnz","id":14203246,"parent":14202514,"text":"True but the companies involved wouldn&#x27;t have bothered porting to Linux if they didn&#x27;t expect to see growth in that space. What&#x27;s really interesting is that there are Linux ports for some of the SDKs. Really makes me question those who downplay Linux as serious platform for anything that isn&#x27;t server related.","time":1493216920,"type":"comment"},{"by":"cholantesh","id":14203083,"parent":14202514,"text":"Good point; Unreal Engine has improved drastically in recent years and Unity adoption has been soaring. Whatever the cause, the consumer wins.","time":1493215868,"type":"comment"}],"parent":14202332,"text":"Or maybe it says that multiplatform game engines have become popular.","time":1493211109,"type":"comment"}],"parent":14199125,"text":"It blows my mind that only five years ago gaming on Linux was but for a few exceptions a complete non-starter. The big argument being made then was there was simply no money in it. The number of titles available now certainly says otherwise.","time":1493209057,"type":"comment"},{"by":"la_oveja","id":14201898,"kids":[{"by":"onli","id":14201946,"parent":14201898,"text":"The keywords you are looking for are PCI-passthrough, KVM and VT-d. It is possible and performance is as great as it sounds, but it does not work on every hardware. <a href=\"https:&#x2F;&#x2F;scottlinux.com&#x2F;2016&#x2F;08&#x2F;28&#x2F;gpu-passthrough-with-kvm-and-debian-linux&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;scottlinux.com&#x2F;2016&#x2F;08&#x2F;28&#x2F;gpu-passthrough-with-kvm-a...</a> is a howto. I did not do this myself yet, would need a second gpu (I think that is about to change, but support for shared passthrough gpus - really not sure how that is called - is not there yet).","time":1493203107,"type":"comment"},{"by":"mxvzr","id":14202666,"parent":14201898,"text":"I tried it two years ago. I couldn&#x27;t tell the difference performance wise. A large majority of the games in my (extensive) stream library worked. Some wouldn&#x27;t stream to my Steam Link [1] (black screen). Couldn&#x27;t get controllers to work on a few of them. One or two didn&#x27;t have sound. One in particular would crash and somehow make the VM unbootable. Made two attempts with that game and ended up giving up after that.<p>The host system was Arch, the guest was Windows 7. Fedora is the only other distro I ever heard being it done on. This page [2] was very helpful.<p>[1] <a href=\"http:&#x2F;&#x2F;store.steampowered.com&#x2F;app&#x2F;353380&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;store.steampowered.com&#x2F;app&#x2F;353380&#x2F;</a><p>[2] <a href=\"https:&#x2F;&#x2F;wiki.archlinux.org&#x2F;index.php&#x2F;PCI_passthrough_via_OVMF\" rel=\"nofollow\">https:&#x2F;&#x2F;wiki.archlinux.org&#x2F;index.php&#x2F;PCI_passthrough_via_OVM...</a>","time":1493212648,"type":"comment"},{"by":"jrimbault","id":14202019,"parent":14201898,"text":"There&#x27;s a subreddit dedicated to that: r&#x2F;VFIO","time":1493204183,"type":"comment"},{"by":"neverminder","id":14201950,"parent":14201898,"text":"Seems to be a pretty detailed article: <a href=\"https:&#x2F;&#x2F;davidyat.es&#x2F;2016&#x2F;09&#x2F;08&#x2F;gpu-passthrough&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;davidyat.es&#x2F;2016&#x2F;09&#x2F;08&#x2F;gpu-passthrough&#x2F;</a>","time":1493203217,"type":"comment"},{"by":"blibble","id":14202223,"parent":14201898,"text":"it works perfectly, around 97% of the native performance (according to 3dmark)<p>I&#x27;ve been using mine for almost 2 years now, the only problems I had was laggy&#x2F;glitchy sound (which was fixed by an extra $20 soundcard and a line-in cable)","time":1493207827,"type":"comment"}],"parent":14199125,"text":"Any info about making a VM running Windows that takes all the power from GPU? I&#x27;d want to do that, but I&#x27;m not sure it&#x27;s possible","time":1493202306,"type":"comment"},{"by":"arca_vorago","id":14202527,"kids":[{"by":"foob","id":14202689,"kids":[{"by":"arca_vorago","id":14249068,"parent":14202689,"text":"I am really picky about the kernel choice, so maybe that&#x27;s why I haven&#x27;t run into similar issues.","time":1493749270,"type":"comment"}],"parent":14202527,"text":"Do you really notice better stability with Manjaro or is it more about the straightforward installation and configuration? I ask because I gave Manjaro a try and I encountered many Manjaro-specific problems over time (notably, a lot of issues with their custom kernel builds). I&#x27;ve since been much happier with Antergos which I view as the best of both worlds. It doesn&#x27;t try to fix the things that aren&#x27;t broken in Arch but does make desktop configuration a breeze.","time":1493212829,"type":"comment"}],"parent":14199125,"text":"Manjaro hands down these days for me at least. All the arch edge but with  a bit less crashing. The hw detection tools is second to none, steam just works, so does wine, etc. I&#x27;m even devving my own project on the Linux editor of UE4, which crashes all the time because Epic.<p>I tend to distrohop very frequently, but I haven&#x27;t moved from manjaro for months now.","time":1493211295,"type":"comment"},{"by":"onmobiletemp","id":14205605,"parent":14199125,"text":"A while ago i tried dual booting elementaryos on my windows machine. Steam and counter strike global offensive work just fine. Half life 2 as well. After realizing that i could play cs on eos, i simply had no reason to go back to windows.","time":1493231058,"type":"comment"},{"by":"msh","id":14201969,"parent":14199125,"text":"Streamos: <a href=\"http:&#x2F;&#x2F;store.steampowered.com&#x2F;steamos&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;store.steampowered.com&#x2F;steamos&#x2F;</a>","time":1493203504,"type":"comment"},{"by":"orschiro","id":14202508,"kids":[{"by":"aquabib","id":14202659,"parent":14202508,"text":"Yes.","time":1493212606,"type":"comment"}],"parent":14199125,"text":"Doesn&#x27;t any distro do the job on which you can install proprietary graphic drivers and Steam?","time":1493211065,"type":"comment"},{"by":"tofflos","id":14204236,"parent":14199125,"text":"No mention of the Windows Subsystem for Linux? Seems like the obvious choice for a gamer.","time":1493222815,"type":"comment"},{"by":"ensiferum","id":14201125,"kids":[{"by":"pbhjpbhj","id":14201434,"parent":14201125,"text":"Steam works fine on my Kubuntu, more games than I can possibly play in a lifetime, and of every sort imaginable.<p>It <i>is</i> limited for those who want to, say, play a new AAA FPS game ever day. But that&#x27;s got to be pretty unusual?","time":1493195841,"type":"comment"}],"parent":14199125,"text":"none","time":1493191555,"type":"comment"}],"id":14199125,"score":82,"url":"https://thishosting.rocks/best-linux-distros-for-gaming/","by":"nickreiner"},"14225701":{"time":1493457114,"type":"story","descendants":4,"title":"What Bullets Do to Bodies","kids":[{"by":"pps43","id":14226306,"kids":[{"by":"jrnichols","id":14227098,"parent":14226306,"text":"&quot;Applying to emotion&quot;<p>Which is typical of huffpo. they&#x27;ve been rabidly anti gun&#x2F;anti second amendment for years. This writer is no different.<p>Don&#x27;t forget their mashing statistics together to make something sound different. &quot;More than 30,000 people die of gunshot wounds each year in America&quot; - The only figures I see coming close to that are ones that lump suicides in as well.","time":1493481099,"type":"comment"},{"by":"nlp7","id":14226563,"kids":[{"by":"pps43","id":14226828,"parent":14226563,"text":"Charlie Hebdo editor applied for a carry permit and was denied, because France is a civilized country and nobody needs guns. Not even police guards at Charlie Hebdo.<p>In America, he would have killed Saïd and Chérif Kouachi and got away with it. But in Europe Kouachi brothers were able to express their beliefs without fear of gun violence.","time":1493477745,"type":"comment"}],"parent":14226306,"text":"Correct. In Europe we are all dead from criminals since we had nothing to defend ourselves.","time":1493473544,"type":"comment"}],"parent":14225701,"text":"Let&#x27;s count the signs.<p>Applying to emotion (&quot;the blood, the pictures of bodies torn by bullets&quot;).<p>Showing only one side of the story (ignoring all the people who were able to defend themselves with a gun). &quot;Rafi Colon was shot once in the abdomen with a 9 mm handgun during a home invasion in September 2005.&quot; Did Rafi have a gun in the house? Did he fight back? If no, why? Did Lamont Randell have a gun to defend himself from robbers? If no, why not?<p>Using non-neutral language (&quot;gun violence&quot; makes as much sense as &quot;asphalt violence&quot;).<p>Knowing little about guns (AK-47s are pretty rare in the US because of the NFA).<p>Concentrating on the symptom rather than the cause. Addressing gang violence or rethinking war on drugs is not as easy as saying &quot;guns are bad, amirite?&quot;","time":1493469765,"type":"comment"}],"id":14225701,"score":14,"url":"http://highline.huffingtonpost.com/articles/en/gun-violence/","by":"DiabloD3"}}